FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/*
 *
 * Copyright (c) 2010 - 2021, Nordic Semiconductor ASA All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 * contributors may be used to endorse or promote products derived from this
 * software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 */

#ifndef __NRF5340_APPLICATION_BITS_H
#define __NRF5340_APPLICATION_BITS_H

/*lint ++flb "Enter library region" */

/* Peripheral: CACHEDATA */
/* Description: CACHEDATA */

/* Register: CACHEDATA_SET_WAY_DATA0 */
/* Description: Description cluster: Cache data bits [31:0] of SET[n], WAY[o]. */

/* Bits 31..0 : Data */
#define CACHEDATA_SET_WAY_DATA0_Data_Pos    ( 0UL )                                              /*!< Position of Data field. */
#define CACHEDATA_SET_WAY_DATA0_Data_Msk    ( 0xFFFFFFFFUL << CACHEDATA_SET_WAY_DATA0_Data_Pos ) /*!< Bit mask of Data field. */

/* Register: CACHEDATA_SET_WAY_DATA1 */
/* Description: Description cluster: Cache data bits [63:32] of SET[n], WAY[o]. */

/* Bits 31..0 : Data */
#define CACHEDATA_SET_WAY_DATA1_Data_Pos    ( 0UL )                                              /*!< Position of Data field. */
#define CACHEDATA_SET_WAY_DATA1_Data_Msk    ( 0xFFFFFFFFUL << CACHEDATA_SET_WAY_DATA1_Data_Pos ) /*!< Bit mask of Data field. */

/* Register: CACHEDATA_SET_WAY_DATA2 */
/* Description: Description cluster: Cache data bits [95:64] of SET[n], WAY[o]. */

/* Bits 31..0 : Data */
#define CACHEDATA_SET_WAY_DATA2_Data_Pos    ( 0UL )                                              /*!< Position of Data field. */
#define CACHEDATA_SET_WAY_DATA2_Data_Msk    ( 0xFFFFFFFFUL << CACHEDATA_SET_WAY_DATA2_Data_Pos ) /*!< Bit mask of Data field. */

/* Register: CACHEDATA_SET_WAY_DATA3 */
/* Description: Description cluster: Cache data bits [127:96] of SET[n], WAY[o]. */

/* Bits 31..0 : Data */
#define CACHEDATA_SET_WAY_DATA3_Data_Pos    ( 0UL )                                              /*!< Position of Data field. */
#define CACHEDATA_SET_WAY_DATA3_Data_Msk    ( 0xFFFFFFFFUL << CACHEDATA_SET_WAY_DATA3_Data_Pos ) /*!< Bit mask of Data field. */


/* Peripheral: CACHEINFO */
/* Description: CACHEINFO */

/* Register: CACHEINFO_SET_WAY */
/* Description: Description collection: Cache information for SET[n], WAY[o]. */

/* Bit 31 : Most recently used way. */
#define CACHEINFO_SET_WAY_MRU_Pos      ( 31UL )                               /*!< Position of MRU field. */
#define CACHEINFO_SET_WAY_MRU_Msk      ( 0x1UL << CACHEINFO_SET_WAY_MRU_Pos ) /*!< Bit mask of MRU field. */
#define CACHEINFO_SET_WAY_MRU_Way0     ( 0UL )                                /*!< Way0 was most recently used */
#define CACHEINFO_SET_WAY_MRU_Way1     ( 1UL )                                /*!< Way1 was most recently used */

/* Bit 30 : Valid bit */
#define CACHEINFO_SET_WAY_V_Pos        ( 30UL )                             /*!< Position of V field. */
#define CACHEINFO_SET_WAY_V_Msk        ( 0x1UL << CACHEINFO_SET_WAY_V_Pos ) /*!< Bit mask of V field. */
#define CACHEINFO_SET_WAY_V_Invalid    ( 0UL )                              /*!< Invalid cache line */
#define CACHEINFO_SET_WAY_V_Valid      ( 1UL )                              /*!< Valid cache line */

/* Bits 16..0 : Cache tag. */
#define CACHEINFO_SET_WAY_TAG_Pos      ( 0UL )                                    /*!< Position of TAG field. */
#define CACHEINFO_SET_WAY_TAG_Msk      ( 0x1FFFFUL << CACHEINFO_SET_WAY_TAG_Pos ) /*!< Bit mask of TAG field. */


/* Peripheral: CACHE */
/* Description: Cache */

/* Register: CACHE_PROFILING_IHIT */
/* Description: Description cluster: Instruction fetch cache hit counter for cache region n, where n=0 means Flash and n=1 means XIP. */

/* Bits 31..0 : Number of instruction cache hits */
#define CACHE_PROFILING_IHIT_HITS_Pos    ( 0UL )                                           /*!< Position of HITS field. */
#define CACHE_PROFILING_IHIT_HITS_Msk    ( 0xFFFFFFFFUL << CACHE_PROFILING_IHIT_HITS_Pos ) /*!< Bit mask of HITS field. */

/* Register: CACHE_PROFILING_IMISS */
/* Description: Description cluster: Instruction fetch cache miss counter for cache region n, where n=0 means Flash and n=1 means XIP. */

/* Bits 31..0 : Number of instruction cache misses */
#define CACHE_PROFILING_IMISS_MISSES_Pos    ( 0UL )                                              /*!< Position of MISSES field. */
#define CACHE_PROFILING_IMISS_MISSES_Msk    ( 0xFFFFFFFFUL << CACHE_PROFILING_IMISS_MISSES_Pos ) /*!< Bit mask of MISSES field. */

/* Register: CACHE_PROFILING_DHIT */
/* Description: Description cluster: Data fetch cache hit counter for cache region n, where n=0 means Flash and n=1 means XIP. */

/* Bits 31..0 : Number of data cache hits */
#define CACHE_PROFILING_DHIT_HITS_Pos    ( 0UL )                                           /*!< Position of HITS field. */
#define CACHE_PROFILING_DHIT_HITS_Msk    ( 0xFFFFFFFFUL << CACHE_PROFILING_DHIT_HITS_Pos ) /*!< Bit mask of HITS field. */

/* Register: CACHE_PROFILING_DMISS */
/* Description: Description cluster: Data fetch cache miss counter for cache region n, where n=0 means Flash and n=1 means XIP. */

/* Bits 31..0 : Number of data cache misses */
#define CACHE_PROFILING_DMISS_MISSES_Pos    ( 0UL )                                              /*!< Position of MISSES field. */
#define CACHE_PROFILING_DMISS_MISSES_Msk    ( 0xFFFFFFFFUL << CACHE_PROFILING_DMISS_MISSES_Pos ) /*!< Bit mask of MISSES field. */

