FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: CACHE_ENABLE */
/* Description: Enable cache. */

/* Bit 0 : Enable cache */
#define CACHE_ENABLE_ENABLE_Pos         ( 0UL )                              /*!< Position of ENABLE field. */
#define CACHE_ENABLE_ENABLE_Msk         ( 0x1UL << CACHE_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define CACHE_ENABLE_ENABLE_Disabled    ( 0UL )                              /*!< Disable cache */
#define CACHE_ENABLE_ENABLE_Enabled     ( 1UL )                              /*!< Enable cache */

/* Register: CACHE_INVALIDATE */
/* Description: Invalidate the cache. */

/* Bit 0 : Invalidate the cache */
#define CACHE_INVALIDATE_INVALIDATE_Pos           ( 0UL )                                      /*!< Position of INVALIDATE field. */
#define CACHE_INVALIDATE_INVALIDATE_Msk           ( 0x1UL << CACHE_INVALIDATE_INVALIDATE_Pos ) /*!< Bit mask of INVALIDATE field. */
#define CACHE_INVALIDATE_INVALIDATE_Invalidate    ( 1UL )                                      /*!< Invalidate the cache */

/* Register: CACHE_ERASE */
/* Description: Erase the cache. */

/* Bit 0 : Erase the cache */
#define CACHE_ERASE_ERASE_Pos      ( 0UL )                            /*!< Position of ERASE field. */
#define CACHE_ERASE_ERASE_Msk      ( 0x1UL << CACHE_ERASE_ERASE_Pos ) /*!< Bit mask of ERASE field. */
#define CACHE_ERASE_ERASE_Erase    ( 1UL )                            /*!< Erase cache */

/* Register: CACHE_PROFILINGENABLE */
/* Description: Enable the profiling counters. */

/* Bit 0 : Enable the profiling counters */
#define CACHE_PROFILINGENABLE_ENABLE_Pos        ( 0UL )                                       /*!< Position of ENABLE field. */
#define CACHE_PROFILINGENABLE_ENABLE_Msk        ( 0x1UL << CACHE_PROFILINGENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define CACHE_PROFILINGENABLE_ENABLE_Disable    ( 0UL )                                       /*!< Disable profiling */
#define CACHE_PROFILINGENABLE_ENABLE_Enable     ( 1UL )                                       /*!< Enable profiling */

/* Register: CACHE_PROFILINGCLEAR */
/* Description: Clear the profiling counters. */

/* Bit 0 : Clearing the profiling counters */
#define CACHE_PROFILINGCLEAR_CLEAR_Pos      ( 0UL )                                     /*!< Position of CLEAR field. */
#define CACHE_PROFILINGCLEAR_CLEAR_Msk      ( 0x1UL << CACHE_PROFILINGCLEAR_CLEAR_Pos ) /*!< Bit mask of CLEAR field. */
#define CACHE_PROFILINGCLEAR_CLEAR_Clear    ( 1UL )                                     /*!< Clear the profiling counters */

/* Register: CACHE_MODE */
/* Description: Cache mode. Switching from Cache to Ram mode causes the RAM to be cleared. Switching from RAM to Cache mode causes the cache to be invalidated. */

/* Bit 0 : Cache mode */
#define CACHE_MODE_MODE_Pos      ( 0UL )                          /*!< Position of MODE field. */
#define CACHE_MODE_MODE_Msk      ( 0x1UL << CACHE_MODE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define CACHE_MODE_MODE_Cache    ( 0UL )                          /*!< Cache mode */
#define CACHE_MODE_MODE_Ram      ( 1UL )                          /*!< RAM mode */

/* Register: CACHE_DEBUGLOCK */
/* Description: Lock debug mode. */

/* Bit 0 : Lock debug mode */
#define CACHE_DEBUGLOCK_DEBUGLOCK_Pos         ( 0UL )                                    /*!< Position of DEBUGLOCK field. */
#define CACHE_DEBUGLOCK_DEBUGLOCK_Msk         ( 0x1UL << CACHE_DEBUGLOCK_DEBUGLOCK_Pos ) /*!< Bit mask of DEBUGLOCK field. */
#define CACHE_DEBUGLOCK_DEBUGLOCK_Unlocked    ( 0UL )                                    /*!< Debug mode unlocked */
#define CACHE_DEBUGLOCK_DEBUGLOCK_Locked      ( 1UL )                                    /*!< Debug mode locked */

/* Register: CACHE_ERASESTATUS */
/* Description: Cache erase status. */

/* Bit 0 : Cache erase status */
#define CACHE_ERASESTATUS_ERASESTATUS_Pos         ( 0UL )                                        /*!< Position of ERASESTATUS field. */
#define CACHE_ERASESTATUS_ERASESTATUS_Msk         ( 0x1UL << CACHE_ERASESTATUS_ERASESTATUS_Pos ) /*!< Bit mask of ERASESTATUS field. */
#define CACHE_ERASESTATUS_ERASESTATUS_Idle        ( 0UL )                                        /*!< Erase is not complete or hasn't started */
#define CACHE_ERASESTATUS_ERASESTATUS_Finished    ( 1UL )                                        /*!< Cache erase is finished */

/* Register: CACHE_WRITELOCK */
/* Description: Lock cache updates. Prevents updating of cache content on cache misses, but will continue to lookup instruction/data fetches in content already present in the cache. Ignored in RAM mode. */

/* Bit 0 : Lock cache updates */
#define CACHE_WRITELOCK_WRITELOCK_Pos         ( 0UL )                                    /*!< Position of WRITELOCK field. */
#define CACHE_WRITELOCK_WRITELOCK_Msk         ( 0x1UL << CACHE_WRITELOCK_WRITELOCK_Pos ) /*!< Bit mask of WRITELOCK field. */
#define CACHE_WRITELOCK_WRITELOCK_Unlocked    ( 0UL )                                    /*!< Cache updates unlocked */
#define CACHE_WRITELOCK_WRITELOCK_Locked      ( 1UL )                                    /*!< Cache updates locked */


/* Peripheral: CLOCK */
/* Description: Clock management 0 */

/* Register: CLOCK_TASKS_HFCLKSTART */
/* Description: Start HFCLK128M/HFCLK64M source as selected in HFCLKSRC */

/* Bit 0 : Start HFCLK128M/HFCLK64M source as selected in HFCLKSRC */
#define CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Pos        ( 0UL )                                                  /*!< Position of TASKS_HFCLKSTART field. */
#define CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Msk        ( 0x1UL << CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Pos ) /*!< Bit mask of TASKS_HFCLKSTART field. */
#define CLOCK_TASKS_HFCLKSTART_TASKS_HFCLKSTART_Trigger    ( 1UL )                                                  /*!< Trigger task */

/* Register: CLOCK_TASKS_HFCLKSTOP */
/* Description: Stop HFCLK128M/HFCLK64M source */

/* Bit 0 : Stop HFCLK128M/HFCLK64M source */
#define CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Pos        ( 0UL )                                                /*!< Position of TASKS_HFCLKSTOP field. */
#define CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Msk        ( 0x1UL << CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Pos ) /*!< Bit mask of TASKS_HFCLKSTOP field. */
#define CLOCK_TASKS_HFCLKSTOP_TASKS_HFCLKSTOP_Trigger    ( 1UL )                                                /*!< Trigger task */

/* Register: CLOCK_TASKS_LFCLKSTART */
/* Description: Start LFCLK source as selected in LFCLKSRC */

/* Bit 0 : Start LFCLK source as selected in LFCLKSRC */
#define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos        ( 0UL )                                                  /*!< Position of TASKS_LFCLKSTART field. */
#define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Msk        ( 0x1UL << CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Pos ) /*!< Bit mask of TASKS_LFCLKSTART field. */
#define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger    ( 1UL )                                                  /*!< Trigger task */

