FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Enable or disable interrupt for event LFCLKSTARTED */
#define CLOCK_INTEN_LFCLKSTARTED_Pos              ( 1UL )                                   /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTEN_LFCLKSTARTED_Msk              ( 0x1UL << CLOCK_INTEN_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTEN_LFCLKSTARTED_Disabled         ( 0UL )                                   /*!< Disable */
#define CLOCK_INTEN_LFCLKSTARTED_Enabled          ( 1UL )                                   /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event HFCLKSTARTED */
#define CLOCK_INTEN_HFCLKSTARTED_Pos              ( 0UL )                                   /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTEN_HFCLKSTARTED_Msk              ( 0x1UL << CLOCK_INTEN_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTEN_HFCLKSTARTED_Disabled         ( 0UL )                                   /*!< Disable */
#define CLOCK_INTEN_HFCLKSTARTED_Enabled          ( 1UL )                                   /*!< Enable */

/* Register: CLOCK_INTENSET */
/* Description: Enable interrupt */

/* Bit 9 : Write '1' to enable interrupt for event HFCLK192MSTARTED */
#define CLOCK_INTENSET_HFCLK192MSTARTED_Pos          ( 9UL )                                          /*!< Position of HFCLK192MSTARTED field. */
#define CLOCK_INTENSET_HFCLK192MSTARTED_Msk          ( 0x1UL << CLOCK_INTENSET_HFCLK192MSTARTED_Pos ) /*!< Bit mask of HFCLK192MSTARTED field. */
#define CLOCK_INTENSET_HFCLK192MSTARTED_Disabled     ( 0UL )                                          /*!< Read: Disabled */
#define CLOCK_INTENSET_HFCLK192MSTARTED_Enabled      ( 1UL )                                          /*!< Read: Enabled */
#define CLOCK_INTENSET_HFCLK192MSTARTED_Set          ( 1UL )                                          /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event HFCLKAUDIOSTARTED */
#define CLOCK_INTENSET_HFCLKAUDIOSTARTED_Pos         ( 8UL )                                           /*!< Position of HFCLKAUDIOSTARTED field. */
#define CLOCK_INTENSET_HFCLKAUDIOSTARTED_Msk         ( 0x1UL << CLOCK_INTENSET_HFCLKAUDIOSTARTED_Pos ) /*!< Bit mask of HFCLKAUDIOSTARTED field. */
#define CLOCK_INTENSET_HFCLKAUDIOSTARTED_Disabled    ( 0UL )                                           /*!< Read: Disabled */
#define CLOCK_INTENSET_HFCLKAUDIOSTARTED_Enabled     ( 1UL )                                           /*!< Read: Enabled */
#define CLOCK_INTENSET_HFCLKAUDIOSTARTED_Set         ( 1UL )                                           /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event DONE */
#define CLOCK_INTENSET_DONE_Pos                      ( 7UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENSET_DONE_Msk                      ( 0x1UL << CLOCK_INTENSET_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENSET_DONE_Disabled                 ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENSET_DONE_Enabled                  ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENSET_DONE_Set                      ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENSET_LFCLKSTARTED_Pos              ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Msk              ( 0x1UL << CLOCK_INTENSET_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Disabled         ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Enabled          ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Set              ( 1UL )                                      /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENSET_HFCLKSTARTED_Pos              ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Msk              ( 0x1UL << CLOCK_INTENSET_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Disabled         ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Enabled          ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Set              ( 1UL )                                      /*!< Enable */

/* Register: CLOCK_INTENCLR */
/* Description: Disable interrupt */

/* Bit 9 : Write '1' to disable interrupt for event HFCLK192MSTARTED */
#define CLOCK_INTENCLR_HFCLK192MSTARTED_Pos          ( 9UL )                                          /*!< Position of HFCLK192MSTARTED field. */
#define CLOCK_INTENCLR_HFCLK192MSTARTED_Msk          ( 0x1UL << CLOCK_INTENCLR_HFCLK192MSTARTED_Pos ) /*!< Bit mask of HFCLK192MSTARTED field. */
#define CLOCK_INTENCLR_HFCLK192MSTARTED_Disabled     ( 0UL )                                          /*!< Read: Disabled */
#define CLOCK_INTENCLR_HFCLK192MSTARTED_Enabled      ( 1UL )                                          /*!< Read: Enabled */
#define CLOCK_INTENCLR_HFCLK192MSTARTED_Clear        ( 1UL )                                          /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event HFCLKAUDIOSTARTED */
#define CLOCK_INTENCLR_HFCLKAUDIOSTARTED_Pos         ( 8UL )                                           /*!< Position of HFCLKAUDIOSTARTED field. */
#define CLOCK_INTENCLR_HFCLKAUDIOSTARTED_Msk         ( 0x1UL << CLOCK_INTENCLR_HFCLKAUDIOSTARTED_Pos ) /*!< Bit mask of HFCLKAUDIOSTARTED field. */
#define CLOCK_INTENCLR_HFCLKAUDIOSTARTED_Disabled    ( 0UL )                                           /*!< Read: Disabled */
#define CLOCK_INTENCLR_HFCLKAUDIOSTARTED_Enabled     ( 1UL )                                           /*!< Read: Enabled */
#define CLOCK_INTENCLR_HFCLKAUDIOSTARTED_Clear       ( 1UL )                                           /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event DONE */
#define CLOCK_INTENCLR_DONE_Pos                      ( 7UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENCLR_DONE_Msk                      ( 0x1UL << CLOCK_INTENCLR_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENCLR_DONE_Disabled                 ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENCLR_DONE_Enabled                  ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENCLR_DONE_Clear                    ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENCLR_LFCLKSTARTED_Pos              ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Msk              ( 0x1UL << CLOCK_INTENCLR_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Disabled         ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Enabled          ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Clear            ( 1UL )                                      /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENCLR_HFCLKSTARTED_Pos              ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Msk              ( 0x1UL << CLOCK_INTENCLR_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Disabled         ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Enabled          ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Clear            ( 1UL )                                      /*!< Disable */

