FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 16 : LFCLK state */
#define CLOCK_LFCLKSTAT_STATE_Pos                   ( 16UL )                               /*!< Position of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_Msk                   ( 0x1UL << CLOCK_LFCLKSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_NotRunning            ( 0UL )                                /*!< LFCLK not running */
#define CLOCK_LFCLKSTAT_STATE_Running               ( 1UL )                                /*!< LFCLK running */

/* Bit 4 : ALWAYSRUN activated */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_Pos           ( 4UL )                                        /*!< Position of ALWAYSRUNNING field. */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_Msk           ( 0x1UL << CLOCK_LFCLKSTAT_ALWAYSRUNNING_Pos ) /*!< Bit mask of ALWAYSRUNNING field. */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_NotRunning    ( 0UL )                                        /*!< Automatic clock control enabled */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_Running       ( 1UL )                                        /*!< Oscillator is always running */

/* Bits 1..0 : Active clock source */
#define CLOCK_LFCLKSTAT_SRC_Pos                     ( 0UL )                              /*!< Position of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_Msk                     ( 0x3UL << CLOCK_LFCLKSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_LFRC                    ( 1UL )                              /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSTAT_SRC_LFXO                    ( 2UL )                              /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSTAT_SRC_LFSYNT                  ( 3UL )                              /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_LFCLKSRCCOPY */
/* Description: Copy of LFCLKSRC register, set when LFCLKSTART task was triggered */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRCCOPY_SRC_Pos       ( 0UL )                                 /*!< Position of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_Msk       ( 0x3UL << CLOCK_LFCLKSRCCOPY_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_LFRC      ( 1UL )                                 /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_LFXO      ( 2UL )                                 /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_LFSYNT    ( 3UL )                                 /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_HFCLKAUDIORUN */
/* Description: Status indicating that HFCLKAUDIOSTART task has been triggered */

/* Bit 0 : HFCLKAUDIOSTART task triggered or not */
#define CLOCK_HFCLKAUDIORUN_STATUS_Pos             ( 0UL )                                     /*!< Position of STATUS field. */
#define CLOCK_HFCLKAUDIORUN_STATUS_Msk             ( 0x1UL << CLOCK_HFCLKAUDIORUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_HFCLKAUDIORUN_STATUS_NotTriggered    ( 0UL )                                     /*!< Task not triggered */
#define CLOCK_HFCLKAUDIORUN_STATUS_Triggered       ( 1UL )                                     /*!< Task triggered */

/* Register: CLOCK_HFCLKAUDIOSTAT */
/* Description: Status indicating which HFCLKAUDIO source is running */

/* Bit 16 : HFCLKAUDIO state */
#define CLOCK_HFCLKAUDIOSTAT_STATE_Pos                   ( 16UL )                                    /*!< Position of STATE field. */
#define CLOCK_HFCLKAUDIOSTAT_STATE_Msk                   ( 0x1UL << CLOCK_HFCLKAUDIOSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_HFCLKAUDIOSTAT_STATE_NotRunning            ( 0UL )                                     /*!< HFCLKAUDIO not running */
#define CLOCK_HFCLKAUDIOSTAT_STATE_Running               ( 1UL )                                     /*!< HFCLKAUDIO running */

/* Bit 4 : ALWAYSRUN activated */
#define CLOCK_HFCLKAUDIOSTAT_ALWAYSRUNNING_Pos           ( 4UL )                                             /*!< Position of ALWAYSRUNNING field. */
#define CLOCK_HFCLKAUDIOSTAT_ALWAYSRUNNING_Msk           ( 0x1UL << CLOCK_HFCLKAUDIOSTAT_ALWAYSRUNNING_Pos ) /*!< Bit mask of ALWAYSRUNNING field. */
#define CLOCK_HFCLKAUDIOSTAT_ALWAYSRUNNING_NotRunning    ( 0UL )                                             /*!< Automatic clock control enabled */
#define CLOCK_HFCLKAUDIOSTAT_ALWAYSRUNNING_Running       ( 1UL )                                             /*!< Oscillator is always running */

/* Register: CLOCK_HFCLK192MRUN */
/* Description: Status indicating that HFCLK192MSTART task has been triggered */

/* Bit 0 : HFCLK192MSTART task triggered or not */
#define CLOCK_HFCLK192MRUN_STATUS_Pos             ( 0UL )                                    /*!< Position of STATUS field. */
#define CLOCK_HFCLK192MRUN_STATUS_Msk             ( 0x1UL << CLOCK_HFCLK192MRUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_HFCLK192MRUN_STATUS_NotTriggered    ( 0UL )                                    /*!< Task not triggered */
#define CLOCK_HFCLK192MRUN_STATUS_Triggered       ( 1UL )                                    /*!< Task triggered */

/* Register: CLOCK_HFCLK192MSTAT */
/* Description: Status indicating which HFCLK192M source is running */

/* Bit 16 : HFCLK192M state */
#define CLOCK_HFCLK192MSTAT_STATE_Pos                   ( 16UL )                                   /*!< Position of STATE field. */
#define CLOCK_HFCLK192MSTAT_STATE_Msk                   ( 0x1UL << CLOCK_HFCLK192MSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_HFCLK192MSTAT_STATE_NotRunning            ( 0UL )                                    /*!< HFCLK192M not running */
#define CLOCK_HFCLK192MSTAT_STATE_Running               ( 1UL )                                    /*!< HFCLK192M running */

/* Bit 4 : ALWAYSRUN activated */
#define CLOCK_HFCLK192MSTAT_ALWAYSRUNNING_Pos           ( 4UL )                                            /*!< Position of ALWAYSRUNNING field. */
#define CLOCK_HFCLK192MSTAT_ALWAYSRUNNING_Msk           ( 0x1UL << CLOCK_HFCLK192MSTAT_ALWAYSRUNNING_Pos ) /*!< Bit mask of ALWAYSRUNNING field. */
#define CLOCK_HFCLK192MSTAT_ALWAYSRUNNING_NotRunning    ( 0UL )                                            /*!< Automatic clock control enabled */
#define CLOCK_HFCLK192MSTAT_ALWAYSRUNNING_Running       ( 1UL )                                            /*!< Oscillator is always running */

/* Bit 0 : Active clock source */
#define CLOCK_HFCLK192MSTAT_SRC_Pos                     ( 0UL )                                  /*!< Position of SRC field. */
#define CLOCK_HFCLK192MSTAT_SRC_Msk                     ( 0x1UL << CLOCK_HFCLK192MSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLK192MSTAT_SRC_HFINT                   ( 0UL )                                  /*!< Clock source: HFINT - on-chip oscillator */
#define CLOCK_HFCLK192MSTAT_SRC_HFXO                    ( 1UL )                                  /*!< Clock source: HFXO - derived from external 32 MHz crystal oscillator */

/* Register: CLOCK_HFCLKSRC */
/* Description: Clock source for HFCLK128M/HFCLK64M */

/* Bit 0 : Select which HFCLK source is started by the HFCLKSTART task */
#define CLOCK_HFCLKSRC_SRC_Pos      ( 0UL )                             /*!< Position of SRC field. */
#define CLOCK_HFCLKSRC_SRC_Msk      ( 0x1UL << CLOCK_HFCLKSRC_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLKSRC_SRC_HFINT    ( 0UL )                             /*!< HFCLKSTART task starts HFINT oscillator */
#define CLOCK_HFCLKSRC_SRC_HFXO     ( 1UL )                             /*!< HFCLKSTART task starts HFXO oscillator */

