FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Peripheral: COMP */
/* Description: Comparator 0 */

/* Register: COMP_TASKS_START */
/* Description: Start comparator */

/* Bit 0 : Start comparator */
#define COMP_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define COMP_TASKS_START_TASKS_START_Msk        ( 0x1UL << COMP_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define COMP_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: COMP_TASKS_STOP */
/* Description: Stop comparator */

/* Bit 0 : Stop comparator */
#define COMP_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define COMP_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << COMP_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define COMP_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: COMP_TASKS_SAMPLE */
/* Description: Sample comparator value */

/* Bit 0 : Sample comparator value */
#define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos        ( 0UL )                                         /*!< Position of TASKS_SAMPLE field. */
#define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Msk        ( 0x1UL << COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos ) /*!< Bit mask of TASKS_SAMPLE field. */
#define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: COMP_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define COMP_SUBSCRIBE_START_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define COMP_SUBSCRIBE_START_EN_Msk         ( 0x1UL << COMP_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define COMP_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define COMP_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define COMP_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define COMP_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << COMP_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: COMP_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define COMP_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define COMP_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << COMP_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define COMP_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define COMP_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define COMP_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define COMP_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << COMP_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: COMP_SUBSCRIBE_SAMPLE */
/* Description: Subscribe configuration for task SAMPLE */

/* Bit 31 :   */
#define COMP_SUBSCRIBE_SAMPLE_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define COMP_SUBSCRIBE_SAMPLE_EN_Msk         ( 0x1UL << COMP_SUBSCRIBE_SAMPLE_EN_Pos ) /*!< Bit mask of EN field. */
#define COMP_SUBSCRIBE_SAMPLE_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define COMP_SUBSCRIBE_SAMPLE_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SAMPLE will subscribe to */
#define COMP_SUBSCRIBE_SAMPLE_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define COMP_SUBSCRIBE_SAMPLE_CHIDX_Msk      ( 0xFFUL << COMP_SUBSCRIBE_SAMPLE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: COMP_EVENTS_READY */
/* Description: COMP is ready and output is valid */

/* Bit 0 : COMP is ready and output is valid */
#define COMP_EVENTS_READY_EVENTS_READY_Pos             ( 0UL )                                         /*!< Position of EVENTS_READY field. */
#define COMP_EVENTS_READY_EVENTS_READY_Msk             ( 0x1UL << COMP_EVENTS_READY_EVENTS_READY_Pos ) /*!< Bit mask of EVENTS_READY field. */
#define COMP_EVENTS_READY_EVENTS_READY_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define COMP_EVENTS_READY_EVENTS_READY_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: COMP_EVENTS_DOWN */
/* Description: Downward crossing */

/* Bit 0 : Downward crossing */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_Pos             ( 0UL )                                       /*!< Position of EVENTS_DOWN field. */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_Msk             ( 0x1UL << COMP_EVENTS_DOWN_EVENTS_DOWN_Pos ) /*!< Bit mask of EVENTS_DOWN field. */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_NotGenerated    ( 0UL )                                       /*!< Event not generated */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_Generated       ( 1UL )                                       /*!< Event generated */

/* Register: COMP_EVENTS_UP */
/* Description: Upward crossing */

/* Bit 0 : Upward crossing */
#define COMP_EVENTS_UP_EVENTS_UP_Pos             ( 0UL )                                   /*!< Position of EVENTS_UP field. */
#define COMP_EVENTS_UP_EVENTS_UP_Msk             ( 0x1UL << COMP_EVENTS_UP_EVENTS_UP_Pos ) /*!< Bit mask of EVENTS_UP field. */
#define COMP_EVENTS_UP_EVENTS_UP_NotGenerated    ( 0UL )                                   /*!< Event not generated */
#define COMP_EVENTS_UP_EVENTS_UP_Generated       ( 1UL )                                   /*!< Event generated */

/* Register: COMP_EVENTS_CROSS */
/* Description: Downward or upward crossing */

/* Bit 0 : Downward or upward crossing */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_Pos             ( 0UL )                                         /*!< Position of EVENTS_CROSS field. */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_Msk             ( 0x1UL << COMP_EVENTS_CROSS_EVENTS_CROSS_Pos ) /*!< Bit mask of EVENTS_CROSS field. */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: COMP_PUBLISH_READY */
/* Description: Publish configuration for event READY */

/* Bit 31 :   */
#define COMP_PUBLISH_READY_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define COMP_PUBLISH_READY_EN_Msk         ( 0x1UL << COMP_PUBLISH_READY_EN_Pos ) /*!< Bit mask of EN field. */
#define COMP_PUBLISH_READY_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define COMP_PUBLISH_READY_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event READY will publish to. */
#define COMP_PUBLISH_READY_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define COMP_PUBLISH_READY_CHIDX_Msk      ( 0xFFUL << COMP_PUBLISH_READY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: COMP_PUBLISH_DOWN */
/* Description: Publish configuration for event DOWN */

/* Bit 31 :   */
#define COMP_PUBLISH_DOWN_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define COMP_PUBLISH_DOWN_EN_Msk         ( 0x1UL << COMP_PUBLISH_DOWN_EN_Pos ) /*!< Bit mask of EN field. */
#define COMP_PUBLISH_DOWN_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define COMP_PUBLISH_DOWN_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event DOWN will publish to. */
#define COMP_PUBLISH_DOWN_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define COMP_PUBLISH_DOWN_CHIDX_Msk      ( 0xFFUL << COMP_PUBLISH_DOWN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: COMP_PUBLISH_UP */
/* Description: Publish configuration for event UP */

/* Bit 31 :   */
#define COMP_PUBLISH_UP_EN_Pos         ( 31UL )                            /*!< Position of EN field. */
#define COMP_PUBLISH_UP_EN_Msk         ( 0x1UL << COMP_PUBLISH_UP_EN_Pos ) /*!< Bit mask of EN field. */
#define COMP_PUBLISH_UP_EN_Disabled    ( 0UL )                             /*!< Disable publishing */
#define COMP_PUBLISH_UP_EN_Enabled     ( 1UL )                             /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event UP will publish to. */
#define COMP_PUBLISH_UP_CHIDX_Pos      ( 0UL )                                 /*!< Position of CHIDX field. */
#define COMP_PUBLISH_UP_CHIDX_Msk      ( 0xFFUL << COMP_PUBLISH_UP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: COMP_PUBLISH_CROSS */
/* Description: Publish configuration for event CROSS */

/* Bit 31 :   */
#define COMP_PUBLISH_CROSS_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define COMP_PUBLISH_CROSS_EN_Msk         ( 0x1UL << COMP_PUBLISH_CROSS_EN_Pos ) /*!< Bit mask of EN field. */
#define COMP_PUBLISH_CROSS_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define COMP_PUBLISH_CROSS_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CROSS will publish to. */
#define COMP_PUBLISH_CROSS_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define COMP_PUBLISH_CROSS_CHIDX_Msk      ( 0xFFUL << COMP_PUBLISH_CROSS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

