FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: COMP_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 4 : Shortcut between event CROSS and task STOP */
#define COMP_SHORTS_CROSS_STOP_Pos           ( 4UL )                                 /*!< Position of CROSS_STOP field. */
#define COMP_SHORTS_CROSS_STOP_Msk           ( 0x1UL << COMP_SHORTS_CROSS_STOP_Pos ) /*!< Bit mask of CROSS_STOP field. */
#define COMP_SHORTS_CROSS_STOP_Disabled      ( 0UL )                                 /*!< Disable shortcut */
#define COMP_SHORTS_CROSS_STOP_Enabled       ( 1UL )                                 /*!< Enable shortcut */

/* Bit 3 : Shortcut between event UP and task STOP */
#define COMP_SHORTS_UP_STOP_Pos              ( 3UL )                              /*!< Position of UP_STOP field. */
#define COMP_SHORTS_UP_STOP_Msk              ( 0x1UL << COMP_SHORTS_UP_STOP_Pos ) /*!< Bit mask of UP_STOP field. */
#define COMP_SHORTS_UP_STOP_Disabled         ( 0UL )                              /*!< Disable shortcut */
#define COMP_SHORTS_UP_STOP_Enabled          ( 1UL )                              /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DOWN and task STOP */
#define COMP_SHORTS_DOWN_STOP_Pos            ( 2UL )                                /*!< Position of DOWN_STOP field. */
#define COMP_SHORTS_DOWN_STOP_Msk            ( 0x1UL << COMP_SHORTS_DOWN_STOP_Pos ) /*!< Bit mask of DOWN_STOP field. */
#define COMP_SHORTS_DOWN_STOP_Disabled       ( 0UL )                                /*!< Disable shortcut */
#define COMP_SHORTS_DOWN_STOP_Enabled        ( 1UL )                                /*!< Enable shortcut */

/* Bit 1 : Shortcut between event READY and task STOP */
#define COMP_SHORTS_READY_STOP_Pos           ( 1UL )                                 /*!< Position of READY_STOP field. */
#define COMP_SHORTS_READY_STOP_Msk           ( 0x1UL << COMP_SHORTS_READY_STOP_Pos ) /*!< Bit mask of READY_STOP field. */
#define COMP_SHORTS_READY_STOP_Disabled      ( 0UL )                                 /*!< Disable shortcut */
#define COMP_SHORTS_READY_STOP_Enabled       ( 1UL )                                 /*!< Enable shortcut */

/* Bit 0 : Shortcut between event READY and task SAMPLE */
#define COMP_SHORTS_READY_SAMPLE_Pos         ( 0UL )                                   /*!< Position of READY_SAMPLE field. */
#define COMP_SHORTS_READY_SAMPLE_Msk         ( 0x1UL << COMP_SHORTS_READY_SAMPLE_Pos ) /*!< Bit mask of READY_SAMPLE field. */
#define COMP_SHORTS_READY_SAMPLE_Disabled    ( 0UL )                                   /*!< Disable shortcut */
#define COMP_SHORTS_READY_SAMPLE_Enabled     ( 1UL )                                   /*!< Enable shortcut */

/* Register: COMP_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 3 : Enable or disable interrupt for event CROSS */
#define COMP_INTEN_CROSS_Pos         ( 3UL )                           /*!< Position of CROSS field. */
#define COMP_INTEN_CROSS_Msk         ( 0x1UL << COMP_INTEN_CROSS_Pos ) /*!< Bit mask of CROSS field. */
#define COMP_INTEN_CROSS_Disabled    ( 0UL )                           /*!< Disable */
#define COMP_INTEN_CROSS_Enabled     ( 1UL )                           /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event UP */
#define COMP_INTEN_UP_Pos            ( 2UL )                        /*!< Position of UP field. */
#define COMP_INTEN_UP_Msk            ( 0x1UL << COMP_INTEN_UP_Pos ) /*!< Bit mask of UP field. */
#define COMP_INTEN_UP_Disabled       ( 0UL )                        /*!< Disable */
#define COMP_INTEN_UP_Enabled        ( 1UL )                        /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event DOWN */
#define COMP_INTEN_DOWN_Pos          ( 1UL )                          /*!< Position of DOWN field. */
#define COMP_INTEN_DOWN_Msk          ( 0x1UL << COMP_INTEN_DOWN_Pos ) /*!< Bit mask of DOWN field. */
#define COMP_INTEN_DOWN_Disabled     ( 0UL )                          /*!< Disable */
#define COMP_INTEN_DOWN_Enabled      ( 1UL )                          /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event READY */
#define COMP_INTEN_READY_Pos         ( 0UL )                           /*!< Position of READY field. */
#define COMP_INTEN_READY_Msk         ( 0x1UL << COMP_INTEN_READY_Pos ) /*!< Bit mask of READY field. */
#define COMP_INTEN_READY_Disabled    ( 0UL )                           /*!< Disable */
#define COMP_INTEN_READY_Enabled     ( 1UL )                           /*!< Enable */

/* Register: COMP_INTENSET */
/* Description: Enable interrupt */

/* Bit 3 : Write '1' to enable interrupt for event CROSS */
#define COMP_INTENSET_CROSS_Pos         ( 3UL )                              /*!< Position of CROSS field. */
#define COMP_INTENSET_CROSS_Msk         ( 0x1UL << COMP_INTENSET_CROSS_Pos ) /*!< Bit mask of CROSS field. */
#define COMP_INTENSET_CROSS_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define COMP_INTENSET_CROSS_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define COMP_INTENSET_CROSS_Set         ( 1UL )                              /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event UP */
#define COMP_INTENSET_UP_Pos            ( 2UL )                           /*!< Position of UP field. */
#define COMP_INTENSET_UP_Msk            ( 0x1UL << COMP_INTENSET_UP_Pos ) /*!< Bit mask of UP field. */
#define COMP_INTENSET_UP_Disabled       ( 0UL )                           /*!< Read: Disabled */
#define COMP_INTENSET_UP_Enabled        ( 1UL )                           /*!< Read: Enabled */
#define COMP_INTENSET_UP_Set            ( 1UL )                           /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event DOWN */
#define COMP_INTENSET_DOWN_Pos          ( 1UL )                             /*!< Position of DOWN field. */
#define COMP_INTENSET_DOWN_Msk          ( 0x1UL << COMP_INTENSET_DOWN_Pos ) /*!< Bit mask of DOWN field. */
#define COMP_INTENSET_DOWN_Disabled     ( 0UL )                             /*!< Read: Disabled */
#define COMP_INTENSET_DOWN_Enabled      ( 1UL )                             /*!< Read: Enabled */
#define COMP_INTENSET_DOWN_Set          ( 1UL )                             /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event READY */
#define COMP_INTENSET_READY_Pos         ( 0UL )                              /*!< Position of READY field. */
#define COMP_INTENSET_READY_Msk         ( 0x1UL << COMP_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define COMP_INTENSET_READY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define COMP_INTENSET_READY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define COMP_INTENSET_READY_Set         ( 1UL )                              /*!< Enable */

/* Register: COMP_INTENCLR */
/* Description: Disable interrupt */

/* Bit 3 : Write '1' to disable interrupt for event CROSS */
#define COMP_INTENCLR_CROSS_Pos         ( 3UL )                              /*!< Position of CROSS field. */
#define COMP_INTENCLR_CROSS_Msk         ( 0x1UL << COMP_INTENCLR_CROSS_Pos ) /*!< Bit mask of CROSS field. */
#define COMP_INTENCLR_CROSS_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define COMP_INTENCLR_CROSS_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define COMP_INTENCLR_CROSS_Clear       ( 1UL )                              /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event UP */
#define COMP_INTENCLR_UP_Pos            ( 2UL )                           /*!< Position of UP field. */
#define COMP_INTENCLR_UP_Msk            ( 0x1UL << COMP_INTENCLR_UP_Pos ) /*!< Bit mask of UP field. */
#define COMP_INTENCLR_UP_Disabled       ( 0UL )                           /*!< Read: Disabled */
#define COMP_INTENCLR_UP_Enabled        ( 1UL )                           /*!< Read: Enabled */
#define COMP_INTENCLR_UP_Clear          ( 1UL )                           /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event DOWN */
#define COMP_INTENCLR_DOWN_Pos          ( 1UL )                             /*!< Position of DOWN field. */
#define COMP_INTENCLR_DOWN_Msk          ( 0x1UL << COMP_INTENCLR_DOWN_Pos ) /*!< Bit mask of DOWN field. */
#define COMP_INTENCLR_DOWN_Disabled     ( 0UL )                             /*!< Read: Disabled */
#define COMP_INTENCLR_DOWN_Enabled      ( 1UL )                             /*!< Read: Enabled */
#define COMP_INTENCLR_DOWN_Clear        ( 1UL )                             /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event READY */
#define COMP_INTENCLR_READY_Pos         ( 0UL )                              /*!< Position of READY field. */
#define COMP_INTENCLR_READY_Msk         ( 0x1UL << COMP_INTENCLR_READY_Pos ) /*!< Bit mask of READY field. */
#define COMP_INTENCLR_READY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define COMP_INTENCLR_READY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define COMP_INTENCLR_READY_Clear       ( 1UL )                              /*!< Disable */

/* Register: COMP_RESULT */
/* Description: Compare result */

/* Bit 0 : Result of last compare. Decision point SAMPLE task. */
#define COMP_RESULT_RESULT_Pos      ( 0UL )                             /*!< Position of RESULT field. */
#define COMP_RESULT_RESULT_Msk      ( 0x1UL << COMP_RESULT_RESULT_Pos ) /*!< Bit mask of RESULT field. */
#define COMP_RESULT_RESULT_Below    ( 0UL )                             /*!< Input voltage is below the threshold (VIN+ &lt; VIN-) */
#define COMP_RESULT_RESULT_Above    ( 1UL )                             /*!< Input voltage is above the threshold (VIN+ &gt; VIN-) */

/* Register: COMP_ENABLE */
/* Description: COMP enable */

/* Bits 1..0 : Enable or disable COMP */
#define COMP_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define COMP_ENABLE_ENABLE_Msk         ( 0x3UL << COMP_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define COMP_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable */
#define COMP_ENABLE_ENABLE_Enabled     ( 2UL )                             /*!< Enable */

