FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: COMP_PSEL */
/* Description: Pin select */

/* Bits 2..0 : Analog pin select */
#define COMP_PSEL_PSEL_Pos             ( 0UL )                         /*!< Position of PSEL field. */
#define COMP_PSEL_PSEL_Msk             ( 0x7UL << COMP_PSEL_PSEL_Pos ) /*!< Bit mask of PSEL field. */
#define COMP_PSEL_PSEL_AnalogInput0    ( 0UL )                         /*!< AIN0 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput1    ( 1UL )                         /*!< AIN1 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput2    ( 2UL )                         /*!< AIN2 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput3    ( 3UL )                         /*!< AIN3 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput4    ( 4UL )                         /*!< AIN4 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput5    ( 5UL )                         /*!< AIN5 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput6    ( 6UL )                         /*!< AIN6 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput7    ( 7UL )                         /*!< AIN7 selected as analog input */

/* Register: COMP_REFSEL */
/* Description: Reference source select for single-ended mode */

/* Bits 2..0 : Reference select */
#define COMP_REFSEL_REFSEL_Pos       ( 0UL )                             /*!< Position of REFSEL field. */
#define COMP_REFSEL_REFSEL_Msk       ( 0x7UL << COMP_REFSEL_REFSEL_Pos ) /*!< Bit mask of REFSEL field. */
#define COMP_REFSEL_REFSEL_Int1V2    ( 0UL )                             /*!< VREF = internal 1.2 V reference (VDD &gt;= 1.7 V) */
#define COMP_REFSEL_REFSEL_Int1V8    ( 1UL )                             /*!< VREF = internal 1.8 V reference (VDD &gt;= VREF + 0.2 V) */
#define COMP_REFSEL_REFSEL_Int2V4    ( 2UL )                             /*!< VREF = internal 2.4 V reference (VDD &gt;= VREF + 0.2 V) */
#define COMP_REFSEL_REFSEL_VDD       ( 4UL )                             /*!< VREF = VDD */
#define COMP_REFSEL_REFSEL_ARef      ( 5UL )                             /*!< VREF = AREF */

/* Register: COMP_EXTREFSEL */
/* Description: External reference select */

/* Bits 2..0 : External analog reference select */
#define COMP_EXTREFSEL_EXTREFSEL_Pos                 ( 0UL )                                   /*!< Position of EXTREFSEL field. */
#define COMP_EXTREFSEL_EXTREFSEL_Msk                 ( 0x7UL << COMP_EXTREFSEL_EXTREFSEL_Pos ) /*!< Bit mask of EXTREFSEL field. */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference0    ( 0UL )                                   /*!< Use AIN0 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference1    ( 1UL )                                   /*!< Use AIN1 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference2    ( 2UL )                                   /*!< Use AIN2 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference3    ( 3UL )                                   /*!< Use AIN3 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference4    ( 4UL )                                   /*!< Use AIN4 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference5    ( 5UL )                                   /*!< Use AIN5 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference6    ( 6UL )                                   /*!< Use AIN6 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference7    ( 7UL )                                   /*!< Use AIN7 as external analog reference */

/* Register: COMP_TH */
/* Description: Threshold configuration for hysteresis unit */

/* Bits 13..8 : VUP = (THUP+1)/64*VREF */
#define COMP_TH_THUP_Pos      ( 8UL )                        /*!< Position of THUP field. */
#define COMP_TH_THUP_Msk      ( 0x3FUL << COMP_TH_THUP_Pos ) /*!< Bit mask of THUP field. */

/* Bits 5..0 : VDOWN = (THDOWN+1)/64*VREF */
#define COMP_TH_THDOWN_Pos    ( 0UL )                          /*!< Position of THDOWN field. */
#define COMP_TH_THDOWN_Msk    ( 0x3FUL << COMP_TH_THDOWN_Pos ) /*!< Bit mask of THDOWN field. */

/* Register: COMP_MODE */
/* Description: Mode configuration */

/* Bit 8 : Main operation modes */
#define COMP_MODE_MAIN_Pos     ( 8UL )                         /*!< Position of MAIN field. */
#define COMP_MODE_MAIN_Msk     ( 0x1UL << COMP_MODE_MAIN_Pos ) /*!< Bit mask of MAIN field. */
#define COMP_MODE_MAIN_SE      ( 0UL )                         /*!< Single-ended mode */
#define COMP_MODE_MAIN_Diff    ( 1UL )                         /*!< Differential mode */

/* Bits 1..0 : Speed and power modes */
#define COMP_MODE_SP_Pos       ( 0UL )                       /*!< Position of SP field. */
#define COMP_MODE_SP_Msk       ( 0x3UL << COMP_MODE_SP_Pos ) /*!< Bit mask of SP field. */
#define COMP_MODE_SP_Low       ( 0UL )                       /*!< Low-power mode */
#define COMP_MODE_SP_Normal    ( 1UL )                       /*!< Normal mode */
#define COMP_MODE_SP_High      ( 2UL )                       /*!< High-speed mode */

/* Register: COMP_HYST */
/* Description: Comparator hysteresis enable */

/* Bit 0 : Comparator hysteresis */
#define COMP_HYST_HYST_Pos         ( 0UL )                         /*!< Position of HYST field. */
#define COMP_HYST_HYST_Msk         ( 0x1UL << COMP_HYST_HYST_Pos ) /*!< Bit mask of HYST field. */
#define COMP_HYST_HYST_NoHyst      ( 0UL )                         /*!< Comparator hysteresis disabled */
#define COMP_HYST_HYST_Hyst50mV    ( 1UL )                         /*!< Comparator hysteresis enabled */

/* Register: COMP_ISOURCE */
/* Description: Current source select on analog input */

/* Bits 1..0 : Comparator hysteresis */
#define COMP_ISOURCE_ISOURCE_Pos        ( 0UL )                               /*!< Position of ISOURCE field. */
#define COMP_ISOURCE_ISOURCE_Msk        ( 0x3UL << COMP_ISOURCE_ISOURCE_Pos ) /*!< Bit mask of ISOURCE field. */
#define COMP_ISOURCE_ISOURCE_Off        ( 0UL )                               /*!< Current source disabled */
#define COMP_ISOURCE_ISOURCE_Ien2mA5    ( 1UL )                               /*!< Current source enabled (+/- 2.5 uA) */
#define COMP_ISOURCE_ISOURCE_Ien5mA     ( 2UL )                               /*!< Current source enabled (+/- 5 uA) */
#define COMP_ISOURCE_ISOURCE_Ien10mA    ( 3UL )                               /*!< Current source enabled (+/- 10 uA) */


/* Peripheral: CRYPTOCELL */
/* Description: ARM TrustZone CryptoCell register interface */

