FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: CRYPTOCELL_ENABLE */
/* Description: Enable CRYPTOCELL subsystem. */

/* Bit 0 : Enable or disable the CRYPTOCELL subsystem. */
#define CRYPTOCELL_ENABLE_ENABLE_Pos         ( 0UL )                                   /*!< Position of ENABLE field. */
#define CRYPTOCELL_ENABLE_ENABLE_Msk         ( 0x1UL << CRYPTOCELL_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define CRYPTOCELL_ENABLE_ENABLE_Disabled    ( 0UL )                                   /*!< CRYPTOCELL subsystem disabled. */
#define CRYPTOCELL_ENABLE_ENABLE_Enabled     ( 1UL )                                   /*!< CRYPTOCELL subsystem enabled. */


/* Peripheral: CTI */
/* Description: Cross-Trigger Interface control. NOTE: this is not a separate peripheral, but describes CM33 functionality. */

/* Register: CTI_CTICONTROL */
/* Description: CTI Control register */

/* Bit 0 : Enables or disables the CTI. */
#define CTI_CTICONTROL_GLBEN_Pos         ( 0UL )                               /*!< Position of GLBEN field. */
#define CTI_CTICONTROL_GLBEN_Msk         ( 0x1UL << CTI_CTICONTROL_GLBEN_Pos ) /*!< Bit mask of GLBEN field. */
#define CTI_CTICONTROL_GLBEN_Disabled    ( 0UL )                               /*!< All cross-triggering mapping logic functionality is disabled. */
#define CTI_CTICONTROL_GLBEN_Enabled     ( 1UL )                               /*!< Cross-triggering mapping logic functionality is enabled. */

/* Register: CTI_CTIINTACK */
/* Description: CTI Interrupt Acknowledge register */

/* Bit 7 : ETM Event Input 3 */
#define CTI_CTIINTACK_ETMEVTIN3_Pos             ( 7UL )                                  /*!< Position of ETMEVTIN3 field. */
#define CTI_CTIINTACK_ETMEVTIN3_Msk             ( 0x1UL << CTI_CTIINTACK_ETMEVTIN3_Pos ) /*!< Bit mask of ETMEVTIN3 field. */
#define CTI_CTIINTACK_ETMEVTIN3_Acknowledge     ( 1UL )                                  /*!< Clears the ctitrigout. */

/* Bit 6 : ETM Event Input 2 */
#define CTI_CTIINTACK_ETMEVTIN2_Pos             ( 6UL )                                  /*!< Position of ETMEVTIN2 field. */
#define CTI_CTIINTACK_ETMEVTIN2_Msk             ( 0x1UL << CTI_CTIINTACK_ETMEVTIN2_Pos ) /*!< Bit mask of ETMEVTIN2 field. */
#define CTI_CTIINTACK_ETMEVTIN2_Acknowledge     ( 1UL )                                  /*!< Clears the ctitrigout. */

/* Bit 5 : ETM Event Input 1 */
#define CTI_CTIINTACK_ETMEVTIN1_Pos             ( 5UL )                                  /*!< Position of ETMEVTIN1 field. */
#define CTI_CTIINTACK_ETMEVTIN1_Msk             ( 0x1UL << CTI_CTIINTACK_ETMEVTIN1_Pos ) /*!< Bit mask of ETMEVTIN1 field. */
#define CTI_CTIINTACK_ETMEVTIN1_Acknowledge     ( 1UL )                                  /*!< Clears the ctitrigout. */

/* Bit 4 : ETM Event Input 0 */
#define CTI_CTIINTACK_ETMEVTIN0_Pos             ( 4UL )                                  /*!< Position of ETMEVTIN0 field. */
#define CTI_CTIINTACK_ETMEVTIN0_Msk             ( 0x1UL << CTI_CTIINTACK_ETMEVTIN0_Pos ) /*!< Bit mask of ETMEVTIN0 field. */
#define CTI_CTIINTACK_ETMEVTIN0_Acknowledge     ( 1UL )                                  /*!< Clears the ctitrigout. */

/* Bit 3 : N/A */
#define CTI_CTIINTACK_UNUSED1_Pos               ( 3UL )                                /*!< Position of UNUSED1 field. */
#define CTI_CTIINTACK_UNUSED1_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED1_Pos ) /*!< Bit mask of UNUSED1 field. */
#define CTI_CTIINTACK_UNUSED1_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 2 : N/A */
#define CTI_CTIINTACK_UNUSED0_Pos               ( 2UL )                                /*!< Position of UNUSED0 field. */
#define CTI_CTIINTACK_UNUSED0_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED0_Pos ) /*!< Bit mask of UNUSED0 field. */
#define CTI_CTIINTACK_UNUSED0_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 1 : Processor Restart */
#define CTI_CTIINTACK_CPURESTART_Pos            ( 1UL )                                   /*!< Position of CPURESTART field. */
#define CTI_CTIINTACK_CPURESTART_Msk            ( 0x1UL << CTI_CTIINTACK_CPURESTART_Pos ) /*!< Bit mask of CPURESTART field. */
#define CTI_CTIINTACK_CPURESTART_Acknowledge    ( 1UL )                                   /*!< Clears the ctitrigout. */

/* Bit 0 : Processor debug request */
#define CTI_CTIINTACK_DEBUGREQ_Pos              ( 0UL )                                 /*!< Position of DEBUGREQ field. */
#define CTI_CTIINTACK_DEBUGREQ_Msk              ( 0x1UL << CTI_CTIINTACK_DEBUGREQ_Pos ) /*!< Bit mask of DEBUGREQ field. */
#define CTI_CTIINTACK_DEBUGREQ_Acknowledge      ( 1UL )                                 /*!< Clears the ctitrigout. */

/* Register: CTI_CTIAPPSET */
/* Description: CTI Application Trigger Set register */

/* Bit 3 : Application trigger event for channel 3. */
#define CTI_CTIAPPSET_APPSET_3_Pos         ( 3UL )                                 /*!< Position of APPSET_3 field. */
#define CTI_CTIAPPSET_APPSET_3_Msk         ( 0x1UL << CTI_CTIAPPSET_APPSET_3_Pos ) /*!< Bit mask of APPSET_3 field. */
#define CTI_CTIAPPSET_APPSET_3_Inactive    ( 0UL )                                 /*!< Application trigger 3 is inactive. */
#define CTI_CTIAPPSET_APPSET_3_Active      ( 1UL )                                 /*!< Application trigger 3 is active. */
#define CTI_CTIAPPSET_APPSET_3_Activate    ( 1UL )                                 /*!< Generate channel event for channel 3. */

/* Bit 2 : Application trigger event for channel 2. */
#define CTI_CTIAPPSET_APPSET_2_Pos         ( 2UL )                                 /*!< Position of APPSET_2 field. */
#define CTI_CTIAPPSET_APPSET_2_Msk         ( 0x1UL << CTI_CTIAPPSET_APPSET_2_Pos ) /*!< Bit mask of APPSET_2 field. */
#define CTI_CTIAPPSET_APPSET_2_Inactive    ( 0UL )                                 /*!< Application trigger 2 is inactive. */
#define CTI_CTIAPPSET_APPSET_2_Active      ( 1UL )                                 /*!< Application trigger 2 is active. */
#define CTI_CTIAPPSET_APPSET_2_Activate    ( 1UL )                                 /*!< Generate channel event for channel 2. */

