FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Enables a cross trigger event to channel 1 when a ctitrigin input is activated. */
#define CTI_CTIINEN_TRIGINEN_1_Pos         ( 1UL )                                 /*!< Position of TRIGINEN_1 field. */
#define CTI_CTIINEN_TRIGINEN_1_Msk         ( 0x1UL << CTI_CTIINEN_TRIGINEN_1_Pos ) /*!< Bit mask of TRIGINEN_1 field. */
#define CTI_CTIINEN_TRIGINEN_1_Disabled    ( 0UL )                                 /*!< Input trigger n events are ignored by channel 1. */
#define CTI_CTIINEN_TRIGINEN_1_Enabled     ( 1UL )                                 /*!< When an event is received on input trigger n (ctitrigin[n]), generate an event on channel 1. */

/* Bit 0 : Enables a cross trigger event to channel 0 when a ctitrigin input is activated. */
#define CTI_CTIINEN_TRIGINEN_0_Pos         ( 0UL )                                 /*!< Position of TRIGINEN_0 field. */
#define CTI_CTIINEN_TRIGINEN_0_Msk         ( 0x1UL << CTI_CTIINEN_TRIGINEN_0_Pos ) /*!< Bit mask of TRIGINEN_0 field. */
#define CTI_CTIINEN_TRIGINEN_0_Disabled    ( 0UL )                                 /*!< Input trigger n events are ignored by channel 0. */
#define CTI_CTIINEN_TRIGINEN_0_Enabled     ( 1UL )                                 /*!< When an event is received on input trigger n (ctitrigin[n]), generate an event on channel 0. */

/* Register: CTI_CTIOUTEN */
/* Description: Description collection: CTI Trigger output */

/* Bit 3 : Enables a cross trigger event to ctitrigout when channel 3 is activated. */
#define CTI_CTIOUTEN_TRIGOUTEN_3_Pos         ( 3UL )                                   /*!< Position of TRIGOUTEN_3 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_3_Msk         ( 0x1UL << CTI_CTIOUTEN_TRIGOUTEN_3_Pos ) /*!< Bit mask of TRIGOUTEN_3 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_3_Disabled    ( 0UL )                                   /*!< Channel 3 is ignored by output trigger n. */
#define CTI_CTIOUTEN_TRIGOUTEN_3_Enabled     ( 1UL )                                   /*!< When an event occurs on channel 3, generate an event on output event n (ctitrigout[n]). */

/* Bit 2 : Enables a cross trigger event to ctitrigout when channel 2 is activated. */
#define CTI_CTIOUTEN_TRIGOUTEN_2_Pos         ( 2UL )                                   /*!< Position of TRIGOUTEN_2 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_2_Msk         ( 0x1UL << CTI_CTIOUTEN_TRIGOUTEN_2_Pos ) /*!< Bit mask of TRIGOUTEN_2 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_2_Disabled    ( 0UL )                                   /*!< Channel 2 is ignored by output trigger n. */
#define CTI_CTIOUTEN_TRIGOUTEN_2_Enabled     ( 1UL )                                   /*!< When an event occurs on channel 2, generate an event on output event n (ctitrigout[n]). */

/* Bit 1 : Enables a cross trigger event to ctitrigout when channel 1 is activated. */
#define CTI_CTIOUTEN_TRIGOUTEN_1_Pos         ( 1UL )                                   /*!< Position of TRIGOUTEN_1 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_1_Msk         ( 0x1UL << CTI_CTIOUTEN_TRIGOUTEN_1_Pos ) /*!< Bit mask of TRIGOUTEN_1 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_1_Disabled    ( 0UL )                                   /*!< Channel 1 is ignored by output trigger n. */
#define CTI_CTIOUTEN_TRIGOUTEN_1_Enabled     ( 1UL )                                   /*!< When an event occurs on channel 1, generate an event on output event n (ctitrigout[n]). */

/* Bit 0 : Enables a cross trigger event to ctitrigout when channel 0 is activated. */
#define CTI_CTIOUTEN_TRIGOUTEN_0_Pos         ( 0UL )                                   /*!< Position of TRIGOUTEN_0 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_0_Msk         ( 0x1UL << CTI_CTIOUTEN_TRIGOUTEN_0_Pos ) /*!< Bit mask of TRIGOUTEN_0 field. */
#define CTI_CTIOUTEN_TRIGOUTEN_0_Disabled    ( 0UL )                                   /*!< Channel 0 is ignored by output trigger n. */
#define CTI_CTIOUTEN_TRIGOUTEN_0_Enabled     ( 1UL )                                   /*!< When an event occurs on channel 0, generate an event on output event n (ctitrigout[n]). */

/* Register: CTI_CTITRIGINSTATUS */
/* Description: CTI Trigger In Status register */

/* Bit 7 : N/A */
#define CTI_CTITRIGINSTATUS_UNUSED1_Pos             ( 7UL )                                      /*!< Position of UNUSED1 field. */
#define CTI_CTITRIGINSTATUS_UNUSED1_Msk             ( 0x1UL << CTI_CTITRIGINSTATUS_UNUSED1_Pos ) /*!< Bit mask of UNUSED1 field. */
#define CTI_CTITRIGINSTATUS_UNUSED1_Inactive        ( 0UL )                                      /*!< Ctitrigin 7 is inactive. */
#define CTI_CTITRIGINSTATUS_UNUSED1_Active          ( 1UL )                                      /*!< Ctitrigin 7 is active. */

/* Bit 6 : N/A */
#define CTI_CTITRIGINSTATUS_UNUSED0_Pos             ( 6UL )                                      /*!< Position of UNUSED0 field. */
#define CTI_CTITRIGINSTATUS_UNUSED0_Msk             ( 0x1UL << CTI_CTITRIGINSTATUS_UNUSED0_Pos ) /*!< Bit mask of UNUSED0 field. */
#define CTI_CTITRIGINSTATUS_UNUSED0_Inactive        ( 0UL )                                      /*!< Ctitrigin 6 is inactive. */
#define CTI_CTITRIGINSTATUS_UNUSED0_Active          ( 1UL )                                      /*!< Ctitrigin 6 is active. */

/* Bit 5 : ETM Event Output 1 */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT1_Pos          ( 5UL )                                         /*!< Position of ETMEVTOUT1 field. */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT1_Msk          ( 0x1UL << CTI_CTITRIGINSTATUS_ETMEVTOUT1_Pos ) /*!< Bit mask of ETMEVTOUT1 field. */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT1_Inactive     ( 0UL )                                         /*!< Ctitrigin 5 is inactive. */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT1_Active       ( 1UL )                                         /*!< Ctitrigin 5 is active. */

/* Bit 4 : ETM Event Output 0 */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT0_Pos          ( 4UL )                                         /*!< Position of ETMEVTOUT0 field. */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT0_Msk          ( 0x1UL << CTI_CTITRIGINSTATUS_ETMEVTOUT0_Pos ) /*!< Bit mask of ETMEVTOUT0 field. */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT0_Inactive     ( 0UL )                                         /*!< Ctitrigin 4 is inactive. */
#define CTI_CTITRIGINSTATUS_ETMEVTOUT0_Active       ( 1UL )                                         /*!< Ctitrigin 4 is active. */

/* Bit 3 : DWT Comparator Output 2 */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Pos         ( 3UL )                                          /*!< Position of DWTCOMPOUT2 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Msk         ( 0x1UL << CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Pos ) /*!< Bit mask of DWTCOMPOUT2 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Inactive    ( 0UL )                                          /*!< Ctitrigin 3 is inactive. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Active      ( 1UL )                                          /*!< Ctitrigin 3 is active. */

