FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 2 : DWT Comparator Output 1 */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Pos         ( 2UL )                                          /*!< Position of DWTCOMPOUT1 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Msk         ( 0x1UL << CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Pos ) /*!< Bit mask of DWTCOMPOUT1 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Inactive    ( 0UL )                                          /*!< Ctitrigin 2 is inactive. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Active      ( 1UL )                                          /*!< Ctitrigin 2 is active. */

/* Bit 1 : DWT Comparator Output 0 */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Pos         ( 1UL )                                          /*!< Position of DWTCOMPOUT0 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Msk         ( 0x1UL << CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Pos ) /*!< Bit mask of DWTCOMPOUT0 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Inactive    ( 0UL )                                          /*!< Ctitrigin 1 is inactive. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Active      ( 1UL )                                          /*!< Ctitrigin 1 is active. */

/* Bit 0 : Processor Halted */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Pos           ( 0UL )                                        /*!< Position of CPUHALTED field. */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Msk           ( 0x1UL << CTI_CTITRIGINSTATUS_CPUHALTED_Pos ) /*!< Bit mask of CPUHALTED field. */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Inactive      ( 0UL )                                        /*!< Ctitrigin 0 is inactive. */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Active        ( 1UL )                                        /*!< Ctitrigin 0 is active. */

/* Register: CTI_CTITRIGOUTSTATUS */
/* Description: CTI Trigger Out Status register */

/* Bit 7 : ETM Event Input 3 */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN3_Pos          ( 7UL )                                         /*!< Position of ETMEVTIN3 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN3_Msk          ( 0x1UL << CTI_CTITRIGOUTSTATUS_ETMEVTIN3_Pos ) /*!< Bit mask of ETMEVTIN3 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN3_Inactive     ( 0UL )                                         /*!< Ctitrigout 7 is inactive. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN3_Active       ( 1UL )                                         /*!< Ctitrigout 7 is active. */

/* Bit 6 : ETM Event Input 2 */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN2_Pos          ( 6UL )                                         /*!< Position of ETMEVTIN2 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN2_Msk          ( 0x1UL << CTI_CTITRIGOUTSTATUS_ETMEVTIN2_Pos ) /*!< Bit mask of ETMEVTIN2 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN2_Inactive     ( 0UL )                                         /*!< Ctitrigout 6 is inactive. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN2_Active       ( 1UL )                                         /*!< Ctitrigout 6 is active. */

/* Bit 5 : ETM Event Input 1 */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN1_Pos          ( 5UL )                                         /*!< Position of ETMEVTIN1 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN1_Msk          ( 0x1UL << CTI_CTITRIGOUTSTATUS_ETMEVTIN1_Pos ) /*!< Bit mask of ETMEVTIN1 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN1_Inactive     ( 0UL )                                         /*!< Ctitrigout 5 is inactive. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN1_Active       ( 1UL )                                         /*!< Ctitrigout 5 is active. */

/* Bit 4 : ETM Event Input 0 */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN0_Pos          ( 4UL )                                         /*!< Position of ETMEVTIN0 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN0_Msk          ( 0x1UL << CTI_CTITRIGOUTSTATUS_ETMEVTIN0_Pos ) /*!< Bit mask of ETMEVTIN0 field. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN0_Inactive     ( 0UL )                                         /*!< Ctitrigout 4 is inactive. */
#define CTI_CTITRIGOUTSTATUS_ETMEVTIN0_Active       ( 1UL )                                         /*!< Ctitrigout 4 is active. */

/* Bit 3 : N/A */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Pos            ( 3UL )                                       /*!< Position of UNUSED1 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Msk            ( 0x1UL << CTI_CTITRIGOUTSTATUS_UNUSED1_Pos ) /*!< Bit mask of UNUSED1 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Inactive       ( 0UL )                                       /*!< Ctitrigout 3 is inactive. */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Active         ( 1UL )                                       /*!< Ctitrigout 3 is active. */

/* Bit 2 : N/A */
#define CTI_CTITRIGOUTSTATUS_UNUSED0_Pos            ( 2UL )                                       /*!< Position of UNUSED0 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED0_Msk            ( 0x1UL << CTI_CTITRIGOUTSTATUS_UNUSED0_Pos ) /*!< Bit mask of UNUSED0 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED0_Inactive       ( 0UL )                                       /*!< Ctitrigout 2 is inactive. */
#define CTI_CTITRIGOUTSTATUS_UNUSED0_Active         ( 1UL )                                       /*!< Ctitrigout 2 is active. */

/* Bit 1 : Processor Restart */
#define CTI_CTITRIGOUTSTATUS_CPURESTART_Pos         ( 1UL )                                          /*!< Position of CPURESTART field. */
#define CTI_CTITRIGOUTSTATUS_CPURESTART_Msk         ( 0x1UL << CTI_CTITRIGOUTSTATUS_CPURESTART_Pos ) /*!< Bit mask of CPURESTART field. */
#define CTI_CTITRIGOUTSTATUS_CPURESTART_Inactive    ( 0UL )                                          /*!< Ctitrigout 1 is inactive. */
#define CTI_CTITRIGOUTSTATUS_CPURESTART_Active      ( 1UL )                                          /*!< Ctitrigout 1 is active. */

/* Bit 0 : Processor debug request */
#define CTI_CTITRIGOUTSTATUS_DEBUGREQ_Pos           ( 0UL )                                        /*!< Position of DEBUGREQ field. */
#define CTI_CTITRIGOUTSTATUS_DEBUGREQ_Msk           ( 0x1UL << CTI_CTITRIGOUTSTATUS_DEBUGREQ_Pos ) /*!< Bit mask of DEBUGREQ field. */
#define CTI_CTITRIGOUTSTATUS_DEBUGREQ_Inactive      ( 0UL )                                        /*!< Ctitrigout 0 is inactive. */
#define CTI_CTITRIGOUTSTATUS_DEBUGREQ_Active        ( 1UL )                                        /*!< Ctitrigout 0 is active. */

/* Register: CTI_CTICHINSTATUS */
/* Description: CTI Channel In Status register */

/* Bit 3 : Shows the status of the ctitrigin 3 input. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_3_Pos         ( 3UL )                                            /*!< Position of CTICHINSTATUS_3 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_3_Msk         ( 0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS_3_Pos ) /*!< Bit mask of CTICHINSTATUS_3 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_3_Inactive    ( 0UL )                                            /*!< Ctichin 3 is inactive. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_3_Active      ( 1UL )                                            /*!< Ctichin 3 is active. */

