FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 2 : Shows the status of the ctitrigin 2 input. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_2_Pos         ( 2UL )                                            /*!< Position of CTICHINSTATUS_2 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_2_Msk         ( 0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS_2_Pos ) /*!< Bit mask of CTICHINSTATUS_2 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_2_Inactive    ( 0UL )                                            /*!< Ctichin 2 is inactive. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_2_Active      ( 1UL )                                            /*!< Ctichin 2 is active. */

/* Bit 1 : Shows the status of the ctitrigin 1 input. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_1_Pos         ( 1UL )                                            /*!< Position of CTICHINSTATUS_1 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_1_Msk         ( 0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS_1_Pos ) /*!< Bit mask of CTICHINSTATUS_1 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_1_Inactive    ( 0UL )                                            /*!< Ctichin 1 is inactive. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_1_Active      ( 1UL )                                            /*!< Ctichin 1 is active. */

/* Bit 0 : Shows the status of the ctitrigin 0 input. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_0_Pos         ( 0UL )                                            /*!< Position of CTICHINSTATUS_0 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_0_Msk         ( 0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS_0_Pos ) /*!< Bit mask of CTICHINSTATUS_0 field. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_0_Inactive    ( 0UL )                                            /*!< Ctichin 0 is inactive. */
#define CTI_CTICHINSTATUS_CTICHINSTATUS_0_Active      ( 1UL )                                            /*!< Ctichin 0 is active. */

/* Register: CTI_CTIGATE */
/* Description: Enable CTI Channel Gate register */

/* Bit 3 : Enable ctichout3. */
#define CTI_CTIGATE_CTIGATEEN_3_Pos         ( 3UL )                                  /*!< Position of CTIGATEEN_3 field. */
#define CTI_CTIGATE_CTIGATEEN_3_Msk         ( 0x1UL << CTI_CTIGATE_CTIGATEEN_3_Pos ) /*!< Bit mask of CTIGATEEN_3 field. */
#define CTI_CTIGATE_CTIGATEEN_3_Disabled    ( 0UL )                                  /*!< Disable ctichout channel 3 propagation. */
#define CTI_CTIGATE_CTIGATEEN_3_Enabled     ( 1UL )                                  /*!< Enable ctichout channel 3 propagation. */

/* Bit 2 : Enable ctichout2. */
#define CTI_CTIGATE_CTIGATEEN_2_Pos         ( 2UL )                                  /*!< Position of CTIGATEEN_2 field. */
#define CTI_CTIGATE_CTIGATEEN_2_Msk         ( 0x1UL << CTI_CTIGATE_CTIGATEEN_2_Pos ) /*!< Bit mask of CTIGATEEN_2 field. */
#define CTI_CTIGATE_CTIGATEEN_2_Disabled    ( 0UL )                                  /*!< Disable ctichout channel 2 propagation. */
#define CTI_CTIGATE_CTIGATEEN_2_Enabled     ( 1UL )                                  /*!< Enable ctichout channel 2 propagation. */

/* Bit 1 : Enable ctichout1. */
#define CTI_CTIGATE_CTIGATEEN_1_Pos         ( 1UL )                                  /*!< Position of CTIGATEEN_1 field. */
#define CTI_CTIGATE_CTIGATEEN_1_Msk         ( 0x1UL << CTI_CTIGATE_CTIGATEEN_1_Pos ) /*!< Bit mask of CTIGATEEN_1 field. */
#define CTI_CTIGATE_CTIGATEEN_1_Disabled    ( 0UL )                                  /*!< Disable ctichout channel 1 propagation. */
#define CTI_CTIGATE_CTIGATEEN_1_Enabled     ( 1UL )                                  /*!< Enable ctichout channel 1 propagation. */

/* Bit 0 : Enable ctichout0. */
#define CTI_CTIGATE_CTIGATEEN_0_Pos         ( 0UL )                                  /*!< Position of CTIGATEEN_0 field. */
#define CTI_CTIGATE_CTIGATEEN_0_Msk         ( 0x1UL << CTI_CTIGATE_CTIGATEEN_0_Pos ) /*!< Bit mask of CTIGATEEN_0 field. */
#define CTI_CTIGATE_CTIGATEEN_0_Disabled    ( 0UL )                                  /*!< Disable ctichout channel 0 propagation. */
#define CTI_CTIGATE_CTIGATEEN_0_Enabled     ( 1UL )                                  /*!< Enable ctichout channel 0 propagation. */

/* Register: CTI_DEVARCH */
/* Description: Device Architecture register */

/* Bit 0 : Contains the CTI device architecture. */
#define CTI_DEVARCH_Architecture_Pos    ( 0UL )                                   /*!< Position of Architecture field. */
#define CTI_DEVARCH_Architecture_Msk    ( 0x1UL << CTI_DEVARCH_Architecture_Pos ) /*!< Bit mask of Architecture field. */

/* Register: CTI_DEVID */
/* Description: Device Configuration register */

/* Bits 19..16 : Number of ECT channels available. */
#define CTI_DEVID_NUMCH_Pos        ( 16UL )                         /*!< Position of NUMCH field. */
#define CTI_DEVID_NUMCH_Msk        ( 0xFUL << CTI_DEVID_NUMCH_Pos ) /*!< Bit mask of NUMCH field. */

/* Bits 15..8 : Number of ECT triggers available. */
#define CTI_DEVID_NUMTRIG_Pos      ( 8UL )                             /*!< Position of NUMTRIG field. */
#define CTI_DEVID_NUMTRIG_Msk      ( 0xFFUL << CTI_DEVID_NUMTRIG_Pos ) /*!< Bit mask of NUMTRIG field. */

/* Bits 4..0 : Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using asicctl.
 *                  The default value of 0b00000 indicates that no multiplexing is present. */
#define CTI_DEVID_EXTMUXNUM_Pos    ( 0UL )                               /*!< Position of EXTMUXNUM field. */
#define CTI_DEVID_EXTMUXNUM_Msk    ( 0x1FUL << CTI_DEVID_EXTMUXNUM_Pos ) /*!< Bit mask of EXTMUXNUM field. */

/* Register: CTI_DEVTYPE */
/* Description: Device Type Identifier register */

/* Bits 7..4 : Sub-classification of the type of the debug component as specified in the Arm Architecture Specification within
 *                  the major classification as specified in the MAJOR field. */
#define CTI_DEVTYPE_SUB_Pos             ( 4UL )                          /*!< Position of SUB field. */
#define CTI_DEVTYPE_SUB_Msk             ( 0xFUL << CTI_DEVTYPE_SUB_Pos ) /*!< Bit mask of SUB field. */
#define CTI_DEVTYPE_SUB_Crosstrigger    ( 1UL )                          /*!< Indicates that this component is a sub-triggering component. */

/* Bits 3..0 : Major classification of the type of the debug component as specified in the Arm Architecture Specification for this
 *                  debug and trace component. */
#define CTI_DEVTYPE_MAJOR_Pos           ( 0UL )                            /*!< Position of MAJOR field. */
#define CTI_DEVTYPE_MAJOR_Msk           ( 0xFUL << CTI_DEVTYPE_MAJOR_Pos ) /*!< Bit mask of MAJOR field. */
#define CTI_DEVTYPE_MAJOR_Controller    ( 4UL )                            /*!< Indicates that this component allows a debugger to control other components in an Arm CoreSight SoC-400 system. */

/* Register: CTI_PIDR4 */
/* Description: Peripheral ID4 Register */

/* Bits 7..4 : Always 0b0000. Indicates that the device only occupies 4KB of memory. */
#define CTI_PIDR4_SIZE_Pos      ( 4UL )                         /*!< Position of SIZE field. */
#define CTI_PIDR4_SIZE_Msk      ( 0xFUL << CTI_PIDR4_SIZE_Pos ) /*!< Bit mask of SIZE field. */

/* Bits 3..0 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
#define CTI_PIDR4_DES_2_Pos     ( 0UL )                          /*!< Position of DES_2 field. */
#define CTI_PIDR4_DES_2_Msk     ( 0xFUL << CTI_PIDR4_DES_2_Pos ) /*!< Bit mask of DES_2 field. */
#define CTI_PIDR4_DES_2_Code    ( 4UL )                          /*!< JEDEC continuation code. */

