FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: CTI_PIDR0 */
/* Description: Peripheral ID0 Register */

/* Bits 7..0 : Bits[7:0] of the 12-bit part number of the component. The designer of the component assigns this part number. */
#define CTI_PIDR0_PART_0_Pos            ( 0UL )                            /*!< Position of PART_0 field. */
#define CTI_PIDR0_PART_0_Msk            ( 0xFFUL << CTI_PIDR0_PART_0_Pos ) /*!< Bit mask of PART_0 field. */
#define CTI_PIDR0_PART_0_PartnumberL    ( 0x21UL )                         /*!< Indicates bits[7:0] of the part number of the component. */

/* Register: CTI_PIDR1 */
/* Description: Peripheral ID1 Register */

/* Bits 7..4 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
#define CTI_PIDR1_DES_0_Pos             ( 4UL )                          /*!< Position of DES_0 field. */
#define CTI_PIDR1_DES_0_Msk             ( 0xFUL << CTI_PIDR1_DES_0_Pos ) /*!< Bit mask of DES_0 field. */
#define CTI_PIDR1_DES_0_Arm             ( 11UL )                         /*!< Arm. Bits[3:0] of the JEDEC JEP106 Identity Code */

/* Bits 3..0 : Bits[11:8] of the 12-bit part number of the component. The designer of the component assigns this part number. */
#define CTI_PIDR1_PART_1_Pos            ( 0UL )                           /*!< Position of PART_1 field. */
#define CTI_PIDR1_PART_1_Msk            ( 0xFUL << CTI_PIDR1_PART_1_Pos ) /*!< Bit mask of PART_1 field. */
#define CTI_PIDR1_PART_1_PartnumberH    ( 13UL )                          /*!< Indicates bits[11:8] of the part number of the component. */

/* Register: CTI_PIDR2 */
/* Description: Peripheral ID2 Register */

/* Bits 7..4 : Peripheral revision */
#define CTI_PIDR2_REVISION_Pos       ( 4UL )                             /*!< Position of REVISION field. */
#define CTI_PIDR2_REVISION_Msk       ( 0xFUL << CTI_PIDR2_REVISION_Pos ) /*!< Bit mask of REVISION field. */
#define CTI_PIDR2_REVISION_Rev0p0    ( 0UL )                             /*!< This device is at r0p0 */

/* Bit 3 : Always 1. Indicates that the JEDEC-assigned designer ID is used. */
#define CTI_PIDR2_JEDEC_Pos          ( 3UL )                          /*!< Position of JEDEC field. */
#define CTI_PIDR2_JEDEC_Msk          ( 0x1UL << CTI_PIDR2_JEDEC_Pos ) /*!< Bit mask of JEDEC field. */

/* Bits 2..0 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
#define CTI_PIDR2_DES_1_Pos          ( 0UL )                          /*!< Position of DES_1 field. */
#define CTI_PIDR2_DES_1_Msk          ( 0x7UL << CTI_PIDR2_DES_1_Pos ) /*!< Bit mask of DES_1 field. */
#define CTI_PIDR2_DES_1_Arm          ( 3UL )                          /*!< Arm. Bits[6:4] of the JEDEC JEP106 Identity Code */

/* Register: CTI_PIDR3 */
/* Description: Peripheral ID3 Register */

/* Bits 7..4 : Indicates minor errata fixes specific to the revision of the component being used, for example metal fixes after
 *                  implementation. In most cases, this field is 0b0000. Arm recommends that the component designers ensure that a
 *                  metal fix can change this field if required, for example, by driving it from registers that reset to 0b0000. */
#define CTI_PIDR3_REVAND_Pos         ( 4UL )                           /*!< Position of REVAND field. */
#define CTI_PIDR3_REVAND_Msk         ( 0xFUL << CTI_PIDR3_REVAND_Pos ) /*!< Bit mask of REVAND field. */
#define CTI_PIDR3_REVAND_NoErrata    ( 0UL )                           /*!< Indicates that there are no errata fixes to this component. */

/* Bits 3..0 : Customer Modified. Indicates whether the customer has modified the behavior of the component. In most cases,
 *                  this field is 0b0000. Customers change this value when they make authorized modifications to this component. */
#define CTI_PIDR3_CMOD_Pos           ( 0UL )                         /*!< Position of CMOD field. */
#define CTI_PIDR3_CMOD_Msk           ( 0xFUL << CTI_PIDR3_CMOD_Pos ) /*!< Bit mask of CMOD field. */
#define CTI_PIDR3_CMOD_Unmodified    ( 0UL )                         /*!< Indicates that the customer has not modified this component. */

/* Register: CTI_CIDR0 */
/* Description: Component ID0 Register */

/* Bits 7..0 : Preamble[0]. Contains bits[7:0] of the component identification code. */
#define CTI_CIDR0_PRMBL_0_Pos      ( 0UL )                             /*!< Position of PRMBL_0 field. */
#define CTI_CIDR0_PRMBL_0_Msk      ( 0xFFUL << CTI_CIDR0_PRMBL_0_Pos ) /*!< Bit mask of PRMBL_0 field. */
#define CTI_CIDR0_PRMBL_0_Value    ( 0x0DUL )                          /*!< Bits[7:0] of the identification code. */

/* Register: CTI_CIDR1 */
/* Description: Component ID1 Register */

/* Bits 7..4 : Class of the component, for example, whether the component is a ROM table or a generic CoreSight component.
 *                  Contains bits[15:12] of the component identification code */
#define CTI_CIDR1_CLASS_Pos          ( 4UL )                          /*!< Position of CLASS field. */
#define CTI_CIDR1_CLASS_Msk          ( 0xFUL << CTI_CIDR1_CLASS_Pos ) /*!< Bit mask of CLASS field. */
#define CTI_CIDR1_CLASS_Coresight    ( 9UL )                          /*!< Indicates that the component is a CoreSight component. */

/* Bits 3..0 : Preamble[1]. Contains bits[11:8] of the component identification code. */
#define CTI_CIDR1_PRMBL_1_Pos        ( 0UL )                            /*!< Position of PRMBL_1 field. */
#define CTI_CIDR1_PRMBL_1_Msk        ( 0xFUL << CTI_CIDR1_PRMBL_1_Pos ) /*!< Bit mask of PRMBL_1 field. */
#define CTI_CIDR1_PRMBL_1_Value      ( 0UL )                            /*!< Bits[11:8] of the identification code. */

/* Register: CTI_CIDR2 */
/* Description: Component ID2 Register */

/* Bits 7..0 : Preamble[2]. Contains bits[23:16] of the component identification code. */
#define CTI_CIDR2_PRMBL_2_Pos      ( 0UL )                             /*!< Position of PRMBL_2 field. */
#define CTI_CIDR2_PRMBL_2_Msk      ( 0xFFUL << CTI_CIDR2_PRMBL_2_Pos ) /*!< Bit mask of PRMBL_2 field. */
#define CTI_CIDR2_PRMBL_2_Value    ( 0x05UL )                          /*!< Bits[23:16] of the identification code. */

/* Register: CTI_CIDR3 */
/* Description: Component ID3 Register */

/* Bits 7..0 : Preamble[3]. Contains bits[31:24] of the component identification code. */
#define CTI_CIDR3_PRMBL_3_Pos      ( 0UL )                             /*!< Position of PRMBL_3 field. */
#define CTI_CIDR3_PRMBL_3_Msk      ( 0xFFUL << CTI_CIDR3_PRMBL_3_Pos ) /*!< Bit mask of PRMBL_3 field. */
#define CTI_CIDR3_PRMBL_3_Value    ( 0xB1UL )                          /*!< Bits[31:24] of the identification code. */


