FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 31..0 : If the value of the KEY field is non-zero, and the KEY fields match on both the
 *      CPU and debugger sides, disable SECUREAPPROTECT and enable debug access to secure mode until
 *      the next pin reset, brown-out reset, power-on reset, or watchog timer reset. After reset the debugger side register has a fixed KEY value. To enable debug access, both CTRL-AP and UICR.SECUREAPPROTECT protection needs to be disabled. */
#define CTRLAPPERI_SECUREAPPROTECT_DISABLE_KEY_Pos    ( 0UL )                                                        /*!< Position of KEY field. */
#define CTRLAPPERI_SECUREAPPROTECT_DISABLE_KEY_Msk    ( 0xFFFFFFFFUL << CTRLAPPERI_SECUREAPPROTECT_DISABLE_KEY_Pos ) /*!< Bit mask of KEY field. */

/* Register: CTRLAPPERI_STATUS */
/* Description: Status bits for CTRL-AP peripheral. */

/* Bit 2 : Status bit for device debug interface mode */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Pos                ( 2UL )                                         /*!< Position of DBGIFACEMODE field. */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Msk                ( 0x1UL << CTRLAPPERI_STATUS_DBGIFACEMODE_Pos ) /*!< Bit mask of DBGIFACEMODE field. */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Disabled           ( 0UL )                                         /*!< No debugger attached */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Enabled            ( 1UL )                                         /*!< Debugger is attached and device is in debug interface mode */

/* Bit 1 : Status bit for UICR part of secure access port protection at last reset. */
#define CTRLAPPERI_STATUS_UICRSECUREAPPROTECT_Pos         ( 1UL )                                                /*!< Position of UICRSECUREAPPROTECT field. */
#define CTRLAPPERI_STATUS_UICRSECUREAPPROTECT_Msk         ( 0x1UL << CTRLAPPERI_STATUS_UICRSECUREAPPROTECT_Pos ) /*!< Bit mask of UICRSECUREAPPROTECT field. */
#define CTRLAPPERI_STATUS_UICRSECUREAPPROTECT_Enabled     ( 0UL )                                                /*!< SECUREAPPROTECT was enabled in UICR */
#define CTRLAPPERI_STATUS_UICRSECUREAPPROTECT_Disabled    ( 1UL )                                                /*!< SECUREAPPROTECT was disabled in UICR */

/* Bit 0 : Status bit for UICR part of access port protection at last reset. */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Pos               ( 0UL )                                          /*!< Position of UICRAPPROTECT field. */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Msk               ( 0x1UL << CTRLAPPERI_STATUS_UICRAPPROTECT_Pos ) /*!< Bit mask of UICRAPPROTECT field. */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Enabled           ( 0UL )                                          /*!< APPROTECT was enabled in UICR */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Disabled          ( 1UL )                                          /*!< APPROTECT wasdisabled in UICR */


/* Peripheral: DCNF */
/* Description: Domain configuration management 0 */

/* Register: DCNF_CPUID */
/* Description: CPU ID of this subsystem */

/* Bits 7..0 : CPU ID */
#define DCNF_CPUID_CPUID_Pos    ( 0UL )                            /*!< Position of CPUID field. */
#define DCNF_CPUID_CPUID_Msk    ( 0xFFUL << DCNF_CPUID_CPUID_Pos ) /*!< Bit mask of CPUID field. */

/* Register: DCNF_EXTPERI_PROTECT */
/* Description: Description cluster: Control access for master connected to AMLI master port EXTPERI[n] */

/* Bit 0 : Control access to slave 0 of master EXTPERI[n] */
#define DCNF_EXTPERI_PROTECT_SLAVE0_Pos        ( 0UL )                                      /*!< Position of SLAVE0 field. */
#define DCNF_EXTPERI_PROTECT_SLAVE0_Msk        ( 0x1UL << DCNF_EXTPERI_PROTECT_SLAVE0_Pos ) /*!< Bit mask of SLAVE0 field. */
#define DCNF_EXTPERI_PROTECT_SLAVE0_Allowed    ( 0UL )                                      /*!< Access to slave is allowed */
#define DCNF_EXTPERI_PROTECT_SLAVE0_Blocked    ( 1UL )                                      /*!< Access to slave is blocked */

/* Register: DCNF_EXTRAM_PROTECT */
/* Description: Description cluster: Control access from master connected to AMLI master port EXTRAM[n] */

/* Bit 7 : Control access to slave 7 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE7_Pos        ( 7UL )                                     /*!< Position of SLAVE7 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE7_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE7_Pos ) /*!< Bit mask of SLAVE7 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE7_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE7_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

/* Bit 6 : Control access to slave 6 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE6_Pos        ( 6UL )                                     /*!< Position of SLAVE6 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE6_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE6_Pos ) /*!< Bit mask of SLAVE6 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE6_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE6_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

/* Bit 5 : Control access to slave 5 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE5_Pos        ( 5UL )                                     /*!< Position of SLAVE5 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE5_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE5_Pos ) /*!< Bit mask of SLAVE5 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE5_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE5_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

/* Bit 4 : Control access to slave 4 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE4_Pos        ( 4UL )                                     /*!< Position of SLAVE4 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE4_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE4_Pos ) /*!< Bit mask of SLAVE4 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE4_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE4_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

/* Bit 3 : Control access to slave 3 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE3_Pos        ( 3UL )                                     /*!< Position of SLAVE3 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE3_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE3_Pos ) /*!< Bit mask of SLAVE3 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE3_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE3_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

