FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 2 : Control access to slave 2 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE2_Pos        ( 2UL )                                     /*!< Position of SLAVE2 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE2_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE2_Pos ) /*!< Bit mask of SLAVE2 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE2_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE2_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

/* Bit 1 : Control access to slave 1 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Pos        ( 1UL )                                     /*!< Position of SLAVE1 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE1_Pos ) /*!< Bit mask of SLAVE1 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

/* Bit 0 : Control access to slave 0 of master EXTRAM[n] */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Pos        ( 0UL )                                     /*!< Position of SLAVE0 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Msk        ( 0x1UL << DCNF_EXTRAM_PROTECT_SLAVE0_Pos ) /*!< Bit mask of SLAVE0 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Allowed    ( 0UL )                                     /*!< Access to slave is allowed */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Blocked    ( 1UL )                                     /*!< Access to slave is blocked */

/* Register: DCNF_EXTCODE_PROTECT */
/* Description: Description cluster: Control access from master connected to AMLI master port EXTCODE[n] */

/* Bit 0 : Control access to slave 0 of master EXTCODE[n] */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Pos        ( 0UL )                                      /*!< Position of SLAVE0 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Msk        ( 0x1UL << DCNF_EXTCODE_PROTECT_SLAVE0_Pos ) /*!< Bit mask of SLAVE0 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Allowed    ( 0UL )                                      /*!< Access to slave is allowed */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Blocked    ( 1UL )                                      /*!< Access to slave is blocked */


/* Peripheral: DPPIC */
/* Description: Distributed programmable peripheral interconnect controller 0 */

/* Register: DPPIC_TASKS_CHG_EN */
/* Description: Description cluster: Enable channel group n */

/* Bit 0 : Enable channel group n */
#define DPPIC_TASKS_CHG_EN_EN_Pos        ( 0UL )                                /*!< Position of EN field. */
#define DPPIC_TASKS_CHG_EN_EN_Msk        ( 0x1UL << DPPIC_TASKS_CHG_EN_EN_Pos ) /*!< Bit mask of EN field. */
#define DPPIC_TASKS_CHG_EN_EN_Trigger    ( 1UL )                                /*!< Trigger task */

/* Register: DPPIC_TASKS_CHG_DIS */
/* Description: Description cluster: Disable channel group n */

/* Bit 0 : Disable channel group n */
#define DPPIC_TASKS_CHG_DIS_DIS_Pos        ( 0UL )                                  /*!< Position of DIS field. */
#define DPPIC_TASKS_CHG_DIS_DIS_Msk        ( 0x1UL << DPPIC_TASKS_CHG_DIS_DIS_Pos ) /*!< Bit mask of DIS field. */
#define DPPIC_TASKS_CHG_DIS_DIS_Trigger    ( 1UL )                                  /*!< Trigger task */

/* Register: DPPIC_SUBSCRIBE_CHG_EN */
/* Description: Description cluster: Subscribe configuration for task CHG[n].EN */

/* Bit 31 :   */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Msk         ( 0x1UL << DPPIC_SUBSCRIBE_CHG_EN_EN_Pos ) /*!< Bit mask of EN field. */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CHG[n].EN will subscribe to */
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Msk      ( 0xFFUL << DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: DPPIC_SUBSCRIBE_CHG_DIS */
/* Description: Description cluster: Subscribe configuration for task CHG[n].DIS */

/* Bit 31 :   */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Msk         ( 0x1UL << DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos ) /*!< Bit mask of EN field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CHG[n].DIS will subscribe to */
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Msk      ( 0xFFUL << DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: DPPIC_CHEN */
/* Description: Channel enable register */

/* Bit 31 : Enable or disable channel 31 */
#define DPPIC_CHEN_CH31_Pos         ( 31UL )                         /*!< Position of CH31 field. */
#define DPPIC_CHEN_CH31_Msk         ( 0x1UL << DPPIC_CHEN_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define DPPIC_CHEN_CH31_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH31_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 30 : Enable or disable channel 30 */
#define DPPIC_CHEN_CH30_Pos         ( 30UL )                         /*!< Position of CH30 field. */
#define DPPIC_CHEN_CH30_Msk         ( 0x1UL << DPPIC_CHEN_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define DPPIC_CHEN_CH30_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH30_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 29 : Enable or disable channel 29 */
#define DPPIC_CHEN_CH29_Pos         ( 29UL )                         /*!< Position of CH29 field. */
#define DPPIC_CHEN_CH29_Msk         ( 0x1UL << DPPIC_CHEN_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define DPPIC_CHEN_CH29_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH29_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 28 : Enable or disable channel 28 */
#define DPPIC_CHEN_CH28_Pos         ( 28UL )                         /*!< Position of CH28 field. */
#define DPPIC_CHEN_CH28_Msk         ( 0x1UL << DPPIC_CHEN_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define DPPIC_CHEN_CH28_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH28_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 27 : Enable or disable channel 27 */
#define DPPIC_CHEN_CH27_Pos         ( 27UL )                         /*!< Position of CH27 field. */
#define DPPIC_CHEN_CH27_Msk         ( 0x1UL << DPPIC_CHEN_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define DPPIC_CHEN_CH27_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH27_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 26 : Enable or disable channel 26 */
#define DPPIC_CHEN_CH26_Pos         ( 26UL )                         /*!< Position of CH26 field. */
#define DPPIC_CHEN_CH26_Msk         ( 0x1UL << DPPIC_CHEN_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define DPPIC_CHEN_CH26_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH26_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 25 : Enable or disable channel 25 */
#define DPPIC_CHEN_CH25_Pos         ( 25UL )                         /*!< Position of CH25 field. */
#define DPPIC_CHEN_CH25_Msk         ( 0x1UL << DPPIC_CHEN_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define DPPIC_CHEN_CH25_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH25_Enabled     ( 1UL )                          /*!< Enable channel */

