FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 24 : Channel 24 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH24_Pos         ( 24UL )                            /*!< Position of CH24 field. */
#define DPPIC_CHENSET_CH24_Msk         ( 0x1UL << DPPIC_CHENSET_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define DPPIC_CHENSET_CH24_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH24_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH24_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 23 : Channel 23 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH23_Pos         ( 23UL )                            /*!< Position of CH23 field. */
#define DPPIC_CHENSET_CH23_Msk         ( 0x1UL << DPPIC_CHENSET_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define DPPIC_CHENSET_CH23_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH23_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH23_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 22 : Channel 22 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH22_Pos         ( 22UL )                            /*!< Position of CH22 field. */
#define DPPIC_CHENSET_CH22_Msk         ( 0x1UL << DPPIC_CHENSET_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define DPPIC_CHENSET_CH22_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH22_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH22_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 21 : Channel 21 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH21_Pos         ( 21UL )                            /*!< Position of CH21 field. */
#define DPPIC_CHENSET_CH21_Msk         ( 0x1UL << DPPIC_CHENSET_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define DPPIC_CHENSET_CH21_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH21_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH21_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 20 : Channel 20 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH20_Pos         ( 20UL )                            /*!< Position of CH20 field. */
#define DPPIC_CHENSET_CH20_Msk         ( 0x1UL << DPPIC_CHENSET_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define DPPIC_CHENSET_CH20_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH20_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH20_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 19 : Channel 19 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH19_Pos         ( 19UL )                            /*!< Position of CH19 field. */
#define DPPIC_CHENSET_CH19_Msk         ( 0x1UL << DPPIC_CHENSET_CH19_Pos ) /*!< Bit mask of CH19 field. */
#define DPPIC_CHENSET_CH19_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH19_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH19_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 18 : Channel 18 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH18_Pos         ( 18UL )                            /*!< Position of CH18 field. */
#define DPPIC_CHENSET_CH18_Msk         ( 0x1UL << DPPIC_CHENSET_CH18_Pos ) /*!< Bit mask of CH18 field. */
#define DPPIC_CHENSET_CH18_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH18_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH18_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 17 : Channel 17 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH17_Pos         ( 17UL )                            /*!< Position of CH17 field. */
#define DPPIC_CHENSET_CH17_Msk         ( 0x1UL << DPPIC_CHENSET_CH17_Pos ) /*!< Bit mask of CH17 field. */
#define DPPIC_CHENSET_CH17_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH17_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH17_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 16 : Channel 16 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH16_Pos         ( 16UL )                            /*!< Position of CH16 field. */
#define DPPIC_CHENSET_CH16_Msk         ( 0x1UL << DPPIC_CHENSET_CH16_Pos ) /*!< Bit mask of CH16 field. */
#define DPPIC_CHENSET_CH16_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH16_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH16_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 15 : Channel 15 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH15_Pos         ( 15UL )                            /*!< Position of CH15 field. */
#define DPPIC_CHENSET_CH15_Msk         ( 0x1UL << DPPIC_CHENSET_CH15_Pos ) /*!< Bit mask of CH15 field. */
#define DPPIC_CHENSET_CH15_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH15_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH15_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 14 : Channel 14 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH14_Pos         ( 14UL )                            /*!< Position of CH14 field. */
#define DPPIC_CHENSET_CH14_Msk         ( 0x1UL << DPPIC_CHENSET_CH14_Pos ) /*!< Bit mask of CH14 field. */
#define DPPIC_CHENSET_CH14_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH14_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH14_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 13 : Channel 13 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH13_Pos         ( 13UL )                            /*!< Position of CH13 field. */
#define DPPIC_CHENSET_CH13_Msk         ( 0x1UL << DPPIC_CHENSET_CH13_Pos ) /*!< Bit mask of CH13 field. */
#define DPPIC_CHENSET_CH13_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH13_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH13_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 12 : Channel 12 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH12_Pos         ( 12UL )                            /*!< Position of CH12 field. */
#define DPPIC_CHENSET_CH12_Msk         ( 0x1UL << DPPIC_CHENSET_CH12_Pos ) /*!< Bit mask of CH12 field. */
#define DPPIC_CHENSET_CH12_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH12_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH12_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 11 : Channel 11 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH11_Pos         ( 11UL )                            /*!< Position of CH11 field. */
#define DPPIC_CHENSET_CH11_Msk         ( 0x1UL << DPPIC_CHENSET_CH11_Pos ) /*!< Bit mask of CH11 field. */
#define DPPIC_CHENSET_CH11_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH11_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH11_Set         ( 1UL )                             /*!< Write: Enable channel */

