FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 17 : Channel 17 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH17_Pos         ( 17UL )                            /*!< Position of CH17 field. */
#define DPPIC_CHENCLR_CH17_Msk         ( 0x1UL << DPPIC_CHENCLR_CH17_Pos ) /*!< Bit mask of CH17 field. */
#define DPPIC_CHENCLR_CH17_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH17_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH17_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 16 : Channel 16 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH16_Pos         ( 16UL )                            /*!< Position of CH16 field. */
#define DPPIC_CHENCLR_CH16_Msk         ( 0x1UL << DPPIC_CHENCLR_CH16_Pos ) /*!< Bit mask of CH16 field. */
#define DPPIC_CHENCLR_CH16_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH16_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH16_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 15 : Channel 15 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH15_Pos         ( 15UL )                            /*!< Position of CH15 field. */
#define DPPIC_CHENCLR_CH15_Msk         ( 0x1UL << DPPIC_CHENCLR_CH15_Pos ) /*!< Bit mask of CH15 field. */
#define DPPIC_CHENCLR_CH15_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH15_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH15_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 14 : Channel 14 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH14_Pos         ( 14UL )                            /*!< Position of CH14 field. */
#define DPPIC_CHENCLR_CH14_Msk         ( 0x1UL << DPPIC_CHENCLR_CH14_Pos ) /*!< Bit mask of CH14 field. */
#define DPPIC_CHENCLR_CH14_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH14_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH14_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 13 : Channel 13 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH13_Pos         ( 13UL )                            /*!< Position of CH13 field. */
#define DPPIC_CHENCLR_CH13_Msk         ( 0x1UL << DPPIC_CHENCLR_CH13_Pos ) /*!< Bit mask of CH13 field. */
#define DPPIC_CHENCLR_CH13_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH13_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH13_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 12 : Channel 12 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH12_Pos         ( 12UL )                            /*!< Position of CH12 field. */
#define DPPIC_CHENCLR_CH12_Msk         ( 0x1UL << DPPIC_CHENCLR_CH12_Pos ) /*!< Bit mask of CH12 field. */
#define DPPIC_CHENCLR_CH12_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH12_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH12_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 11 : Channel 11 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH11_Pos         ( 11UL )                            /*!< Position of CH11 field. */
#define DPPIC_CHENCLR_CH11_Msk         ( 0x1UL << DPPIC_CHENCLR_CH11_Pos ) /*!< Bit mask of CH11 field. */
#define DPPIC_CHENCLR_CH11_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH11_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH11_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 10 : Channel 10 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH10_Pos         ( 10UL )                            /*!< Position of CH10 field. */
#define DPPIC_CHENCLR_CH10_Msk         ( 0x1UL << DPPIC_CHENCLR_CH10_Pos ) /*!< Bit mask of CH10 field. */
#define DPPIC_CHENCLR_CH10_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH10_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH10_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 9 : Channel 9 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH9_Pos          ( 9UL )                            /*!< Position of CH9 field. */
#define DPPIC_CHENCLR_CH9_Msk          ( 0x1UL << DPPIC_CHENCLR_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define DPPIC_CHENCLR_CH9_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH9_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH9_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 8 : Channel 8 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH8_Pos          ( 8UL )                            /*!< Position of CH8 field. */
#define DPPIC_CHENCLR_CH8_Msk          ( 0x1UL << DPPIC_CHENCLR_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define DPPIC_CHENCLR_CH8_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH8_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH8_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 7 : Channel 7 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH7_Pos          ( 7UL )                            /*!< Position of CH7 field. */
#define DPPIC_CHENCLR_CH7_Msk          ( 0x1UL << DPPIC_CHENCLR_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define DPPIC_CHENCLR_CH7_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH7_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH7_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 6 : Channel 6 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH6_Pos          ( 6UL )                            /*!< Position of CH6 field. */
#define DPPIC_CHENCLR_CH6_Msk          ( 0x1UL << DPPIC_CHENCLR_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define DPPIC_CHENCLR_CH6_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH6_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH6_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 5 : Channel 5 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH5_Pos          ( 5UL )                            /*!< Position of CH5 field. */
#define DPPIC_CHENCLR_CH5_Msk          ( 0x1UL << DPPIC_CHENCLR_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define DPPIC_CHENCLR_CH5_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH5_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH5_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 4 : Channel 4 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH4_Pos          ( 4UL )                            /*!< Position of CH4 field. */
#define DPPIC_CHENCLR_CH4_Msk          ( 0x1UL << DPPIC_CHENCLR_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define DPPIC_CHENCLR_CH4_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH4_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH4_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 3 : Channel 3 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH3_Pos          ( 3UL )                            /*!< Position of CH3 field. */
#define DPPIC_CHENCLR_CH3_Msk          ( 0x1UL << DPPIC_CHENCLR_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define DPPIC_CHENCLR_CH3_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH3_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH3_Clear        ( 1UL )                            /*!< Write: Disable channel */

