FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 2 : Include or exclude channel 2 */
#define DPPIC_CHG_CH2_Pos          ( 2UL )                        /*!< Position of CH2 field. */
#define DPPIC_CHG_CH2_Msk          ( 0x1UL << DPPIC_CHG_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define DPPIC_CHG_CH2_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH2_Included     ( 1UL )                        /*!< Include */

/* Bit 1 : Include or exclude channel 1 */
#define DPPIC_CHG_CH1_Pos          ( 1UL )                        /*!< Position of CH1 field. */
#define DPPIC_CHG_CH1_Msk          ( 0x1UL << DPPIC_CHG_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define DPPIC_CHG_CH1_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH1_Included     ( 1UL )                        /*!< Include */

/* Bit 0 : Include or exclude channel 0 */
#define DPPIC_CHG_CH0_Pos          ( 0UL )                        /*!< Position of CH0 field. */
#define DPPIC_CHG_CH0_Msk          ( 0x1UL << DPPIC_CHG_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define DPPIC_CHG_CH0_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH0_Included     ( 1UL )                        /*!< Include */


/* Peripheral: EGU */
/* Description: Event generator unit 0 */

/* Register: EGU_TASKS_TRIGGER */
/* Description: Description collection: Trigger n for triggering the corresponding TRIGGERED[n] event */

/* Bit 0 : Trigger n for triggering the corresponding TRIGGERED[n] event */
#define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos        ( 0UL )                                          /*!< Position of TASKS_TRIGGER field. */
#define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Msk        ( 0x1UL << EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos ) /*!< Bit mask of TASKS_TRIGGER field. */
#define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: EGU_SUBSCRIBE_TRIGGER */
/* Description: Description collection: Subscribe configuration for task TRIGGER[n] */

/* Bit 31 :   */
#define EGU_SUBSCRIBE_TRIGGER_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define EGU_SUBSCRIBE_TRIGGER_EN_Msk         ( 0x1UL << EGU_SUBSCRIBE_TRIGGER_EN_Pos ) /*!< Bit mask of EN field. */
#define EGU_SUBSCRIBE_TRIGGER_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define EGU_SUBSCRIBE_TRIGGER_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task TRIGGER[n] will subscribe to */
#define EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define EGU_SUBSCRIBE_TRIGGER_CHIDX_Msk      ( 0xFFUL << EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: EGU_EVENTS_TRIGGERED */
/* Description: Description collection: Event number n generated by triggering the corresponding TRIGGER[n] task */

/* Bit 0 : Event number n generated by triggering the corresponding TRIGGER[n] task */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos             ( 0UL )                                                /*!< Position of EVENTS_TRIGGERED field. */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk             ( 0x1UL << EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos ) /*!< Bit mask of EVENTS_TRIGGERED field. */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated    ( 0UL )                                                /*!< Event not generated */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated       ( 1UL )                                                /*!< Event generated */

/* Register: EGU_PUBLISH_TRIGGERED */
/* Description: Description collection: Publish configuration for event TRIGGERED[n] */

/* Bit 31 :   */
#define EGU_PUBLISH_TRIGGERED_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define EGU_PUBLISH_TRIGGERED_EN_Msk         ( 0x1UL << EGU_PUBLISH_TRIGGERED_EN_Pos ) /*!< Bit mask of EN field. */
#define EGU_PUBLISH_TRIGGERED_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define EGU_PUBLISH_TRIGGERED_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TRIGGERED[n] will publish to. */
#define EGU_PUBLISH_TRIGGERED_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define EGU_PUBLISH_TRIGGERED_CHIDX_Msk      ( 0xFFUL << EGU_PUBLISH_TRIGGERED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: EGU_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 15 : Enable or disable interrupt for event TRIGGERED[15] */
#define EGU_INTEN_TRIGGERED15_Pos         ( 15UL )                               /*!< Position of TRIGGERED15 field. */
#define EGU_INTEN_TRIGGERED15_Msk         ( 0x1UL << EGU_INTEN_TRIGGERED15_Pos ) /*!< Bit mask of TRIGGERED15 field. */
#define EGU_INTEN_TRIGGERED15_Disabled    ( 0UL )                                /*!< Disable */
#define EGU_INTEN_TRIGGERED15_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event TRIGGERED[14] */
#define EGU_INTEN_TRIGGERED14_Pos         ( 14UL )                               /*!< Position of TRIGGERED14 field. */
#define EGU_INTEN_TRIGGERED14_Msk         ( 0x1UL << EGU_INTEN_TRIGGERED14_Pos ) /*!< Bit mask of TRIGGERED14 field. */
#define EGU_INTEN_TRIGGERED14_Disabled    ( 0UL )                                /*!< Disable */
#define EGU_INTEN_TRIGGERED14_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event TRIGGERED[13] */
#define EGU_INTEN_TRIGGERED13_Pos         ( 13UL )                               /*!< Position of TRIGGERED13 field. */
#define EGU_INTEN_TRIGGERED13_Msk         ( 0x1UL << EGU_INTEN_TRIGGERED13_Pos ) /*!< Bit mask of TRIGGERED13 field. */
#define EGU_INTEN_TRIGGERED13_Disabled    ( 0UL )                                /*!< Disable */
#define EGU_INTEN_TRIGGERED13_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event TRIGGERED[12] */
#define EGU_INTEN_TRIGGERED12_Pos         ( 12UL )                               /*!< Position of TRIGGERED12 field. */
#define EGU_INTEN_TRIGGERED12_Msk         ( 0x1UL << EGU_INTEN_TRIGGERED12_Pos ) /*!< Bit mask of TRIGGERED12 field. */
#define EGU_INTEN_TRIGGERED12_Disabled    ( 0UL )                                /*!< Disable */
#define EGU_INTEN_TRIGGERED12_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 11 : Enable or disable interrupt for event TRIGGERED[11] */
#define EGU_INTEN_TRIGGERED11_Pos         ( 11UL )                               /*!< Position of TRIGGERED11 field. */
#define EGU_INTEN_TRIGGERED11_Msk         ( 0x1UL << EGU_INTEN_TRIGGERED11_Pos ) /*!< Bit mask of TRIGGERED11 field. */
#define EGU_INTEN_TRIGGERED11_Disabled    ( 0UL )                                /*!< Disable */
#define EGU_INTEN_TRIGGERED11_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event TRIGGERED[10] */
#define EGU_INTEN_TRIGGERED10_Pos         ( 10UL )                               /*!< Position of TRIGGERED10 field. */
#define EGU_INTEN_TRIGGERED10_Msk         ( 0x1UL << EGU_INTEN_TRIGGERED10_Pos ) /*!< Bit mask of TRIGGERED10 field. */
#define EGU_INTEN_TRIGGERED10_Disabled    ( 0UL )                                /*!< Disable */
#define EGU_INTEN_TRIGGERED10_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event TRIGGERED[9] */
#define EGU_INTEN_TRIGGERED9_Pos          ( 9UL )                               /*!< Position of TRIGGERED9 field. */
#define EGU_INTEN_TRIGGERED9_Msk          ( 0x1UL << EGU_INTEN_TRIGGERED9_Pos ) /*!< Bit mask of TRIGGERED9 field. */
#define EGU_INTEN_TRIGGERED9_Disabled     ( 0UL )                               /*!< Disable */
#define EGU_INTEN_TRIGGERED9_Enabled      ( 1UL )                               /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event TRIGGERED[8] */
#define EGU_INTEN_TRIGGERED8_Pos          ( 8UL )                               /*!< Position of TRIGGERED8 field. */
#define EGU_INTEN_TRIGGERED8_Msk          ( 0x1UL << EGU_INTEN_TRIGGERED8_Pos ) /*!< Bit mask of TRIGGERED8 field. */
#define EGU_INTEN_TRIGGERED8_Disabled     ( 0UL )                               /*!< Disable */
#define EGU_INTEN_TRIGGERED8_Enabled      ( 1UL )                               /*!< Enable */

