FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 10 : Write '1' to enable interrupt for event TRIGGERED[10] */
#define EGU_INTENSET_TRIGGERED10_Pos         ( 10UL )                                  /*!< Position of TRIGGERED10 field. */
#define EGU_INTENSET_TRIGGERED10_Msk         ( 0x1UL << EGU_INTENSET_TRIGGERED10_Pos ) /*!< Bit mask of TRIGGERED10 field. */
#define EGU_INTENSET_TRIGGERED10_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED10_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED10_Set         ( 1UL )                                   /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event TRIGGERED[9] */
#define EGU_INTENSET_TRIGGERED9_Pos          ( 9UL )                                  /*!< Position of TRIGGERED9 field. */
#define EGU_INTENSET_TRIGGERED9_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED9_Pos ) /*!< Bit mask of TRIGGERED9 field. */
#define EGU_INTENSET_TRIGGERED9_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED9_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED9_Set          ( 1UL )                                  /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event TRIGGERED[8] */
#define EGU_INTENSET_TRIGGERED8_Pos          ( 8UL )                                  /*!< Position of TRIGGERED8 field. */
#define EGU_INTENSET_TRIGGERED8_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED8_Pos ) /*!< Bit mask of TRIGGERED8 field. */
#define EGU_INTENSET_TRIGGERED8_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED8_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED8_Set          ( 1UL )                                  /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event TRIGGERED[7] */
#define EGU_INTENSET_TRIGGERED7_Pos          ( 7UL )                                  /*!< Position of TRIGGERED7 field. */
#define EGU_INTENSET_TRIGGERED7_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED7_Pos ) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENSET_TRIGGERED7_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED7_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED7_Set          ( 1UL )                                  /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event TRIGGERED[6] */
#define EGU_INTENSET_TRIGGERED6_Pos          ( 6UL )                                  /*!< Position of TRIGGERED6 field. */
#define EGU_INTENSET_TRIGGERED6_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED6_Pos ) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENSET_TRIGGERED6_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED6_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED6_Set          ( 1UL )                                  /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event TRIGGERED[5] */
#define EGU_INTENSET_TRIGGERED5_Pos          ( 5UL )                                  /*!< Position of TRIGGERED5 field. */
#define EGU_INTENSET_TRIGGERED5_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED5_Pos ) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENSET_TRIGGERED5_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED5_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED5_Set          ( 1UL )                                  /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event TRIGGERED[4] */
#define EGU_INTENSET_TRIGGERED4_Pos          ( 4UL )                                  /*!< Position of TRIGGERED4 field. */
#define EGU_INTENSET_TRIGGERED4_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED4_Pos ) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENSET_TRIGGERED4_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED4_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED4_Set          ( 1UL )                                  /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event TRIGGERED[3] */
#define EGU_INTENSET_TRIGGERED3_Pos          ( 3UL )                                  /*!< Position of TRIGGERED3 field. */
#define EGU_INTENSET_TRIGGERED3_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED3_Pos ) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENSET_TRIGGERED3_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED3_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED3_Set          ( 1UL )                                  /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event TRIGGERED[2] */
#define EGU_INTENSET_TRIGGERED2_Pos          ( 2UL )                                  /*!< Position of TRIGGERED2 field. */
#define EGU_INTENSET_TRIGGERED2_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED2_Pos ) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENSET_TRIGGERED2_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED2_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED2_Set          ( 1UL )                                  /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event TRIGGERED[1] */
#define EGU_INTENSET_TRIGGERED1_Pos          ( 1UL )                                  /*!< Position of TRIGGERED1 field. */
#define EGU_INTENSET_TRIGGERED1_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED1_Pos ) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENSET_TRIGGERED1_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED1_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED1_Set          ( 1UL )                                  /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event TRIGGERED[0] */
#define EGU_INTENSET_TRIGGERED0_Pos          ( 0UL )                                  /*!< Position of TRIGGERED0 field. */
#define EGU_INTENSET_TRIGGERED0_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED0_Pos ) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENSET_TRIGGERED0_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED0_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED0_Set          ( 1UL )                                  /*!< Enable */

/* Register: EGU_INTENCLR */
/* Description: Disable interrupt */

/* Bit 15 : Write '1' to disable interrupt for event TRIGGERED[15] */
#define EGU_INTENCLR_TRIGGERED15_Pos         ( 15UL )                                  /*!< Position of TRIGGERED15 field. */
#define EGU_INTENCLR_TRIGGERED15_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED15_Pos ) /*!< Bit mask of TRIGGERED15 field. */
#define EGU_INTENCLR_TRIGGERED15_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED15_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED15_Clear       ( 1UL )                                   /*!< Disable */

