FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 14 : Write '1' to disable interrupt for event TRIGGERED[14] */
#define EGU_INTENCLR_TRIGGERED14_Pos         ( 14UL )                                  /*!< Position of TRIGGERED14 field. */
#define EGU_INTENCLR_TRIGGERED14_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED14_Pos ) /*!< Bit mask of TRIGGERED14 field. */
#define EGU_INTENCLR_TRIGGERED14_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED14_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED14_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 13 : Write '1' to disable interrupt for event TRIGGERED[13] */
#define EGU_INTENCLR_TRIGGERED13_Pos         ( 13UL )                                  /*!< Position of TRIGGERED13 field. */
#define EGU_INTENCLR_TRIGGERED13_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED13_Pos ) /*!< Bit mask of TRIGGERED13 field. */
#define EGU_INTENCLR_TRIGGERED13_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED13_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED13_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event TRIGGERED[12] */
#define EGU_INTENCLR_TRIGGERED12_Pos         ( 12UL )                                  /*!< Position of TRIGGERED12 field. */
#define EGU_INTENCLR_TRIGGERED12_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED12_Pos ) /*!< Bit mask of TRIGGERED12 field. */
#define EGU_INTENCLR_TRIGGERED12_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED12_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED12_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 11 : Write '1' to disable interrupt for event TRIGGERED[11] */
#define EGU_INTENCLR_TRIGGERED11_Pos         ( 11UL )                                  /*!< Position of TRIGGERED11 field. */
#define EGU_INTENCLR_TRIGGERED11_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED11_Pos ) /*!< Bit mask of TRIGGERED11 field. */
#define EGU_INTENCLR_TRIGGERED11_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED11_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED11_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event TRIGGERED[10] */
#define EGU_INTENCLR_TRIGGERED10_Pos         ( 10UL )                                  /*!< Position of TRIGGERED10 field. */
#define EGU_INTENCLR_TRIGGERED10_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED10_Pos ) /*!< Bit mask of TRIGGERED10 field. */
#define EGU_INTENCLR_TRIGGERED10_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED10_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED10_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event TRIGGERED[9] */
#define EGU_INTENCLR_TRIGGERED9_Pos          ( 9UL )                                  /*!< Position of TRIGGERED9 field. */
#define EGU_INTENCLR_TRIGGERED9_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED9_Pos ) /*!< Bit mask of TRIGGERED9 field. */
#define EGU_INTENCLR_TRIGGERED9_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED9_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED9_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event TRIGGERED[8] */
#define EGU_INTENCLR_TRIGGERED8_Pos          ( 8UL )                                  /*!< Position of TRIGGERED8 field. */
#define EGU_INTENCLR_TRIGGERED8_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED8_Pos ) /*!< Bit mask of TRIGGERED8 field. */
#define EGU_INTENCLR_TRIGGERED8_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED8_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED8_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
#define EGU_INTENCLR_TRIGGERED7_Pos          ( 7UL )                                  /*!< Position of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED7_Pos ) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED7_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED7_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
#define EGU_INTENCLR_TRIGGERED6_Pos          ( 6UL )                                  /*!< Position of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED6_Pos ) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED6_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED6_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
#define EGU_INTENCLR_TRIGGERED5_Pos          ( 5UL )                                  /*!< Position of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED5_Pos ) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED5_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED5_Clear        ( 1UL )                                  /*!< Disable */

