FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
#define EGU_INTENCLR_TRIGGERED4_Pos          ( 4UL )                                  /*!< Position of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED4_Pos ) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED4_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED4_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
#define EGU_INTENCLR_TRIGGERED3_Pos          ( 3UL )                                  /*!< Position of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED3_Pos ) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED3_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED3_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
#define EGU_INTENCLR_TRIGGERED2_Pos          ( 2UL )                                  /*!< Position of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED2_Pos ) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED2_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED2_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
#define EGU_INTENCLR_TRIGGERED1_Pos          ( 1UL )                                  /*!< Position of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED1_Pos ) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED1_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED1_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
#define EGU_INTENCLR_TRIGGERED0_Pos          ( 0UL )                                  /*!< Position of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED0_Pos ) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED0_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED0_Clear        ( 1UL )                                  /*!< Disable */


/* Peripheral: FICR */
/* Description: Factory Information Configuration Registers */

/* Register: FICR_INFO_CONFIGID */
/* Description: Configuration identifier */

/* Bits 15..0 : Identification number for the HW */
#define FICR_INFO_CONFIGID_HWID_Pos    ( 0UL )                                     /*!< Position of HWID field. */
#define FICR_INFO_CONFIGID_HWID_Msk    ( 0xFFFFUL << FICR_INFO_CONFIGID_HWID_Pos ) /*!< Bit mask of HWID field. */

/* Register: FICR_INFO_DEVICEID */
/* Description: Description collection: Device identifier */

/* Bits 31..0 : 64 bit unique device identifier */
#define FICR_INFO_DEVICEID_DEVICEID_Pos    ( 0UL )                                             /*!< Position of DEVICEID field. */
#define FICR_INFO_DEVICEID_DEVICEID_Msk    ( 0xFFFFFFFFUL << FICR_INFO_DEVICEID_DEVICEID_Pos ) /*!< Bit mask of DEVICEID field. */

/* Register: FICR_INFO_PART */
/* Description: Part code */

/* Bits 31..0 : Part code */
#define FICR_INFO_PART_PART_Pos            ( 0UL )                                     /*!< Position of PART field. */
#define FICR_INFO_PART_PART_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos ) /*!< Bit mask of PART field. */
#define FICR_INFO_PART_PART_N5340          ( 0x5340UL )                                /*!< nRF5340 */
#define FICR_INFO_PART_PART_Unspecified    ( 0xFFFFFFFFUL )                            /*!< Unspecified */

/* Register: FICR_INFO_VARIANT */
/* Description: Part Variant, Hardware version and Production configuration */

/* Bits 31..0 : Part Variant, Hardware version and Production configuration, encoded as ASCII */
#define FICR_INFO_VARIANT_VARIANT_Pos            ( 0UL )                                           /*!< Position of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_Msk            ( 0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos ) /*!< Bit mask of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_CLAA           ( 0x434C4141UL )                                  /*!< CLAA */
#define FICR_INFO_VARIANT_VARIANT_QKAA           ( 0x514B4141UL )                                  /*!< QKAA */
#define FICR_INFO_VARIANT_VARIANT_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_PACKAGE */
/* Description: Package option */

/* Bits 31..0 : Package option */
#define FICR_INFO_PACKAGE_PACKAGE_Pos            ( 0UL )                                           /*!< Position of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos ) /*!< Bit mask of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_QK             ( 0x2000UL )                                      /*!< QKxx - 94-pin aQFN */
#define FICR_INFO_PACKAGE_PACKAGE_CL             ( 0x2005UL )                                      /*!< CLxx - WLCSP */
#define FICR_INFO_PACKAGE_PACKAGE_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_RAM */
/* Description: RAM variant */

/* Bits 31..0 : RAM variant */
#define FICR_INFO_RAM_RAM_Pos            ( 0UL )                                   /*!< Position of RAM field. */
#define FICR_INFO_RAM_RAM_Msk            ( 0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos ) /*!< Bit mask of RAM field. */
#define FICR_INFO_RAM_RAM_K16            ( 0x10UL )                                /*!< 16 kByte RAM */
#define FICR_INFO_RAM_RAM_K32            ( 0x20UL )                                /*!< 32 kByte RAM */
#define FICR_INFO_RAM_RAM_K64            ( 0x40UL )                                /*!< 64 kByte RAM */
#define FICR_INFO_RAM_RAM_K128           ( 0x80UL )                                /*!< 128 kByte RAM */
#define FICR_INFO_RAM_RAM_K256           ( 0x100UL )                               /*!< 256 kByte RAM */
#define FICR_INFO_RAM_RAM_K512           ( 0x200UL )                               /*!< 512 kByte RAM */
#define FICR_INFO_RAM_RAM_Unspecified    ( 0xFFFFFFFFUL )                          /*!< Unspecified */

/* Register: FICR_INFO_FLASH */
/* Description: Flash variant */

/* Bits 31..0 : Flash variant */
#define FICR_INFO_FLASH_FLASH_Pos            ( 0UL )                                       /*!< Position of FLASH field. */
#define FICR_INFO_FLASH_FLASH_Msk            ( 0xFFFFFFFFUL << FICR_INFO_FLASH_FLASH_Pos ) /*!< Bit mask of FLASH field. */
#define FICR_INFO_FLASH_FLASH_K128           ( 0x80UL )                                    /*!< 128 kByte FLASH */
#define FICR_INFO_FLASH_FLASH_K256           ( 0x100UL )                                   /*!< 256 kByte FLASH */
#define FICR_INFO_FLASH_FLASH_K512           ( 0x200UL )                                   /*!< 512 kByte FLASH */
#define FICR_INFO_FLASH_FLASH_K1024          ( 0x400UL )                                   /*!< 1 MByte FLASH */
#define FICR_INFO_FLASH_FLASH_K2048          ( 0x800UL )                                   /*!< 2 MByte FLASH */
#define FICR_INFO_FLASH_FLASH_Unspecified    ( 0xFFFFFFFFUL )                              /*!< Unspecified */

/* Register: FICR_INFO_CODEPAGESIZE */
/* Description: Code memory page size in bytes */

/* Bits 31..0 : Code memory page size in bytes */
#define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos      ( 0UL )                                                     /*!< Position of CODEPAGESIZE field. */
#define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Msk      ( 0xFFFFFFFFUL << FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos ) /*!< Bit mask of CODEPAGESIZE field. */
#define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_K4096    ( 0x1000UL )                                                /*!< 4 kByte */

/* Register: FICR_INFO_CODESIZE */
/* Description: Code memory size */

/* Bits 31..0 : Code memory size in number of pages */
#define FICR_INFO_CODESIZE_CODESIZE_Pos     ( 0UL )                                             /*!< Position of CODESIZE field. */
#define FICR_INFO_CODESIZE_CODESIZE_Msk     ( 0xFFFFFFFFUL << FICR_INFO_CODESIZE_CODESIZE_Pos ) /*!< Bit mask of CODESIZE field. */
#define FICR_INFO_CODESIZE_CODESIZE_P256    ( 256UL )                                           /*!< 256 pages */

/* Register: FICR_INFO_DEVICETYPE */
/* Description: Device type */

/* Bits 31..0 : Device type */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_Pos     ( 0UL )                                                 /*!< Position of DEVICETYPE field. */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_Msk     ( 0xFFFFFFFFUL << FICR_INFO_DEVICETYPE_DEVICETYPE_Pos ) /*!< Bit mask of DEVICETYPE field. */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_Die     ( 0x0000000UL )                                         /*!< Device is an physical DIE */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_FPGA    ( 0xFFFFFFFFUL )                                        /*!< Device is an FPGA */

/* Register: FICR_TRIMCNF_ADDR */
/* Description: Description cluster: Address of the PAR register which will be written */

