FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 31..0 : Address */
#define FICR_TRIMCNF_ADDR_Address_Pos    ( 0UL )                                           /*!< Position of Address field. */
#define FICR_TRIMCNF_ADDR_Address_Msk    ( 0xFFFFFFFFUL << FICR_TRIMCNF_ADDR_Address_Pos ) /*!< Bit mask of Address field. */

/* Register: FICR_TRIMCNF_DATA */
/* Description: Description cluster: Data */

/* Bits 31..0 : Data to be written into the PAR register */
#define FICR_TRIMCNF_DATA_Data_Pos    ( 0UL )                                        /*!< Position of Data field. */
#define FICR_TRIMCNF_DATA_Data_Msk    ( 0xFFFFFFFFUL << FICR_TRIMCNF_DATA_Data_Pos ) /*!< Bit mask of Data field. */

/* Register: FICR_NFC_TAGHEADER0 */
/* Description: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST. */

/* Bits 31..24 : Unique identifier byte 3 */
#define FICR_NFC_TAGHEADER0_UD3_Pos      ( 24UL )                                  /*!< Position of UD3 field. */
#define FICR_NFC_TAGHEADER0_UD3_Msk      ( 0xFFUL << FICR_NFC_TAGHEADER0_UD3_Pos ) /*!< Bit mask of UD3 field. */

/* Bits 23..16 : Unique identifier byte 2 */
#define FICR_NFC_TAGHEADER0_UD2_Pos      ( 16UL )                                  /*!< Position of UD2 field. */
#define FICR_NFC_TAGHEADER0_UD2_Msk      ( 0xFFUL << FICR_NFC_TAGHEADER0_UD2_Pos ) /*!< Bit mask of UD2 field. */

/* Bits 15..8 : Unique identifier byte 1 */
#define FICR_NFC_TAGHEADER0_UD1_Pos      ( 8UL )                                   /*!< Position of UD1 field. */
#define FICR_NFC_TAGHEADER0_UD1_Msk      ( 0xFFUL << FICR_NFC_TAGHEADER0_UD1_Pos ) /*!< Bit mask of UD1 field. */

/* Bits 7..0 : Default Manufacturer ID: Nordic Semiconductor ASA has ICM 0x5F */
#define FICR_NFC_TAGHEADER0_MFGID_Pos    ( 0UL )                                     /*!< Position of MFGID field. */
#define FICR_NFC_TAGHEADER0_MFGID_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER0_MFGID_Pos ) /*!< Bit mask of MFGID field. */

/* Register: FICR_NFC_TAGHEADER1 */
/* Description: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST. */

/* Bits 31..24 : Unique identifier byte 7 */
#define FICR_NFC_TAGHEADER1_UD7_Pos    ( 24UL )                                  /*!< Position of UD7 field. */
#define FICR_NFC_TAGHEADER1_UD7_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER1_UD7_Pos ) /*!< Bit mask of UD7 field. */

/* Bits 23..16 : Unique identifier byte 6 */
#define FICR_NFC_TAGHEADER1_UD6_Pos    ( 16UL )                                  /*!< Position of UD6 field. */
#define FICR_NFC_TAGHEADER1_UD6_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER1_UD6_Pos ) /*!< Bit mask of UD6 field. */

/* Bits 15..8 : Unique identifier byte 5 */
#define FICR_NFC_TAGHEADER1_UD5_Pos    ( 8UL )                                   /*!< Position of UD5 field. */
#define FICR_NFC_TAGHEADER1_UD5_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER1_UD5_Pos ) /*!< Bit mask of UD5 field. */

/* Bits 7..0 : Unique identifier byte 4 */
#define FICR_NFC_TAGHEADER1_UD4_Pos    ( 0UL )                                   /*!< Position of UD4 field. */
#define FICR_NFC_TAGHEADER1_UD4_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER1_UD4_Pos ) /*!< Bit mask of UD4 field. */

/* Register: FICR_NFC_TAGHEADER2 */
/* Description: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST. */

/* Bits 31..24 : Unique identifier byte 11 */
#define FICR_NFC_TAGHEADER2_UD11_Pos    ( 24UL )                                   /*!< Position of UD11 field. */
#define FICR_NFC_TAGHEADER2_UD11_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER2_UD11_Pos ) /*!< Bit mask of UD11 field. */

/* Bits 23..16 : Unique identifier byte 10 */
#define FICR_NFC_TAGHEADER2_UD10_Pos    ( 16UL )                                   /*!< Position of UD10 field. */
#define FICR_NFC_TAGHEADER2_UD10_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER2_UD10_Pos ) /*!< Bit mask of UD10 field. */

/* Bits 15..8 : Unique identifier byte 9 */
#define FICR_NFC_TAGHEADER2_UD9_Pos     ( 8UL )                                   /*!< Position of UD9 field. */
#define FICR_NFC_TAGHEADER2_UD9_Msk     ( 0xFFUL << FICR_NFC_TAGHEADER2_UD9_Pos ) /*!< Bit mask of UD9 field. */

/* Bits 7..0 : Unique identifier byte 8 */
#define FICR_NFC_TAGHEADER2_UD8_Pos     ( 0UL )                                   /*!< Position of UD8 field. */
#define FICR_NFC_TAGHEADER2_UD8_Msk     ( 0xFFUL << FICR_NFC_TAGHEADER2_UD8_Pos ) /*!< Bit mask of UD8 field. */

/* Register: FICR_NFC_TAGHEADER3 */
/* Description: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST. */

/* Bits 31..24 : Unique identifier byte 15 */
#define FICR_NFC_TAGHEADER3_UD15_Pos    ( 24UL )                                   /*!< Position of UD15 field. */
#define FICR_NFC_TAGHEADER3_UD15_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER3_UD15_Pos ) /*!< Bit mask of UD15 field. */

/* Bits 23..16 : Unique identifier byte 14 */
#define FICR_NFC_TAGHEADER3_UD14_Pos    ( 16UL )                                   /*!< Position of UD14 field. */
#define FICR_NFC_TAGHEADER3_UD14_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER3_UD14_Pos ) /*!< Bit mask of UD14 field. */

/* Bits 15..8 : Unique identifier byte 13 */
#define FICR_NFC_TAGHEADER3_UD13_Pos    ( 8UL )                                    /*!< Position of UD13 field. */
#define FICR_NFC_TAGHEADER3_UD13_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER3_UD13_Pos ) /*!< Bit mask of UD13 field. */

/* Bits 7..0 : Unique identifier byte 12 */
#define FICR_NFC_TAGHEADER3_UD12_Pos    ( 0UL )                                    /*!< Position of UD12 field. */
#define FICR_NFC_TAGHEADER3_UD12_Msk    ( 0xFFUL << FICR_NFC_TAGHEADER3_UD12_Pos ) /*!< Bit mask of UD12 field. */

/* Register: FICR_TRNG90B_BYTES */
/* Description: Amount of bytes for the required entropy bits */

/* Bits 31..0 : Amount of bytes for the required entropy bits */
#define FICR_TRNG90B_BYTES_BYTES_Pos    ( 0UL )                                          /*!< Position of BYTES field. */
#define FICR_TRNG90B_BYTES_BYTES_Msk    ( 0xFFFFFFFFUL << FICR_TRNG90B_BYTES_BYTES_Pos ) /*!< Bit mask of BYTES field. */

/* Register: FICR_TRNG90B_RCCUTOFF */
/* Description: Repetition counter cutoff */

/* Bits 31..0 : Repetition counter cutoff */
#define FICR_TRNG90B_RCCUTOFF_RCCUTOFF_Pos    ( 0UL )                                                /*!< Position of RCCUTOFF field. */
#define FICR_TRNG90B_RCCUTOFF_RCCUTOFF_Msk    ( 0xFFFFFFFFUL << FICR_TRNG90B_RCCUTOFF_RCCUTOFF_Pos ) /*!< Bit mask of RCCUTOFF field. */

/* Register: FICR_TRNG90B_APCUTOFF */
/* Description: Adaptive proportion cutoff */

