FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : An FPUIDC exception triggered by a denormal floating-point input has occurred in the FPU */
#define FPU_EVENTS_DENORMALINPUT_EVENTS_DENORMALINPUT_Pos             ( 0UL )                                                        /*!< Position of EVENTS_DENORMALINPUT field. */
#define FPU_EVENTS_DENORMALINPUT_EVENTS_DENORMALINPUT_Msk             ( 0x1UL << FPU_EVENTS_DENORMALINPUT_EVENTS_DENORMALINPUT_Pos ) /*!< Bit mask of EVENTS_DENORMALINPUT field. */
#define FPU_EVENTS_DENORMALINPUT_EVENTS_DENORMALINPUT_NotGenerated    ( 0UL )                                                        /*!< Event not generated */
#define FPU_EVENTS_DENORMALINPUT_EVENTS_DENORMALINPUT_Generated       ( 1UL )                                                        /*!< Event generated */

/* Register: FPU_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 5 : Enable or disable interrupt for event DENORMALINPUT */
#define FPU_INTEN_DENORMALINPUT_Pos            ( 5UL )                                  /*!< Position of DENORMALINPUT field. */
#define FPU_INTEN_DENORMALINPUT_Msk            ( 0x1UL << FPU_INTEN_DENORMALINPUT_Pos ) /*!< Bit mask of DENORMALINPUT field. */
#define FPU_INTEN_DENORMALINPUT_Disabled       ( 0UL )                                  /*!< Disable */
#define FPU_INTEN_DENORMALINPUT_Enabled        ( 1UL )                                  /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event INEXACT */
#define FPU_INTEN_INEXACT_Pos                  ( 4UL )                            /*!< Position of INEXACT field. */
#define FPU_INTEN_INEXACT_Msk                  ( 0x1UL << FPU_INTEN_INEXACT_Pos ) /*!< Bit mask of INEXACT field. */
#define FPU_INTEN_INEXACT_Disabled             ( 0UL )                            /*!< Disable */
#define FPU_INTEN_INEXACT_Enabled              ( 1UL )                            /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event UNDERFLOW */
#define FPU_INTEN_UNDERFLOW_Pos                ( 3UL )                              /*!< Position of UNDERFLOW field. */
#define FPU_INTEN_UNDERFLOW_Msk                ( 0x1UL << FPU_INTEN_UNDERFLOW_Pos ) /*!< Bit mask of UNDERFLOW field. */
#define FPU_INTEN_UNDERFLOW_Disabled           ( 0UL )                              /*!< Disable */
#define FPU_INTEN_UNDERFLOW_Enabled            ( 1UL )                              /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event OVERFLOW */
#define FPU_INTEN_OVERFLOW_Pos                 ( 2UL )                             /*!< Position of OVERFLOW field. */
#define FPU_INTEN_OVERFLOW_Msk                 ( 0x1UL << FPU_INTEN_OVERFLOW_Pos ) /*!< Bit mask of OVERFLOW field. */
#define FPU_INTEN_OVERFLOW_Disabled            ( 0UL )                             /*!< Disable */
#define FPU_INTEN_OVERFLOW_Enabled             ( 1UL )                             /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event DIVIDEBYZERO */
#define FPU_INTEN_DIVIDEBYZERO_Pos             ( 1UL )                                 /*!< Position of DIVIDEBYZERO field. */
#define FPU_INTEN_DIVIDEBYZERO_Msk             ( 0x1UL << FPU_INTEN_DIVIDEBYZERO_Pos ) /*!< Bit mask of DIVIDEBYZERO field. */
#define FPU_INTEN_DIVIDEBYZERO_Disabled        ( 0UL )                                 /*!< Disable */
#define FPU_INTEN_DIVIDEBYZERO_Enabled         ( 1UL )                                 /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event INVALIDOPERATION */
#define FPU_INTEN_INVALIDOPERATION_Pos         ( 0UL )                                     /*!< Position of INVALIDOPERATION field. */
#define FPU_INTEN_INVALIDOPERATION_Msk         ( 0x1UL << FPU_INTEN_INVALIDOPERATION_Pos ) /*!< Bit mask of INVALIDOPERATION field. */
#define FPU_INTEN_INVALIDOPERATION_Disabled    ( 0UL )                                     /*!< Disable */
#define FPU_INTEN_INVALIDOPERATION_Enabled     ( 1UL )                                     /*!< Enable */

/* Register: FPU_INTENSET */
/* Description: Enable interrupt */

/* Bit 5 : Write '1' to enable interrupt for event DENORMALINPUT */
#define FPU_INTENSET_DENORMALINPUT_Pos            ( 5UL )                                     /*!< Position of DENORMALINPUT field. */
#define FPU_INTENSET_DENORMALINPUT_Msk            ( 0x1UL << FPU_INTENSET_DENORMALINPUT_Pos ) /*!< Bit mask of DENORMALINPUT field. */
#define FPU_INTENSET_DENORMALINPUT_Disabled       ( 0UL )                                     /*!< Read: Disabled */
#define FPU_INTENSET_DENORMALINPUT_Enabled        ( 1UL )                                     /*!< Read: Enabled */
#define FPU_INTENSET_DENORMALINPUT_Set            ( 1UL )                                     /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event INEXACT */
#define FPU_INTENSET_INEXACT_Pos                  ( 4UL )                               /*!< Position of INEXACT field. */
#define FPU_INTENSET_INEXACT_Msk                  ( 0x1UL << FPU_INTENSET_INEXACT_Pos ) /*!< Bit mask of INEXACT field. */
#define FPU_INTENSET_INEXACT_Disabled             ( 0UL )                               /*!< Read: Disabled */
#define FPU_INTENSET_INEXACT_Enabled              ( 1UL )                               /*!< Read: Enabled */
#define FPU_INTENSET_INEXACT_Set                  ( 1UL )                               /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event UNDERFLOW */
#define FPU_INTENSET_UNDERFLOW_Pos                ( 3UL )                                 /*!< Position of UNDERFLOW field. */
#define FPU_INTENSET_UNDERFLOW_Msk                ( 0x1UL << FPU_INTENSET_UNDERFLOW_Pos ) /*!< Bit mask of UNDERFLOW field. */
#define FPU_INTENSET_UNDERFLOW_Disabled           ( 0UL )                                 /*!< Read: Disabled */
#define FPU_INTENSET_UNDERFLOW_Enabled            ( 1UL )                                 /*!< Read: Enabled */
#define FPU_INTENSET_UNDERFLOW_Set                ( 1UL )                                 /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event OVERFLOW */
#define FPU_INTENSET_OVERFLOW_Pos                 ( 2UL )                                /*!< Position of OVERFLOW field. */
#define FPU_INTENSET_OVERFLOW_Msk                 ( 0x1UL << FPU_INTENSET_OVERFLOW_Pos ) /*!< Bit mask of OVERFLOW field. */
#define FPU_INTENSET_OVERFLOW_Disabled            ( 0UL )                                /*!< Read: Disabled */
#define FPU_INTENSET_OVERFLOW_Enabled             ( 1UL )                                /*!< Read: Enabled */
#define FPU_INTENSET_OVERFLOW_Set                 ( 1UL )                                /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event DIVIDEBYZERO */
#define FPU_INTENSET_DIVIDEBYZERO_Pos             ( 1UL )                                    /*!< Position of DIVIDEBYZERO field. */
#define FPU_INTENSET_DIVIDEBYZERO_Msk             ( 0x1UL << FPU_INTENSET_DIVIDEBYZERO_Pos ) /*!< Bit mask of DIVIDEBYZERO field. */
#define FPU_INTENSET_DIVIDEBYZERO_Disabled        ( 0UL )                                    /*!< Read: Disabled */
#define FPU_INTENSET_DIVIDEBYZERO_Enabled         ( 1UL )                                    /*!< Read: Enabled */
#define FPU_INTENSET_DIVIDEBYZERO_Set             ( 1UL )                                    /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event INVALIDOPERATION */
#define FPU_INTENSET_INVALIDOPERATION_Pos         ( 0UL )                                        /*!< Position of INVALIDOPERATION field. */
#define FPU_INTENSET_INVALIDOPERATION_Msk         ( 0x1UL << FPU_INTENSET_INVALIDOPERATION_Pos ) /*!< Bit mask of INVALIDOPERATION field. */
#define FPU_INTENSET_INVALIDOPERATION_Disabled    ( 0UL )                                        /*!< Read: Disabled */
#define FPU_INTENSET_INVALIDOPERATION_Enabled     ( 1UL )                                        /*!< Read: Enabled */
#define FPU_INTENSET_INVALIDOPERATION_Set         ( 1UL )                                        /*!< Enable */

/* Register: FPU_INTENCLR */
/* Description: Disable interrupt */

/* Bit 5 : Write '1' to disable interrupt for event DENORMALINPUT */
#define FPU_INTENCLR_DENORMALINPUT_Pos            ( 5UL )                                     /*!< Position of DENORMALINPUT field. */
#define FPU_INTENCLR_DENORMALINPUT_Msk            ( 0x1UL << FPU_INTENCLR_DENORMALINPUT_Pos ) /*!< Bit mask of DENORMALINPUT field. */
#define FPU_INTENCLR_DENORMALINPUT_Disabled       ( 0UL )                                     /*!< Read: Disabled */
#define FPU_INTENCLR_DENORMALINPUT_Enabled        ( 1UL )                                     /*!< Read: Enabled */
#define FPU_INTENCLR_DENORMALINPUT_Clear          ( 1UL )                                     /*!< Disable */

