FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 4 : Write '1' to disable interrupt for event INEXACT */
#define FPU_INTENCLR_INEXACT_Pos                  ( 4UL )                               /*!< Position of INEXACT field. */
#define FPU_INTENCLR_INEXACT_Msk                  ( 0x1UL << FPU_INTENCLR_INEXACT_Pos ) /*!< Bit mask of INEXACT field. */
#define FPU_INTENCLR_INEXACT_Disabled             ( 0UL )                               /*!< Read: Disabled */
#define FPU_INTENCLR_INEXACT_Enabled              ( 1UL )                               /*!< Read: Enabled */
#define FPU_INTENCLR_INEXACT_Clear                ( 1UL )                               /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event UNDERFLOW */
#define FPU_INTENCLR_UNDERFLOW_Pos                ( 3UL )                                 /*!< Position of UNDERFLOW field. */
#define FPU_INTENCLR_UNDERFLOW_Msk                ( 0x1UL << FPU_INTENCLR_UNDERFLOW_Pos ) /*!< Bit mask of UNDERFLOW field. */
#define FPU_INTENCLR_UNDERFLOW_Disabled           ( 0UL )                                 /*!< Read: Disabled */
#define FPU_INTENCLR_UNDERFLOW_Enabled            ( 1UL )                                 /*!< Read: Enabled */
#define FPU_INTENCLR_UNDERFLOW_Clear              ( 1UL )                                 /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event OVERFLOW */
#define FPU_INTENCLR_OVERFLOW_Pos                 ( 2UL )                                /*!< Position of OVERFLOW field. */
#define FPU_INTENCLR_OVERFLOW_Msk                 ( 0x1UL << FPU_INTENCLR_OVERFLOW_Pos ) /*!< Bit mask of OVERFLOW field. */
#define FPU_INTENCLR_OVERFLOW_Disabled            ( 0UL )                                /*!< Read: Disabled */
#define FPU_INTENCLR_OVERFLOW_Enabled             ( 1UL )                                /*!< Read: Enabled */
#define FPU_INTENCLR_OVERFLOW_Clear               ( 1UL )                                /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event DIVIDEBYZERO */
#define FPU_INTENCLR_DIVIDEBYZERO_Pos             ( 1UL )                                    /*!< Position of DIVIDEBYZERO field. */
#define FPU_INTENCLR_DIVIDEBYZERO_Msk             ( 0x1UL << FPU_INTENCLR_DIVIDEBYZERO_Pos ) /*!< Bit mask of DIVIDEBYZERO field. */
#define FPU_INTENCLR_DIVIDEBYZERO_Disabled        ( 0UL )                                    /*!< Read: Disabled */
#define FPU_INTENCLR_DIVIDEBYZERO_Enabled         ( 1UL )                                    /*!< Read: Enabled */
#define FPU_INTENCLR_DIVIDEBYZERO_Clear           ( 1UL )                                    /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event INVALIDOPERATION */
#define FPU_INTENCLR_INVALIDOPERATION_Pos         ( 0UL )                                        /*!< Position of INVALIDOPERATION field. */
#define FPU_INTENCLR_INVALIDOPERATION_Msk         ( 0x1UL << FPU_INTENCLR_INVALIDOPERATION_Pos ) /*!< Bit mask of INVALIDOPERATION field. */
#define FPU_INTENCLR_INVALIDOPERATION_Disabled    ( 0UL )                                        /*!< Read: Disabled */
#define FPU_INTENCLR_INVALIDOPERATION_Enabled     ( 1UL )                                        /*!< Read: Enabled */
#define FPU_INTENCLR_INVALIDOPERATION_Clear       ( 1UL )                                        /*!< Disable */


/* Peripheral: GPIOTE */
/* Description: GPIO Tasks and Events 0 */

/* Register: GPIOTE_TASKS_OUT */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Pos        ( 0UL )                                     /*!< Position of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Msk        ( 0x1UL << GPIOTE_TASKS_OUT_TASKS_OUT_Pos ) /*!< Bit mask of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_TASKS_SET */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */
#define GPIOTE_TASKS_SET_TASKS_SET_Pos        ( 0UL )                                     /*!< Position of TASKS_SET field. */
#define GPIOTE_TASKS_SET_TASKS_SET_Msk        ( 0x1UL << GPIOTE_TASKS_SET_TASKS_SET_Pos ) /*!< Bit mask of TASKS_SET field. */
#define GPIOTE_TASKS_SET_TASKS_SET_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_TASKS_CLR */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Pos        ( 0UL )                                     /*!< Position of TASKS_CLR field. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Msk        ( 0x1UL << GPIOTE_TASKS_CLR_TASKS_CLR_Pos ) /*!< Bit mask of TASKS_CLR field. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_SUBSCRIBE_OUT */
/* Description: Description collection: Subscribe configuration for task OUT[n] */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_OUT_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_OUT_EN_Msk         ( 0x1UL << GPIOTE_SUBSCRIBE_OUT_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_OUT_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_OUT_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task OUT[n] will subscribe to */
#define GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_OUT_CHIDX_Msk      ( 0xFFUL << GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_SUBSCRIBE_SET */
/* Description: Description collection: Subscribe configuration for task SET[n] */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_SET_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_SET_EN_Msk         ( 0x1UL << GPIOTE_SUBSCRIBE_SET_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_SET_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_SET_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SET[n] will subscribe to */
#define GPIOTE_SUBSCRIBE_SET_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_SET_CHIDX_Msk      ( 0xFFUL << GPIOTE_SUBSCRIBE_SET_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

