FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: GPIOTE_SUBSCRIBE_CLR */
/* Description: Description collection: Subscribe configuration for task CLR[n] */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_CLR_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_CLR_EN_Msk         ( 0x1UL << GPIOTE_SUBSCRIBE_CLR_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_CLR_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_CLR_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CLR[n] will subscribe to */
#define GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_CLR_CHIDX_Msk      ( 0xFFUL << GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_EVENTS_IN */
/* Description: Description collection: Event generated from pin specified in CONFIG[n].PSEL */

/* Bit 0 : Event generated from pin specified in CONFIG[n].PSEL */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Pos             ( 0UL )                                     /*!< Position of EVENTS_IN field. */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Msk             ( 0x1UL << GPIOTE_EVENTS_IN_EVENTS_IN_Pos ) /*!< Bit mask of EVENTS_IN field. */
#define GPIOTE_EVENTS_IN_EVENTS_IN_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: GPIOTE_EVENTS_PORT */
/* Description: Event generated from multiple input GPIO pins with SENSE mechanism enabled */

/* Bit 0 : Event generated from multiple input GPIO pins with SENSE mechanism enabled */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Pos             ( 0UL )                                         /*!< Position of EVENTS_PORT field. */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Msk             ( 0x1UL << GPIOTE_EVENTS_PORT_EVENTS_PORT_Pos ) /*!< Bit mask of EVENTS_PORT field. */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: GPIOTE_PUBLISH_IN */
/* Description: Description collection: Publish configuration for event IN[n] */

/* Bit 31 :   */
#define GPIOTE_PUBLISH_IN_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define GPIOTE_PUBLISH_IN_EN_Msk         ( 0x1UL << GPIOTE_PUBLISH_IN_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_PUBLISH_IN_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define GPIOTE_PUBLISH_IN_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event IN[n] will publish to. */
#define GPIOTE_PUBLISH_IN_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define GPIOTE_PUBLISH_IN_CHIDX_Msk      ( 0xFFUL << GPIOTE_PUBLISH_IN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_PUBLISH_PORT */
/* Description: Publish configuration for event PORT */

/* Bit 31 :   */
#define GPIOTE_PUBLISH_PORT_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define GPIOTE_PUBLISH_PORT_EN_Msk         ( 0x1UL << GPIOTE_PUBLISH_PORT_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_PUBLISH_PORT_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define GPIOTE_PUBLISH_PORT_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event PORT will publish to. */
#define GPIOTE_PUBLISH_PORT_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define GPIOTE_PUBLISH_PORT_CHIDX_Msk      ( 0xFFUL << GPIOTE_PUBLISH_PORT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_INTENSET */
/* Description: Enable interrupt */

/* Bit 31 : Write '1' to enable interrupt for event PORT */
#define GPIOTE_INTENSET_PORT_Pos         ( 31UL )                              /*!< Position of PORT field. */
#define GPIOTE_INTENSET_PORT_Msk         ( 0x1UL << GPIOTE_INTENSET_PORT_Pos ) /*!< Bit mask of PORT field. */
#define GPIOTE_INTENSET_PORT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define GPIOTE_INTENSET_PORT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define GPIOTE_INTENSET_PORT_Set         ( 1UL )                               /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event IN[7] */
#define GPIOTE_INTENSET_IN7_Pos          ( 7UL )                              /*!< Position of IN7 field. */
#define GPIOTE_INTENSET_IN7_Msk          ( 0x1UL << GPIOTE_INTENSET_IN7_Pos ) /*!< Bit mask of IN7 field. */
#define GPIOTE_INTENSET_IN7_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN7_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN7_Set          ( 1UL )                              /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event IN[6] */
#define GPIOTE_INTENSET_IN6_Pos          ( 6UL )                              /*!< Position of IN6 field. */
#define GPIOTE_INTENSET_IN6_Msk          ( 0x1UL << GPIOTE_INTENSET_IN6_Pos ) /*!< Bit mask of IN6 field. */
#define GPIOTE_INTENSET_IN6_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN6_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN6_Set          ( 1UL )                              /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event IN[5] */
#define GPIOTE_INTENSET_IN5_Pos          ( 5UL )                              /*!< Position of IN5 field. */
#define GPIOTE_INTENSET_IN5_Msk          ( 0x1UL << GPIOTE_INTENSET_IN5_Pos ) /*!< Bit mask of IN5 field. */
#define GPIOTE_INTENSET_IN5_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN5_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN5_Set          ( 1UL )                              /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event IN[4] */
#define GPIOTE_INTENSET_IN4_Pos          ( 4UL )                              /*!< Position of IN4 field. */
#define GPIOTE_INTENSET_IN4_Msk          ( 0x1UL << GPIOTE_INTENSET_IN4_Pos ) /*!< Bit mask of IN4 field. */
#define GPIOTE_INTENSET_IN4_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN4_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN4_Set          ( 1UL )                              /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event IN[3] */
#define GPIOTE_INTENSET_IN3_Pos          ( 3UL )                              /*!< Position of IN3 field. */
#define GPIOTE_INTENSET_IN3_Msk          ( 0x1UL << GPIOTE_INTENSET_IN3_Pos ) /*!< Bit mask of IN3 field. */
#define GPIOTE_INTENSET_IN3_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN3_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN3_Set          ( 1UL )                              /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event IN[2] */
#define GPIOTE_INTENSET_IN2_Pos          ( 2UL )                              /*!< Position of IN2 field. */
#define GPIOTE_INTENSET_IN2_Msk          ( 0x1UL << GPIOTE_INTENSET_IN2_Pos ) /*!< Bit mask of IN2 field. */
#define GPIOTE_INTENSET_IN2_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN2_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN2_Set          ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event IN[1] */
#define GPIOTE_INTENSET_IN1_Pos          ( 1UL )                              /*!< Position of IN1 field. */
#define GPIOTE_INTENSET_IN1_Msk          ( 0x1UL << GPIOTE_INTENSET_IN1_Pos ) /*!< Bit mask of IN1 field. */
#define GPIOTE_INTENSET_IN1_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN1_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN1_Set          ( 1UL )                              /*!< Enable */

