FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Peripheral: I2S */
/* Description: Inter-IC Sound 0 */

/* Register: I2S_TASKS_START */
/* Description: Starts continuous I2S transfer. Also starts MCK generator when this is enabled */

/* Bit 0 : Starts continuous I2S transfer. Also starts MCK generator when this is enabled */
#define I2S_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define I2S_TASKS_START_TASKS_START_Msk        ( 0x1UL << I2S_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define I2S_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: I2S_TASKS_STOP */
/* Description: Stops I2S transfer and MCK generator. Triggering this task will cause the event STOPPED to be generated. */

/* Bit 0 : Stops I2S transfer and MCK generator. Triggering this task will cause the event STOPPED to be generated. */
#define I2S_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define I2S_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << I2S_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define I2S_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: I2S_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define I2S_SUBSCRIBE_START_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define I2S_SUBSCRIBE_START_EN_Msk         ( 0x1UL << I2S_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define I2S_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define I2S_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define I2S_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define I2S_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << I2S_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: I2S_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define I2S_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define I2S_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << I2S_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define I2S_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define I2S_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define I2S_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define I2S_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << I2S_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: I2S_EVENTS_RXPTRUPD */

/* Description: The RXD.PTR register has been copied to internal double-buffers.
 *    When the I2S module is started and RX is enabled, this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin. */

/* Bit 0 : The RXD.PTR register has been copied to internal double-buffers.
 *    When the I2S module is started and RX is enabled, this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin. */
#define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos             ( 0UL )                                              /*!< Position of EVENTS_RXPTRUPD field. */
#define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Msk             ( 0x1UL << I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos ) /*!< Bit mask of EVENTS_RXPTRUPD field. */
#define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: I2S_EVENTS_STOPPED */
/* Description: I2S transfer stopped. */

/* Bit 0 : I2S transfer stopped. */
#define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                            /*!< Position of EVENTS_STOPPED field. */
#define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << I2S_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define I2S_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: I2S_EVENTS_TXPTRUPD */

/* Description: The TDX.PTR register has been copied to internal double-buffers.
 *    When the I2S module is started and TX is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin. */

/* Bit 0 : The TDX.PTR register has been copied to internal double-buffers.
 *    When the I2S module is started and TX is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin. */
#define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos             ( 0UL )                                              /*!< Position of EVENTS_TXPTRUPD field. */
#define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Msk             ( 0x1UL << I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos ) /*!< Bit mask of EVENTS_TXPTRUPD field. */
#define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: I2S_EVENTS_FRAMESTART */
/* Description: Frame start event, generated on the active edge of LRCK */

/* Bit 0 : Frame start event, generated on the active edge of LRCK */
#define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Pos             ( 0UL )                                                  /*!< Position of EVENTS_FRAMESTART field. */
#define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Msk             ( 0x1UL << I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Pos ) /*!< Bit mask of EVENTS_FRAMESTART field. */
#define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Generated       ( 1UL )                                                  /*!< Event generated */

