FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: I2S_PUBLISH_RXPTRUPD */
/* Description: Publish configuration for event RXPTRUPD */

/* Bit 31 :   */
#define I2S_PUBLISH_RXPTRUPD_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define I2S_PUBLISH_RXPTRUPD_EN_Msk         ( 0x1UL << I2S_PUBLISH_RXPTRUPD_EN_Pos ) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_RXPTRUPD_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define I2S_PUBLISH_RXPTRUPD_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RXPTRUPD will publish to. */
#define I2S_PUBLISH_RXPTRUPD_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define I2S_PUBLISH_RXPTRUPD_CHIDX_Msk      ( 0xFFUL << I2S_PUBLISH_RXPTRUPD_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define I2S_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define I2S_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << I2S_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define I2S_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define I2S_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define I2S_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << I2S_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_TXPTRUPD */
/* Description: Publish configuration for event TXPTRUPD */

/* Bit 31 :   */
#define I2S_PUBLISH_TXPTRUPD_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define I2S_PUBLISH_TXPTRUPD_EN_Msk         ( 0x1UL << I2S_PUBLISH_TXPTRUPD_EN_Pos ) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_TXPTRUPD_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define I2S_PUBLISH_TXPTRUPD_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXPTRUPD will publish to. */
#define I2S_PUBLISH_TXPTRUPD_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define I2S_PUBLISH_TXPTRUPD_CHIDX_Msk      ( 0xFFUL << I2S_PUBLISH_TXPTRUPD_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: I2S_PUBLISH_FRAMESTART */
/* Description: Publish configuration for event FRAMESTART */

/* Bit 31 :   */
#define I2S_PUBLISH_FRAMESTART_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define I2S_PUBLISH_FRAMESTART_EN_Msk         ( 0x1UL << I2S_PUBLISH_FRAMESTART_EN_Pos ) /*!< Bit mask of EN field. */
#define I2S_PUBLISH_FRAMESTART_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define I2S_PUBLISH_FRAMESTART_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event FRAMESTART will publish to. */
#define I2S_PUBLISH_FRAMESTART_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define I2S_PUBLISH_FRAMESTART_CHIDX_Msk      ( 0xFFUL << I2S_PUBLISH_FRAMESTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: I2S_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 7 : Enable or disable interrupt for event FRAMESTART */
#define I2S_INTEN_FRAMESTART_Pos         ( 7UL )                               /*!< Position of FRAMESTART field. */
#define I2S_INTEN_FRAMESTART_Msk         ( 0x1UL << I2S_INTEN_FRAMESTART_Pos ) /*!< Bit mask of FRAMESTART field. */
#define I2S_INTEN_FRAMESTART_Disabled    ( 0UL )                               /*!< Disable */
#define I2S_INTEN_FRAMESTART_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event TXPTRUPD */
#define I2S_INTEN_TXPTRUPD_Pos           ( 5UL )                             /*!< Position of TXPTRUPD field. */
#define I2S_INTEN_TXPTRUPD_Msk           ( 0x1UL << I2S_INTEN_TXPTRUPD_Pos ) /*!< Bit mask of TXPTRUPD field. */
#define I2S_INTEN_TXPTRUPD_Disabled      ( 0UL )                             /*!< Disable */
#define I2S_INTEN_TXPTRUPD_Enabled       ( 1UL )                             /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event STOPPED */
#define I2S_INTEN_STOPPED_Pos            ( 2UL )                            /*!< Position of STOPPED field. */
#define I2S_INTEN_STOPPED_Msk            ( 0x1UL << I2S_INTEN_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define I2S_INTEN_STOPPED_Disabled       ( 0UL )                            /*!< Disable */
#define I2S_INTEN_STOPPED_Enabled        ( 1UL )                            /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event RXPTRUPD */
#define I2S_INTEN_RXPTRUPD_Pos           ( 1UL )                             /*!< Position of RXPTRUPD field. */
#define I2S_INTEN_RXPTRUPD_Msk           ( 0x1UL << I2S_INTEN_RXPTRUPD_Pos ) /*!< Bit mask of RXPTRUPD field. */
#define I2S_INTEN_RXPTRUPD_Disabled      ( 0UL )                             /*!< Disable */
#define I2S_INTEN_RXPTRUPD_Enabled       ( 1UL )                             /*!< Enable */

/* Register: I2S_INTENSET */
/* Description: Enable interrupt */

/* Bit 7 : Write '1' to enable interrupt for event FRAMESTART */
#define I2S_INTENSET_FRAMESTART_Pos         ( 7UL )                                  /*!< Position of FRAMESTART field. */
#define I2S_INTENSET_FRAMESTART_Msk         ( 0x1UL << I2S_INTENSET_FRAMESTART_Pos ) /*!< Bit mask of FRAMESTART field. */
#define I2S_INTENSET_FRAMESTART_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define I2S_INTENSET_FRAMESTART_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define I2S_INTENSET_FRAMESTART_Set         ( 1UL )                                  /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event TXPTRUPD */
#define I2S_INTENSET_TXPTRUPD_Pos           ( 5UL )                                /*!< Position of TXPTRUPD field. */
#define I2S_INTENSET_TXPTRUPD_Msk           ( 0x1UL << I2S_INTENSET_TXPTRUPD_Pos ) /*!< Bit mask of TXPTRUPD field. */
#define I2S_INTENSET_TXPTRUPD_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define I2S_INTENSET_TXPTRUPD_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define I2S_INTENSET_TXPTRUPD_Set           ( 1UL )                                /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event STOPPED */
#define I2S_INTENSET_STOPPED_Pos            ( 2UL )                               /*!< Position of STOPPED field. */
#define I2S_INTENSET_STOPPED_Msk            ( 0x1UL << I2S_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define I2S_INTENSET_STOPPED_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define I2S_INTENSET_STOPPED_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define I2S_INTENSET_STOPPED_Set            ( 1UL )                               /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event RXPTRUPD */
#define I2S_INTENSET_RXPTRUPD_Pos           ( 1UL )                                /*!< Position of RXPTRUPD field. */
#define I2S_INTENSET_RXPTRUPD_Msk           ( 0x1UL << I2S_INTENSET_RXPTRUPD_Pos ) /*!< Bit mask of RXPTRUPD field. */
#define I2S_INTENSET_RXPTRUPD_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define I2S_INTENSET_RXPTRUPD_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define I2S_INTENSET_RXPTRUPD_Set           ( 1UL )                                /*!< Enable */

/* Register: I2S_INTENCLR */
/* Description: Disable interrupt */

