FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event FRAMESTART */
#define I2S_INTENCLR_FRAMESTART_Pos         ( 7UL )                                  /*!< Position of FRAMESTART field. */
#define I2S_INTENCLR_FRAMESTART_Msk         ( 0x1UL << I2S_INTENCLR_FRAMESTART_Pos ) /*!< Bit mask of FRAMESTART field. */
#define I2S_INTENCLR_FRAMESTART_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define I2S_INTENCLR_FRAMESTART_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define I2S_INTENCLR_FRAMESTART_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event TXPTRUPD */
#define I2S_INTENCLR_TXPTRUPD_Pos           ( 5UL )                                /*!< Position of TXPTRUPD field. */
#define I2S_INTENCLR_TXPTRUPD_Msk           ( 0x1UL << I2S_INTENCLR_TXPTRUPD_Pos ) /*!< Bit mask of TXPTRUPD field. */
#define I2S_INTENCLR_TXPTRUPD_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define I2S_INTENCLR_TXPTRUPD_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define I2S_INTENCLR_TXPTRUPD_Clear         ( 1UL )                                /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event STOPPED */
#define I2S_INTENCLR_STOPPED_Pos            ( 2UL )                               /*!< Position of STOPPED field. */
#define I2S_INTENCLR_STOPPED_Msk            ( 0x1UL << I2S_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define I2S_INTENCLR_STOPPED_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define I2S_INTENCLR_STOPPED_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define I2S_INTENCLR_STOPPED_Clear          ( 1UL )                               /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event RXPTRUPD */
#define I2S_INTENCLR_RXPTRUPD_Pos           ( 1UL )                                /*!< Position of RXPTRUPD field. */
#define I2S_INTENCLR_RXPTRUPD_Msk           ( 0x1UL << I2S_INTENCLR_RXPTRUPD_Pos ) /*!< Bit mask of RXPTRUPD field. */
#define I2S_INTENCLR_RXPTRUPD_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define I2S_INTENCLR_RXPTRUPD_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define I2S_INTENCLR_RXPTRUPD_Clear         ( 1UL )                                /*!< Disable */

/* Register: I2S_ENABLE */
/* Description: Enable I2S module */

/* Bit 0 : Enable I2S module */
#define I2S_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define I2S_ENABLE_ENABLE_Msk         ( 0x1UL << I2S_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define I2S_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable */
#define I2S_ENABLE_ENABLE_Enabled     ( 1UL )                            /*!< Enable */

/* Register: I2S_CONFIG_MODE */
/* Description: I2S mode */

/* Bit 0 : I2S mode */
#define I2S_CONFIG_MODE_MODE_Pos       ( 0UL )                               /*!< Position of MODE field. */
#define I2S_CONFIG_MODE_MODE_Msk       ( 0x1UL << I2S_CONFIG_MODE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define I2S_CONFIG_MODE_MODE_Master    ( 0UL )                               /*!< Master mode. SCK and LRCK generated from internal master clcok (MCK) and output on pins defined by PSEL.xxx. */
#define I2S_CONFIG_MODE_MODE_Slave     ( 1UL )                               /*!< Slave mode. SCK and LRCK generated by external master and received on pins defined by PSEL.xxx */

/* Register: I2S_CONFIG_RXEN */
/* Description: Reception (RX) enable */

/* Bit 0 : Reception (RX) enable */
#define I2S_CONFIG_RXEN_RXEN_Pos         ( 0UL )                               /*!< Position of RXEN field. */
#define I2S_CONFIG_RXEN_RXEN_Msk         ( 0x1UL << I2S_CONFIG_RXEN_RXEN_Pos ) /*!< Bit mask of RXEN field. */
#define I2S_CONFIG_RXEN_RXEN_Disabled    ( 0UL )                               /*!< Reception disabled and now data will be written to the RXD.PTR address. */
#define I2S_CONFIG_RXEN_RXEN_Enabled     ( 1UL )                               /*!< Reception enabled. */

/* Register: I2S_CONFIG_TXEN */
/* Description: Transmission (TX) enable */

/* Bit 0 : Transmission (TX) enable */
#define I2S_CONFIG_TXEN_TXEN_Pos         ( 0UL )                               /*!< Position of TXEN field. */
#define I2S_CONFIG_TXEN_TXEN_Msk         ( 0x1UL << I2S_CONFIG_TXEN_TXEN_Pos ) /*!< Bit mask of TXEN field. */
#define I2S_CONFIG_TXEN_TXEN_Disabled    ( 0UL )                               /*!< Transmission disabled and now data will be read from the RXD.TXD address. */
#define I2S_CONFIG_TXEN_TXEN_Enabled     ( 1UL )                               /*!< Transmission enabled. */

/* Register: I2S_CONFIG_MCKEN */
/* Description: Master clock generator enable */

/* Bit 0 : Master clock generator enable */
#define I2S_CONFIG_MCKEN_MCKEN_Pos         ( 0UL )                                 /*!< Position of MCKEN field. */
#define I2S_CONFIG_MCKEN_MCKEN_Msk         ( 0x1UL << I2S_CONFIG_MCKEN_MCKEN_Pos ) /*!< Bit mask of MCKEN field. */
#define I2S_CONFIG_MCKEN_MCKEN_Disabled    ( 0UL )                                 /*!< Master clock generator disabled and PSEL.MCK not connected(available as GPIO). */
#define I2S_CONFIG_MCKEN_MCKEN_Enabled     ( 1UL )                                 /*!< Master clock generator running and MCK output on PSEL.MCK. */

/* Register: I2S_CONFIG_MCKFREQ */
/* Description: I2S clock generator control */

/* Bits 31..0 : I2S MCK frequency configuration NOTE: Enumerations are deprecated, use MCKFREQ equation. NOTE: The 12 least significant bits of the register are ignored and shall be set to zero. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_Pos          ( 0UL )                                            /*!< Position of MCKFREQ field. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_Msk          ( 0xFFFFFFFFUL << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos ) /*!< Bit mask of MCKFREQ field. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV125    ( 0x020C0000UL )                                   /*!< 32 MHz / 125 = 0.256 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV63     ( 0x04100000UL )                                   /*!< 32 MHz / 63 = 0.5079365 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV42     ( 0x06000000UL )                                   /*!< 32 MHz / 42 = 0.7619048 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV32     ( 0x08000000UL )                                   /*!< 32 MHz / 32 = 1.0 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV31     ( 0x08400000UL )                                   /*!< 32 MHz / 31 = 1.0322581 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV30     ( 0x08800000UL )                                   /*!< 32 MHz / 30 = 1.0666667 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV23     ( 0x0B000000UL )                                   /*!< 32 MHz / 23 = 1.3913043 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV21     ( 0x0C000000UL )                                   /*!< 32 MHz / 21 = 1.5238095 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16     ( 0x10000000UL )                                   /*!< 32 MHz / 16 = 2.0 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV15     ( 0x11000000UL )                                   /*!< 32 MHz / 15 = 2.1333333 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV11     ( 0x16000000UL )                                   /*!< 32 MHz / 11 = 2.9090909 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV10     ( 0x18000000UL )                                   /*!< 32 MHz / 10 = 3.2 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV8      ( 0x20000000UL )                                   /*!< 32 MHz / 8 = 4.0 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV6      ( 0x28000000UL )                                   /*!< 32 MHz / 6 = 5.3333333 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV5      ( 0x30000000UL )                                   /*!< 32 MHz / 5 = 6.4 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV4      ( 0x40000000UL )                                   /*!< 32 MHz / 4 = 8.0 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV3      ( 0x50000000UL )                                   /*!< 32 MHz / 3 = 10.6666667 MHz Deprecated, use MCKFREQ equation. */
#define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV2      ( 0x80000000UL )                                   /*!< 32 MHz / 2 = 16.0 MHz Deprecated, use MCKFREQ equation. */

/* Register: I2S_CONFIG_RATIO */
/* Description: MCK / LRCK ratio */

/* Bits 3..0 : MCK / LRCK ratio */
#define I2S_CONFIG_RATIO_RATIO_Pos     ( 0UL )                                 /*!< Position of RATIO field. */
#define I2S_CONFIG_RATIO_RATIO_Msk     ( 0xFUL << I2S_CONFIG_RATIO_RATIO_Pos ) /*!< Bit mask of RATIO field. */
#define I2S_CONFIG_RATIO_RATIO_32X     ( 0UL )                                 /*!< LRCK = MCK / 32 */
#define I2S_CONFIG_RATIO_RATIO_48X     ( 1UL )                                 /*!< LRCK = MCK / 48 */
#define I2S_CONFIG_RATIO_RATIO_64X     ( 2UL )                                 /*!< LRCK = MCK / 64 */
#define I2S_CONFIG_RATIO_RATIO_96X     ( 3UL )                                 /*!< LRCK = MCK / 96 */
#define I2S_CONFIG_RATIO_RATIO_128X    ( 4UL )                                 /*!< LRCK = MCK / 128 */
#define I2S_CONFIG_RATIO_RATIO_192X    ( 5UL )                                 /*!< LRCK = MCK / 192 */
#define I2S_CONFIG_RATIO_RATIO_256X    ( 6UL )                                 /*!< LRCK = MCK / 256 */
#define I2S_CONFIG_RATIO_RATIO_384X    ( 7UL )                                 /*!< LRCK = MCK / 384 */
#define I2S_CONFIG_RATIO_RATIO_512X    ( 8UL )                                 /*!< LRCK = MCK / 512 */

/* Register: I2S_CONFIG_SWIDTH */
/* Description: Sample width */

