FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 2..0 : Sample and half-frame width */
#define I2S_CONFIG_SWIDTH_SWIDTH_Pos          ( 0UL )                                   /*!< Position of SWIDTH field. */
#define I2S_CONFIG_SWIDTH_SWIDTH_Msk          ( 0x7UL << I2S_CONFIG_SWIDTH_SWIDTH_Pos ) /*!< Bit mask of SWIDTH field. */
#define I2S_CONFIG_SWIDTH_SWIDTH_8Bit         ( 0UL )                                   /*!< 8 bit sample. */
#define I2S_CONFIG_SWIDTH_SWIDTH_16Bit        ( 1UL )                                   /*!< 16 bit sample. */
#define I2S_CONFIG_SWIDTH_SWIDTH_24Bit        ( 2UL )                                   /*!< 24 bit sample. */
#define I2S_CONFIG_SWIDTH_SWIDTH_32Bit        ( 3UL )                                   /*!< 32 bit sample. */
#define I2S_CONFIG_SWIDTH_SWIDTH_8BitIn16     ( 4UL )                                   /*!< 8 bit sample in a 16-bit half-frame. */
#define I2S_CONFIG_SWIDTH_SWIDTH_8BitIn32     ( 5UL )                                   /*!< 8 bit sample in a 32-bit half-frame. */
#define I2S_CONFIG_SWIDTH_SWIDTH_16BitIn32    ( 6UL )                                   /*!< 16 bit sample in a 32-bit half-frame. */
#define I2S_CONFIG_SWIDTH_SWIDTH_24BitIn32    ( 7UL )                                   /*!< 24 bit sample in a 32-bit half-frame. */

/* Register: I2S_CONFIG_ALIGN */
/* Description: Alignment of sample within a frame */

/* Bit 0 : Alignment of sample within a frame */
#define I2S_CONFIG_ALIGN_ALIGN_Pos      ( 0UL )                                 /*!< Position of ALIGN field. */
#define I2S_CONFIG_ALIGN_ALIGN_Msk      ( 0x1UL << I2S_CONFIG_ALIGN_ALIGN_Pos ) /*!< Bit mask of ALIGN field. */
#define I2S_CONFIG_ALIGN_ALIGN_Left     ( 0UL )                                 /*!< Left-aligned. */
#define I2S_CONFIG_ALIGN_ALIGN_Right    ( 1UL )                                 /*!< Right-aligned. */

/* Register: I2S_CONFIG_FORMAT */
/* Description: Frame format */

/* Bit 0 : Frame format */
#define I2S_CONFIG_FORMAT_FORMAT_Pos        ( 0UL )                                   /*!< Position of FORMAT field. */
#define I2S_CONFIG_FORMAT_FORMAT_Msk        ( 0x1UL << I2S_CONFIG_FORMAT_FORMAT_Pos ) /*!< Bit mask of FORMAT field. */
#define I2S_CONFIG_FORMAT_FORMAT_I2S        ( 0UL )                                   /*!< Original I2S format. */
#define I2S_CONFIG_FORMAT_FORMAT_Aligned    ( 1UL )                                   /*!< Alternate (left- or right-aligned) format. */

/* Register: I2S_CONFIG_CHANNELS */
/* Description: Enable channels */

/* Bits 1..0 : Enable channels */
#define I2S_CONFIG_CHANNELS_CHANNELS_Pos       ( 0UL )                                       /*!< Position of CHANNELS field. */
#define I2S_CONFIG_CHANNELS_CHANNELS_Msk       ( 0x3UL << I2S_CONFIG_CHANNELS_CHANNELS_Pos ) /*!< Bit mask of CHANNELS field. */
#define I2S_CONFIG_CHANNELS_CHANNELS_Stereo    ( 0UL )                                       /*!< Stereo. */
#define I2S_CONFIG_CHANNELS_CHANNELS_Left      ( 1UL )                                       /*!< Left only. */
#define I2S_CONFIG_CHANNELS_CHANNELS_Right     ( 2UL )                                       /*!< Right only. */

/* Register: I2S_CONFIG_CLKCONFIG */
/* Description: Clock source selection for the I2S module */

/* Bit 8 : Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no effect. */
#define I2S_CONFIG_CLKCONFIG_BYPASS_Pos        ( 8UL )                                      /*!< Position of BYPASS field. */
#define I2S_CONFIG_CLKCONFIG_BYPASS_Msk        ( 0x1UL << I2S_CONFIG_CLKCONFIG_BYPASS_Pos ) /*!< Bit mask of BYPASS field. */
#define I2S_CONFIG_CLKCONFIG_BYPASS_Disable    ( 0UL )                                      /*!< Disable bypass */
#define I2S_CONFIG_CLKCONFIG_BYPASS_Enable     ( 1UL )                                      /*!< Enable bypass */

/* Bit 0 : Clock source selection */
#define I2S_CONFIG_CLKCONFIG_CLKSRC_Pos        ( 0UL )                                      /*!< Position of CLKSRC field. */
#define I2S_CONFIG_CLKCONFIG_CLKSRC_Msk        ( 0x1UL << I2S_CONFIG_CLKCONFIG_CLKSRC_Pos ) /*!< Bit mask of CLKSRC field. */
#define I2S_CONFIG_CLKCONFIG_CLKSRC_PCLK32M    ( 0UL )                                      /*!< 32MHz peripheral clock */
#define I2S_CONFIG_CLKCONFIG_CLKSRC_ACLK       ( 1UL )                                      /*!< Audio PLL clock */

/* Register: I2S_RXD_PTR */
/* Description: Receive buffer RAM start address. */

/* Bits 31..0 : Receive buffer Data RAM start address. When receiving, words containing samples will be written to this address. This address is a word aligned Data RAM address. */
#define I2S_RXD_PTR_PTR_Pos    ( 0UL )                                 /*!< Position of PTR field. */
#define I2S_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << I2S_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: I2S_TXD_PTR */
/* Description: Transmit buffer RAM start address */

/* Bits 31..0 : Transmit buffer Data RAM start address. When transmitting, words containing samples will be fetched from this address. This address is a word aligned Data RAM address. */
#define I2S_TXD_PTR_PTR_Pos    ( 0UL )                                 /*!< Position of PTR field. */
#define I2S_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << I2S_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: I2S_RXTXD_MAXCNT */
/* Description: Size of RXD and TXD buffers */

/* Bits 13..0 : Size of RXD and TXD buffers in number of 32 bit words */
#define I2S_RXTXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                     /*!< Position of MAXCNT field. */
#define I2S_RXTXD_MAXCNT_MAXCNT_Msk    ( 0x3FFFUL << I2S_RXTXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: I2S_PSEL_MCK */
/* Description: Pin select for MCK signal */

/* Bit 31 : Connection */
#define I2S_PSEL_MCK_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define I2S_PSEL_MCK_CONNECT_Msk             ( 0x1UL << I2S_PSEL_MCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define I2S_PSEL_MCK_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define I2S_PSEL_MCK_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bit 5 : Port number */
#define I2S_PSEL_MCK_PORT_Pos                ( 5UL )                            /*!< Position of PORT field. */
#define I2S_PSEL_MCK_PORT_Msk                ( 0x1UL << I2S_PSEL_MCK_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define I2S_PSEL_MCK_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define I2S_PSEL_MCK_PIN_Msk                 ( 0x1FUL << I2S_PSEL_MCK_PIN_Pos ) /*!< Bit mask of PIN field. */

