FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: I2S_PSEL_SCK */
/* Description: Pin select for SCK signal */

/* Bit 31 : Connection */
#define I2S_PSEL_SCK_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define I2S_PSEL_SCK_CONNECT_Msk             ( 0x1UL << I2S_PSEL_SCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define I2S_PSEL_SCK_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define I2S_PSEL_SCK_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bit 5 : Port number */
#define I2S_PSEL_SCK_PORT_Pos                ( 5UL )                            /*!< Position of PORT field. */
#define I2S_PSEL_SCK_PORT_Msk                ( 0x1UL << I2S_PSEL_SCK_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define I2S_PSEL_SCK_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define I2S_PSEL_SCK_PIN_Msk                 ( 0x1FUL << I2S_PSEL_SCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: I2S_PSEL_LRCK */
/* Description: Pin select for LRCK signal */

/* Bit 31 : Connection */
#define I2S_PSEL_LRCK_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define I2S_PSEL_LRCK_CONNECT_Msk             ( 0x1UL << I2S_PSEL_LRCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define I2S_PSEL_LRCK_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define I2S_PSEL_LRCK_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define I2S_PSEL_LRCK_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define I2S_PSEL_LRCK_PORT_Msk                ( 0x1UL << I2S_PSEL_LRCK_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define I2S_PSEL_LRCK_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define I2S_PSEL_LRCK_PIN_Msk                 ( 0x1FUL << I2S_PSEL_LRCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: I2S_PSEL_SDIN */
/* Description: Pin select for SDIN signal */

/* Bit 31 : Connection */
#define I2S_PSEL_SDIN_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define I2S_PSEL_SDIN_CONNECT_Msk             ( 0x1UL << I2S_PSEL_SDIN_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define I2S_PSEL_SDIN_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define I2S_PSEL_SDIN_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define I2S_PSEL_SDIN_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define I2S_PSEL_SDIN_PORT_Msk                ( 0x1UL << I2S_PSEL_SDIN_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define I2S_PSEL_SDIN_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define I2S_PSEL_SDIN_PIN_Msk                 ( 0x1FUL << I2S_PSEL_SDIN_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: I2S_PSEL_SDOUT */
/* Description: Pin select for SDOUT signal */

/* Bit 31 : Connection */
#define I2S_PSEL_SDOUT_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define I2S_PSEL_SDOUT_CONNECT_Msk             ( 0x1UL << I2S_PSEL_SDOUT_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define I2S_PSEL_SDOUT_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define I2S_PSEL_SDOUT_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bit 5 : Port number */
#define I2S_PSEL_SDOUT_PORT_Pos                ( 5UL )                              /*!< Position of PORT field. */
#define I2S_PSEL_SDOUT_PORT_Msk                ( 0x1UL << I2S_PSEL_SDOUT_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define I2S_PSEL_SDOUT_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define I2S_PSEL_SDOUT_PIN_Msk                 ( 0x1FUL << I2S_PSEL_SDOUT_PIN_Pos ) /*!< Bit mask of PIN field. */


/* Peripheral: IPC */
/* Description: Interprocessor communication 0 */

/* Register: IPC_TASKS_SEND */
/* Description: Description collection: Trigger events on IPC channel enabled in SEND_CNF[n] */

/* Bit 0 : Trigger events on IPC channel enabled in SEND_CNF[n] */
#define IPC_TASKS_SEND_TASKS_SEND_Pos        ( 0UL )                                    /*!< Position of TASKS_SEND field. */
#define IPC_TASKS_SEND_TASKS_SEND_Msk        ( 0x1UL << IPC_TASKS_SEND_TASKS_SEND_Pos ) /*!< Bit mask of TASKS_SEND field. */
#define IPC_TASKS_SEND_TASKS_SEND_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: IPC_SUBSCRIBE_SEND */
/* Description: Description collection: Subscribe configuration for task SEND[n] */

/* Bit 31 :   */
#define IPC_SUBSCRIBE_SEND_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define IPC_SUBSCRIBE_SEND_EN_Msk         ( 0x1UL << IPC_SUBSCRIBE_SEND_EN_Pos ) /*!< Bit mask of EN field. */
#define IPC_SUBSCRIBE_SEND_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define IPC_SUBSCRIBE_SEND_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SEND[n] will subscribe to */
#define IPC_SUBSCRIBE_SEND_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define IPC_SUBSCRIBE_SEND_CHIDX_Msk      ( 0xFFUL << IPC_SUBSCRIBE_SEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: IPC_EVENTS_RECEIVE */
/* Description: Description collection: Event received on one or more of the enabled IPC channels in RECEIVE_CNF[n] */

/* Bit 0 : Event received on one or more of the enabled IPC channels in RECEIVE_CNF[n] */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos             ( 0UL )                                            /*!< Position of EVENTS_RECEIVE field. */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Msk             ( 0x1UL << IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos ) /*!< Bit mask of EVENTS_RECEIVE field. */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: IPC_PUBLISH_RECEIVE */
/* Description: Description collection: Publish configuration for event RECEIVE[n] */

/* Bit 31 :   */
#define IPC_PUBLISH_RECEIVE_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define IPC_PUBLISH_RECEIVE_EN_Msk         ( 0x1UL << IPC_PUBLISH_RECEIVE_EN_Pos ) /*!< Bit mask of EN field. */
#define IPC_PUBLISH_RECEIVE_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define IPC_PUBLISH_RECEIVE_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RECEIVE[n] will publish to. */
#define IPC_PUBLISH_RECEIVE_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define IPC_PUBLISH_RECEIVE_CHIDX_Msk      ( 0xFFUL << IPC_PUBLISH_RECEIVE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: IPC_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 15 : Enable or disable interrupt for event RECEIVE[15] */
#define IPC_INTEN_RECEIVE15_Pos         ( 15UL )                             /*!< Position of RECEIVE15 field. */
#define IPC_INTEN_RECEIVE15_Msk         ( 0x1UL << IPC_INTEN_RECEIVE15_Pos ) /*!< Bit mask of RECEIVE15 field. */
#define IPC_INTEN_RECEIVE15_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE15_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event RECEIVE[14] */
#define IPC_INTEN_RECEIVE14_Pos         ( 14UL )                             /*!< Position of RECEIVE14 field. */
#define IPC_INTEN_RECEIVE14_Msk         ( 0x1UL << IPC_INTEN_RECEIVE14_Pos ) /*!< Bit mask of RECEIVE14 field. */
#define IPC_INTEN_RECEIVE14_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE14_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event RECEIVE[13] */
#define IPC_INTEN_RECEIVE13_Pos         ( 13UL )                             /*!< Position of RECEIVE13 field. */
#define IPC_INTEN_RECEIVE13_Msk         ( 0x1UL << IPC_INTEN_RECEIVE13_Pos ) /*!< Bit mask of RECEIVE13 field. */
#define IPC_INTEN_RECEIVE13_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE13_Enabled     ( 1UL )                              /*!< Enable */

