FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 12 : Enable or disable interrupt for event RECEIVE[12] */
#define IPC_INTEN_RECEIVE12_Pos         ( 12UL )                             /*!< Position of RECEIVE12 field. */
#define IPC_INTEN_RECEIVE12_Msk         ( 0x1UL << IPC_INTEN_RECEIVE12_Pos ) /*!< Bit mask of RECEIVE12 field. */
#define IPC_INTEN_RECEIVE12_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE12_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 11 : Enable or disable interrupt for event RECEIVE[11] */
#define IPC_INTEN_RECEIVE11_Pos         ( 11UL )                             /*!< Position of RECEIVE11 field. */
#define IPC_INTEN_RECEIVE11_Msk         ( 0x1UL << IPC_INTEN_RECEIVE11_Pos ) /*!< Bit mask of RECEIVE11 field. */
#define IPC_INTEN_RECEIVE11_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE11_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event RECEIVE[10] */
#define IPC_INTEN_RECEIVE10_Pos         ( 10UL )                             /*!< Position of RECEIVE10 field. */
#define IPC_INTEN_RECEIVE10_Msk         ( 0x1UL << IPC_INTEN_RECEIVE10_Pos ) /*!< Bit mask of RECEIVE10 field. */
#define IPC_INTEN_RECEIVE10_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE10_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event RECEIVE[9] */
#define IPC_INTEN_RECEIVE9_Pos          ( 9UL )                             /*!< Position of RECEIVE9 field. */
#define IPC_INTEN_RECEIVE9_Msk          ( 0x1UL << IPC_INTEN_RECEIVE9_Pos ) /*!< Bit mask of RECEIVE9 field. */
#define IPC_INTEN_RECEIVE9_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE9_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event RECEIVE[8] */
#define IPC_INTEN_RECEIVE8_Pos          ( 8UL )                             /*!< Position of RECEIVE8 field. */
#define IPC_INTEN_RECEIVE8_Msk          ( 0x1UL << IPC_INTEN_RECEIVE8_Pos ) /*!< Bit mask of RECEIVE8 field. */
#define IPC_INTEN_RECEIVE8_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE8_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event RECEIVE[7] */
#define IPC_INTEN_RECEIVE7_Pos          ( 7UL )                             /*!< Position of RECEIVE7 field. */
#define IPC_INTEN_RECEIVE7_Msk          ( 0x1UL << IPC_INTEN_RECEIVE7_Pos ) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTEN_RECEIVE7_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE7_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event RECEIVE[6] */
#define IPC_INTEN_RECEIVE6_Pos          ( 6UL )                             /*!< Position of RECEIVE6 field. */
#define IPC_INTEN_RECEIVE6_Msk          ( 0x1UL << IPC_INTEN_RECEIVE6_Pos ) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTEN_RECEIVE6_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE6_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
#define IPC_INTEN_RECEIVE5_Pos          ( 5UL )                             /*!< Position of RECEIVE5 field. */
#define IPC_INTEN_RECEIVE5_Msk          ( 0x1UL << IPC_INTEN_RECEIVE5_Pos ) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTEN_RECEIVE5_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE5_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
#define IPC_INTEN_RECEIVE4_Pos          ( 4UL )                             /*!< Position of RECEIVE4 field. */
#define IPC_INTEN_RECEIVE4_Msk          ( 0x1UL << IPC_INTEN_RECEIVE4_Pos ) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTEN_RECEIVE4_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE4_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
#define IPC_INTEN_RECEIVE3_Pos          ( 3UL )                             /*!< Position of RECEIVE3 field. */
#define IPC_INTEN_RECEIVE3_Msk          ( 0x1UL << IPC_INTEN_RECEIVE3_Pos ) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTEN_RECEIVE3_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE3_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
#define IPC_INTEN_RECEIVE2_Pos          ( 2UL )                             /*!< Position of RECEIVE2 field. */
#define IPC_INTEN_RECEIVE2_Msk          ( 0x1UL << IPC_INTEN_RECEIVE2_Pos ) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTEN_RECEIVE2_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE2_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
#define IPC_INTEN_RECEIVE1_Pos          ( 1UL )                             /*!< Position of RECEIVE1 field. */
#define IPC_INTEN_RECEIVE1_Msk          ( 0x1UL << IPC_INTEN_RECEIVE1_Pos ) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTEN_RECEIVE1_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE1_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
#define IPC_INTEN_RECEIVE0_Pos          ( 0UL )                             /*!< Position of RECEIVE0 field. */
#define IPC_INTEN_RECEIVE0_Msk          ( 0x1UL << IPC_INTEN_RECEIVE0_Pos ) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTEN_RECEIVE0_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE0_Enabled      ( 1UL )                             /*!< Enable */

/* Register: IPC_INTENSET */
/* Description: Enable interrupt */

/* Bit 15 : Write '1' to enable interrupt for event RECEIVE[15] */
#define IPC_INTENSET_RECEIVE15_Pos         ( 15UL )                                /*!< Position of RECEIVE15 field. */
#define IPC_INTENSET_RECEIVE15_Msk         ( 0x1UL << IPC_INTENSET_RECEIVE15_Pos ) /*!< Bit mask of RECEIVE15 field. */
#define IPC_INTENSET_RECEIVE15_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE15_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE15_Set         ( 1UL )                                 /*!< Enable */

