FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 14 : Write '1' to enable interrupt for event RECEIVE[14] */
#define IPC_INTENSET_RECEIVE14_Pos         ( 14UL )                                /*!< Position of RECEIVE14 field. */
#define IPC_INTENSET_RECEIVE14_Msk         ( 0x1UL << IPC_INTENSET_RECEIVE14_Pos ) /*!< Bit mask of RECEIVE14 field. */
#define IPC_INTENSET_RECEIVE14_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE14_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE14_Set         ( 1UL )                                 /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event RECEIVE[13] */
#define IPC_INTENSET_RECEIVE13_Pos         ( 13UL )                                /*!< Position of RECEIVE13 field. */
#define IPC_INTENSET_RECEIVE13_Msk         ( 0x1UL << IPC_INTENSET_RECEIVE13_Pos ) /*!< Bit mask of RECEIVE13 field. */
#define IPC_INTENSET_RECEIVE13_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE13_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE13_Set         ( 1UL )                                 /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event RECEIVE[12] */
#define IPC_INTENSET_RECEIVE12_Pos         ( 12UL )                                /*!< Position of RECEIVE12 field. */
#define IPC_INTENSET_RECEIVE12_Msk         ( 0x1UL << IPC_INTENSET_RECEIVE12_Pos ) /*!< Bit mask of RECEIVE12 field. */
#define IPC_INTENSET_RECEIVE12_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE12_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE12_Set         ( 1UL )                                 /*!< Enable */

/* Bit 11 : Write '1' to enable interrupt for event RECEIVE[11] */
#define IPC_INTENSET_RECEIVE11_Pos         ( 11UL )                                /*!< Position of RECEIVE11 field. */
#define IPC_INTENSET_RECEIVE11_Msk         ( 0x1UL << IPC_INTENSET_RECEIVE11_Pos ) /*!< Bit mask of RECEIVE11 field. */
#define IPC_INTENSET_RECEIVE11_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE11_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE11_Set         ( 1UL )                                 /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event RECEIVE[10] */
#define IPC_INTENSET_RECEIVE10_Pos         ( 10UL )                                /*!< Position of RECEIVE10 field. */
#define IPC_INTENSET_RECEIVE10_Msk         ( 0x1UL << IPC_INTENSET_RECEIVE10_Pos ) /*!< Bit mask of RECEIVE10 field. */
#define IPC_INTENSET_RECEIVE10_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE10_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE10_Set         ( 1UL )                                 /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event RECEIVE[9] */
#define IPC_INTENSET_RECEIVE9_Pos          ( 9UL )                                /*!< Position of RECEIVE9 field. */
#define IPC_INTENSET_RECEIVE9_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE9_Pos ) /*!< Bit mask of RECEIVE9 field. */
#define IPC_INTENSET_RECEIVE9_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE9_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE9_Set          ( 1UL )                                /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event RECEIVE[8] */
#define IPC_INTENSET_RECEIVE8_Pos          ( 8UL )                                /*!< Position of RECEIVE8 field. */
#define IPC_INTENSET_RECEIVE8_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE8_Pos ) /*!< Bit mask of RECEIVE8 field. */
#define IPC_INTENSET_RECEIVE8_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE8_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE8_Set          ( 1UL )                                /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event RECEIVE[7] */
#define IPC_INTENSET_RECEIVE7_Pos          ( 7UL )                                /*!< Position of RECEIVE7 field. */
#define IPC_INTENSET_RECEIVE7_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE7_Pos ) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTENSET_RECEIVE7_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE7_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE7_Set          ( 1UL )                                /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event RECEIVE[6] */
#define IPC_INTENSET_RECEIVE6_Pos          ( 6UL )                                /*!< Position of RECEIVE6 field. */
#define IPC_INTENSET_RECEIVE6_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE6_Pos ) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTENSET_RECEIVE6_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE6_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE6_Set          ( 1UL )                                /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event RECEIVE[5] */
#define IPC_INTENSET_RECEIVE5_Pos          ( 5UL )                                /*!< Position of RECEIVE5 field. */
#define IPC_INTENSET_RECEIVE5_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE5_Pos ) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTENSET_RECEIVE5_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE5_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE5_Set          ( 1UL )                                /*!< Enable */

