FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 4 : Write '1' to enable interrupt for event RECEIVE[4] */
#define IPC_INTENSET_RECEIVE4_Pos          ( 4UL )                                /*!< Position of RECEIVE4 field. */
#define IPC_INTENSET_RECEIVE4_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE4_Pos ) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTENSET_RECEIVE4_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE4_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE4_Set          ( 1UL )                                /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event RECEIVE[3] */
#define IPC_INTENSET_RECEIVE3_Pos          ( 3UL )                                /*!< Position of RECEIVE3 field. */
#define IPC_INTENSET_RECEIVE3_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE3_Pos ) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTENSET_RECEIVE3_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE3_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE3_Set          ( 1UL )                                /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event RECEIVE[2] */
#define IPC_INTENSET_RECEIVE2_Pos          ( 2UL )                                /*!< Position of RECEIVE2 field. */
#define IPC_INTENSET_RECEIVE2_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE2_Pos ) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTENSET_RECEIVE2_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE2_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE2_Set          ( 1UL )                                /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event RECEIVE[1] */
#define IPC_INTENSET_RECEIVE1_Pos          ( 1UL )                                /*!< Position of RECEIVE1 field. */
#define IPC_INTENSET_RECEIVE1_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE1_Pos ) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTENSET_RECEIVE1_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE1_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE1_Set          ( 1UL )                                /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event RECEIVE[0] */
#define IPC_INTENSET_RECEIVE0_Pos          ( 0UL )                                /*!< Position of RECEIVE0 field. */
#define IPC_INTENSET_RECEIVE0_Msk          ( 0x1UL << IPC_INTENSET_RECEIVE0_Pos ) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTENSET_RECEIVE0_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE0_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE0_Set          ( 1UL )                                /*!< Enable */

/* Register: IPC_INTENCLR */
/* Description: Disable interrupt */

/* Bit 15 : Write '1' to disable interrupt for event RECEIVE[15] */
#define IPC_INTENCLR_RECEIVE15_Pos         ( 15UL )                                /*!< Position of RECEIVE15 field. */
#define IPC_INTENCLR_RECEIVE15_Msk         ( 0x1UL << IPC_INTENCLR_RECEIVE15_Pos ) /*!< Bit mask of RECEIVE15 field. */
#define IPC_INTENCLR_RECEIVE15_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENCLR_RECEIVE15_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENCLR_RECEIVE15_Clear       ( 1UL )                                 /*!< Disable */

/* Bit 14 : Write '1' to disable interrupt for event RECEIVE[14] */
#define IPC_INTENCLR_RECEIVE14_Pos         ( 14UL )                                /*!< Position of RECEIVE14 field. */
#define IPC_INTENCLR_RECEIVE14_Msk         ( 0x1UL << IPC_INTENCLR_RECEIVE14_Pos ) /*!< Bit mask of RECEIVE14 field. */
#define IPC_INTENCLR_RECEIVE14_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENCLR_RECEIVE14_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENCLR_RECEIVE14_Clear       ( 1UL )                                 /*!< Disable */

/* Bit 13 : Write '1' to disable interrupt for event RECEIVE[13] */
#define IPC_INTENCLR_RECEIVE13_Pos         ( 13UL )                                /*!< Position of RECEIVE13 field. */
#define IPC_INTENCLR_RECEIVE13_Msk         ( 0x1UL << IPC_INTENCLR_RECEIVE13_Pos ) /*!< Bit mask of RECEIVE13 field. */
#define IPC_INTENCLR_RECEIVE13_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENCLR_RECEIVE13_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENCLR_RECEIVE13_Clear       ( 1UL )                                 /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event RECEIVE[12] */
#define IPC_INTENCLR_RECEIVE12_Pos         ( 12UL )                                /*!< Position of RECEIVE12 field. */
#define IPC_INTENCLR_RECEIVE12_Msk         ( 0x1UL << IPC_INTENCLR_RECEIVE12_Pos ) /*!< Bit mask of RECEIVE12 field. */
#define IPC_INTENCLR_RECEIVE12_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENCLR_RECEIVE12_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENCLR_RECEIVE12_Clear       ( 1UL )                                 /*!< Disable */

/* Bit 11 : Write '1' to disable interrupt for event RECEIVE[11] */
#define IPC_INTENCLR_RECEIVE11_Pos         ( 11UL )                                /*!< Position of RECEIVE11 field. */
#define IPC_INTENCLR_RECEIVE11_Msk         ( 0x1UL << IPC_INTENCLR_RECEIVE11_Pos ) /*!< Bit mask of RECEIVE11 field. */
#define IPC_INTENCLR_RECEIVE11_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENCLR_RECEIVE11_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENCLR_RECEIVE11_Clear       ( 1UL )                                 /*!< Disable */

