FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 8 : Enable subscription to IPC channel 8 */
#define IPC_RECEIVE_CNF_CHEN8_Pos         ( 8UL )                                /*!< Position of CHEN8 field. */
#define IPC_RECEIVE_CNF_CHEN8_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN8_Pos ) /*!< Bit mask of CHEN8 field. */
#define IPC_RECEIVE_CNF_CHEN8_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN8_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 7 : Enable subscription to IPC channel 7 */
#define IPC_RECEIVE_CNF_CHEN7_Pos         ( 7UL )                                /*!< Position of CHEN7 field. */
#define IPC_RECEIVE_CNF_CHEN7_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN7_Pos ) /*!< Bit mask of CHEN7 field. */
#define IPC_RECEIVE_CNF_CHEN7_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN7_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 6 : Enable subscription to IPC channel 6 */
#define IPC_RECEIVE_CNF_CHEN6_Pos         ( 6UL )                                /*!< Position of CHEN6 field. */
#define IPC_RECEIVE_CNF_CHEN6_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN6_Pos ) /*!< Bit mask of CHEN6 field. */
#define IPC_RECEIVE_CNF_CHEN6_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN6_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 5 : Enable subscription to IPC channel 5 */
#define IPC_RECEIVE_CNF_CHEN5_Pos         ( 5UL )                                /*!< Position of CHEN5 field. */
#define IPC_RECEIVE_CNF_CHEN5_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN5_Pos ) /*!< Bit mask of CHEN5 field. */
#define IPC_RECEIVE_CNF_CHEN5_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN5_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 4 : Enable subscription to IPC channel 4 */
#define IPC_RECEIVE_CNF_CHEN4_Pos         ( 4UL )                                /*!< Position of CHEN4 field. */
#define IPC_RECEIVE_CNF_CHEN4_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN4_Pos ) /*!< Bit mask of CHEN4 field. */
#define IPC_RECEIVE_CNF_CHEN4_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN4_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 3 : Enable subscription to IPC channel 3 */
#define IPC_RECEIVE_CNF_CHEN3_Pos         ( 3UL )                                /*!< Position of CHEN3 field. */
#define IPC_RECEIVE_CNF_CHEN3_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN3_Pos ) /*!< Bit mask of CHEN3 field. */
#define IPC_RECEIVE_CNF_CHEN3_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN3_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 2 : Enable subscription to IPC channel 2 */
#define IPC_RECEIVE_CNF_CHEN2_Pos         ( 2UL )                                /*!< Position of CHEN2 field. */
#define IPC_RECEIVE_CNF_CHEN2_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN2_Pos ) /*!< Bit mask of CHEN2 field. */
#define IPC_RECEIVE_CNF_CHEN2_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN2_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 1 : Enable subscription to IPC channel 1 */
#define IPC_RECEIVE_CNF_CHEN1_Pos         ( 1UL )                                /*!< Position of CHEN1 field. */
#define IPC_RECEIVE_CNF_CHEN1_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN1_Pos ) /*!< Bit mask of CHEN1 field. */
#define IPC_RECEIVE_CNF_CHEN1_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN1_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 0 : Enable subscription to IPC channel 0 */
#define IPC_RECEIVE_CNF_CHEN0_Pos         ( 0UL )                                /*!< Position of CHEN0 field. */
#define IPC_RECEIVE_CNF_CHEN0_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN0_Pos ) /*!< Bit mask of CHEN0 field. */
#define IPC_RECEIVE_CNF_CHEN0_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN0_Enable      ( 1UL )                                /*!< Enable events */

/* Register: IPC_GPMEM */
/* Description: Description collection: General purpose memory */

/* Bits 31..0 : General purpose memory */
#define IPC_GPMEM_GPMEM_Pos    ( 0UL )                                 /*!< Position of GPMEM field. */
#define IPC_GPMEM_GPMEM_Msk    ( 0xFFFFFFFFUL << IPC_GPMEM_GPMEM_Pos ) /*!< Bit mask of GPMEM field. */


/* Peripheral: KMU */
/* Description: Key management unit 0 */

/* Register: KMU_TASKS_PUSH_KEYSLOT */
/* Description: Push a key slot over secure APB */

/* Bit 0 : Push a key slot over secure APB */
#define KMU_TASKS_PUSH_KEYSLOT_TASKS_PUSH_KEYSLOT_Pos        ( 0UL )                                                    /*!< Position of TASKS_PUSH_KEYSLOT field. */
#define KMU_TASKS_PUSH_KEYSLOT_TASKS_PUSH_KEYSLOT_Msk        ( 0x1UL << KMU_TASKS_PUSH_KEYSLOT_TASKS_PUSH_KEYSLOT_Pos ) /*!< Bit mask of TASKS_PUSH_KEYSLOT field. */
#define KMU_TASKS_PUSH_KEYSLOT_TASKS_PUSH_KEYSLOT_Trigger    ( 1UL )                                                    /*!< Trigger task */

/* Register: KMU_EVENTS_KEYSLOT_PUSHED */
/* Description: Key slot successfully pushed over secure APB */

/* Bit 0 : Key slot successfully pushed over secure APB */
#define KMU_EVENTS_KEYSLOT_PUSHED_EVENTS_KEYSLOT_PUSHED_Pos             ( 0UL )                                                          /*!< Position of EVENTS_KEYSLOT_PUSHED field. */
#define KMU_EVENTS_KEYSLOT_PUSHED_EVENTS_KEYSLOT_PUSHED_Msk             ( 0x1UL << KMU_EVENTS_KEYSLOT_PUSHED_EVENTS_KEYSLOT_PUSHED_Pos ) /*!< Bit mask of EVENTS_KEYSLOT_PUSHED field. */
#define KMU_EVENTS_KEYSLOT_PUSHED_EVENTS_KEYSLOT_PUSHED_NotGenerated    ( 0UL )                                                          /*!< Event not generated */
#define KMU_EVENTS_KEYSLOT_PUSHED_EVENTS_KEYSLOT_PUSHED_Generated       ( 1UL )                                                          /*!< Event generated */

/* Register: KMU_EVENTS_KEYSLOT_REVOKED */
/* Description: Key slot has been revoked and cannot be tasked for selection */

/* Bit 0 : Key slot has been revoked and cannot be tasked for selection */
#define KMU_EVENTS_KEYSLOT_REVOKED_EVENTS_KEYSLOT_REVOKED_Pos             ( 0UL )                                                            /*!< Position of EVENTS_KEYSLOT_REVOKED field. */
#define KMU_EVENTS_KEYSLOT_REVOKED_EVENTS_KEYSLOT_REVOKED_Msk             ( 0x1UL << KMU_EVENTS_KEYSLOT_REVOKED_EVENTS_KEYSLOT_REVOKED_Pos ) /*!< Bit mask of EVENTS_KEYSLOT_REVOKED field. */
#define KMU_EVENTS_KEYSLOT_REVOKED_EVENTS_KEYSLOT_REVOKED_NotGenerated    ( 0UL )                                                            /*!< Event not generated */
#define KMU_EVENTS_KEYSLOT_REVOKED_EVENTS_KEYSLOT_REVOKED_Generated       ( 1UL )                                                            /*!< Event generated */

/* Register: KMU_EVENTS_KEYSLOT_ERROR */
/* Description: No key slot selected, no destination address defined, or error during push operation */

/* Bit 0 : No key slot selected, no destination address defined, or error during push operation */
#define KMU_EVENTS_KEYSLOT_ERROR_EVENTS_KEYSLOT_ERROR_Pos             ( 0UL )                                                        /*!< Position of EVENTS_KEYSLOT_ERROR field. */
#define KMU_EVENTS_KEYSLOT_ERROR_EVENTS_KEYSLOT_ERROR_Msk             ( 0x1UL << KMU_EVENTS_KEYSLOT_ERROR_EVENTS_KEYSLOT_ERROR_Pos ) /*!< Bit mask of EVENTS_KEYSLOT_ERROR field. */
#define KMU_EVENTS_KEYSLOT_ERROR_EVENTS_KEYSLOT_ERROR_NotGenerated    ( 0UL )                                                        /*!< Event not generated */
#define KMU_EVENTS_KEYSLOT_ERROR_EVENTS_KEYSLOT_ERROR_Generated       ( 1UL )                                                        /*!< Event generated */

/* Register: KMU_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 2 : Enable or disable interrupt for event KEYSLOT_ERROR */
#define KMU_INTEN_KEYSLOT_ERROR_Pos           ( 2UL )                                  /*!< Position of KEYSLOT_ERROR field. */
#define KMU_INTEN_KEYSLOT_ERROR_Msk           ( 0x1UL << KMU_INTEN_KEYSLOT_ERROR_Pos ) /*!< Bit mask of KEYSLOT_ERROR field. */
#define KMU_INTEN_KEYSLOT_ERROR_Disabled      ( 0UL )                                  /*!< Disable */
#define KMU_INTEN_KEYSLOT_ERROR_Enabled       ( 1UL )                                  /*!< Enable */

