FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Enable or disable interrupt for event KEYSLOT_REVOKED */
#define KMU_INTEN_KEYSLOT_REVOKED_Pos         ( 1UL )                                    /*!< Position of KEYSLOT_REVOKED field. */
#define KMU_INTEN_KEYSLOT_REVOKED_Msk         ( 0x1UL << KMU_INTEN_KEYSLOT_REVOKED_Pos ) /*!< Bit mask of KEYSLOT_REVOKED field. */
#define KMU_INTEN_KEYSLOT_REVOKED_Disabled    ( 0UL )                                    /*!< Disable */
#define KMU_INTEN_KEYSLOT_REVOKED_Enabled     ( 1UL )                                    /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event KEYSLOT_PUSHED */
#define KMU_INTEN_KEYSLOT_PUSHED_Pos          ( 0UL )                                   /*!< Position of KEYSLOT_PUSHED field. */
#define KMU_INTEN_KEYSLOT_PUSHED_Msk          ( 0x1UL << KMU_INTEN_KEYSLOT_PUSHED_Pos ) /*!< Bit mask of KEYSLOT_PUSHED field. */
#define KMU_INTEN_KEYSLOT_PUSHED_Disabled     ( 0UL )                                   /*!< Disable */
#define KMU_INTEN_KEYSLOT_PUSHED_Enabled      ( 1UL )                                   /*!< Enable */

/* Register: KMU_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event KEYSLOT_ERROR */
#define KMU_INTENSET_KEYSLOT_ERROR_Pos           ( 2UL )                                     /*!< Position of KEYSLOT_ERROR field. */
#define KMU_INTENSET_KEYSLOT_ERROR_Msk           ( 0x1UL << KMU_INTENSET_KEYSLOT_ERROR_Pos ) /*!< Bit mask of KEYSLOT_ERROR field. */
#define KMU_INTENSET_KEYSLOT_ERROR_Disabled      ( 0UL )                                     /*!< Read: Disabled */
#define KMU_INTENSET_KEYSLOT_ERROR_Enabled       ( 1UL )                                     /*!< Read: Enabled */
#define KMU_INTENSET_KEYSLOT_ERROR_Set           ( 1UL )                                     /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event KEYSLOT_REVOKED */
#define KMU_INTENSET_KEYSLOT_REVOKED_Pos         ( 1UL )                                       /*!< Position of KEYSLOT_REVOKED field. */
#define KMU_INTENSET_KEYSLOT_REVOKED_Msk         ( 0x1UL << KMU_INTENSET_KEYSLOT_REVOKED_Pos ) /*!< Bit mask of KEYSLOT_REVOKED field. */
#define KMU_INTENSET_KEYSLOT_REVOKED_Disabled    ( 0UL )                                       /*!< Read: Disabled */
#define KMU_INTENSET_KEYSLOT_REVOKED_Enabled     ( 1UL )                                       /*!< Read: Enabled */
#define KMU_INTENSET_KEYSLOT_REVOKED_Set         ( 1UL )                                       /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event KEYSLOT_PUSHED */
#define KMU_INTENSET_KEYSLOT_PUSHED_Pos          ( 0UL )                                      /*!< Position of KEYSLOT_PUSHED field. */
#define KMU_INTENSET_KEYSLOT_PUSHED_Msk          ( 0x1UL << KMU_INTENSET_KEYSLOT_PUSHED_Pos ) /*!< Bit mask of KEYSLOT_PUSHED field. */
#define KMU_INTENSET_KEYSLOT_PUSHED_Disabled     ( 0UL )                                      /*!< Read: Disabled */
#define KMU_INTENSET_KEYSLOT_PUSHED_Enabled      ( 1UL )                                      /*!< Read: Enabled */
#define KMU_INTENSET_KEYSLOT_PUSHED_Set          ( 1UL )                                      /*!< Enable */

/* Register: KMU_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event KEYSLOT_ERROR */
#define KMU_INTENCLR_KEYSLOT_ERROR_Pos           ( 2UL )                                     /*!< Position of KEYSLOT_ERROR field. */
#define KMU_INTENCLR_KEYSLOT_ERROR_Msk           ( 0x1UL << KMU_INTENCLR_KEYSLOT_ERROR_Pos ) /*!< Bit mask of KEYSLOT_ERROR field. */
#define KMU_INTENCLR_KEYSLOT_ERROR_Disabled      ( 0UL )                                     /*!< Read: Disabled */
#define KMU_INTENCLR_KEYSLOT_ERROR_Enabled       ( 1UL )                                     /*!< Read: Enabled */
#define KMU_INTENCLR_KEYSLOT_ERROR_Clear         ( 1UL )                                     /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event KEYSLOT_REVOKED */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Pos         ( 1UL )                                       /*!< Position of KEYSLOT_REVOKED field. */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Msk         ( 0x1UL << KMU_INTENCLR_KEYSLOT_REVOKED_Pos ) /*!< Bit mask of KEYSLOT_REVOKED field. */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Disabled    ( 0UL )                                       /*!< Read: Disabled */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Enabled     ( 1UL )                                       /*!< Read: Enabled */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Clear       ( 1UL )                                       /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event KEYSLOT_PUSHED */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Pos          ( 0UL )                                      /*!< Position of KEYSLOT_PUSHED field. */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Msk          ( 0x1UL << KMU_INTENCLR_KEYSLOT_PUSHED_Pos ) /*!< Bit mask of KEYSLOT_PUSHED field. */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Disabled     ( 0UL )                                      /*!< Read: Disabled */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Enabled      ( 1UL )                                      /*!< Read: Enabled */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Clear        ( 1UL )                                      /*!< Disable */

/* Register: KMU_INTPEND */
/* Description: Pending interrupts */

/* Bit 2 : Read pending status of interrupt for event KEYSLOT_ERROR */
#define KMU_INTPEND_KEYSLOT_ERROR_Pos             ( 2UL )                                    /*!< Position of KEYSLOT_ERROR field. */
#define KMU_INTPEND_KEYSLOT_ERROR_Msk             ( 0x1UL << KMU_INTPEND_KEYSLOT_ERROR_Pos ) /*!< Bit mask of KEYSLOT_ERROR field. */
#define KMU_INTPEND_KEYSLOT_ERROR_NotPending      ( 0UL )                                    /*!< Read: Not pending */
#define KMU_INTPEND_KEYSLOT_ERROR_Pending         ( 1UL )                                    /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event KEYSLOT_REVOKED */
#define KMU_INTPEND_KEYSLOT_REVOKED_Pos           ( 1UL )                                      /*!< Position of KEYSLOT_REVOKED field. */
#define KMU_INTPEND_KEYSLOT_REVOKED_Msk           ( 0x1UL << KMU_INTPEND_KEYSLOT_REVOKED_Pos ) /*!< Bit mask of KEYSLOT_REVOKED field. */
#define KMU_INTPEND_KEYSLOT_REVOKED_NotPending    ( 0UL )                                      /*!< Read: Not pending */
#define KMU_INTPEND_KEYSLOT_REVOKED_Pending       ( 1UL )                                      /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event KEYSLOT_PUSHED */
#define KMU_INTPEND_KEYSLOT_PUSHED_Pos            ( 0UL )                                     /*!< Position of KEYSLOT_PUSHED field. */
#define KMU_INTPEND_KEYSLOT_PUSHED_Msk            ( 0x1UL << KMU_INTPEND_KEYSLOT_PUSHED_Pos ) /*!< Bit mask of KEYSLOT_PUSHED field. */
#define KMU_INTPEND_KEYSLOT_PUSHED_NotPending     ( 0UL )                                     /*!< Read: Not pending */
#define KMU_INTPEND_KEYSLOT_PUSHED_Pending        ( 1UL )                                     /*!< Read: Pending */

/* Register: KMU_STATUS */
/* Description: Status bits for KMU operation */

/* Bit 1 : Violation status */
#define KMU_STATUS_BLOCKED_Pos          ( 1UL )                             /*!< Position of BLOCKED field. */
#define KMU_STATUS_BLOCKED_Msk          ( 0x1UL << KMU_STATUS_BLOCKED_Pos ) /*!< Bit mask of BLOCKED field. */
#define KMU_STATUS_BLOCKED_Disabled     ( 0UL )                             /*!< No access violation detected */
#define KMU_STATUS_BLOCKED_Enabled      ( 1UL )                             /*!< Access violation detected and blocked */

/* Bit 0 : Key slot ID successfully selected by the KMU */
#define KMU_STATUS_SELECTED_Pos         ( 0UL )                              /*!< Position of SELECTED field. */
#define KMU_STATUS_SELECTED_Msk         ( 0x1UL << KMU_STATUS_SELECTED_Pos ) /*!< Bit mask of SELECTED field. */
#define KMU_STATUS_SELECTED_Disabled    ( 0UL )                              /*!< No key slot ID selected by KMU */
#define KMU_STATUS_SELECTED_Enabled     ( 1UL )                              /*!< Key slot ID successfully selected by KMU */

/* Register: KMU_SELECTKEYSLOT */
/* Description: Select key slot to be read over AHB or pushed over secure APB when TASKS_PUSH_KEYSLOT is started */

/* Bits 7..0 : Select key slot ID to be read over AHB, or pushed over secure APB, when TASKS_PUSH_KEYSLOT is started. NOTE: ID=0 is not a valid key slot ID. The 0 ID should be used when the KMU is idle or not in use. NOTE: Index N in UICR-&gt;KEYSLOT.KEY[N] and UICR-&gt;KEYSLOT.CONFIG[N] corresponds to KMU key slot ID=N+1. */
#define KMU_SELECTKEYSLOT_ID_Pos    ( 0UL )                                /*!< Position of ID field. */
#define KMU_SELECTKEYSLOT_ID_Msk    ( 0xFFUL << KMU_SELECTKEYSLOT_ID_Pos ) /*!< Bit mask of ID field. */


