FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Peripheral: LPCOMP */
/* Description: Low-power comparator 0 */

/* Register: LPCOMP_TASKS_START */
/* Description: Start comparator */

/* Bit 0 : Start comparator */
#define LPCOMP_TASKS_START_TASKS_START_Pos        ( 0UL )                                         /*!< Position of TASKS_START field. */
#define LPCOMP_TASKS_START_TASKS_START_Msk        ( 0x1UL << LPCOMP_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define LPCOMP_TASKS_START_TASKS_START_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: LPCOMP_TASKS_STOP */
/* Description: Stop comparator */

/* Bit 0 : Stop comparator */
#define LPCOMP_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                       /*!< Position of TASKS_STOP field. */
#define LPCOMP_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << LPCOMP_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define LPCOMP_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: LPCOMP_TASKS_SAMPLE */
/* Description: Sample comparator value */

/* Bit 0 : Sample comparator value */
#define LPCOMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos        ( 0UL )                                           /*!< Position of TASKS_SAMPLE field. */
#define LPCOMP_TASKS_SAMPLE_TASKS_SAMPLE_Msk        ( 0x1UL << LPCOMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos ) /*!< Bit mask of TASKS_SAMPLE field. */
#define LPCOMP_TASKS_SAMPLE_TASKS_SAMPLE_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: LPCOMP_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define LPCOMP_SUBSCRIBE_START_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define LPCOMP_SUBSCRIBE_START_EN_Msk         ( 0x1UL << LPCOMP_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define LPCOMP_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define LPCOMP_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define LPCOMP_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define LPCOMP_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << LPCOMP_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: LPCOMP_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define LPCOMP_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define LPCOMP_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << LPCOMP_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define LPCOMP_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define LPCOMP_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define LPCOMP_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define LPCOMP_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << LPCOMP_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: LPCOMP_SUBSCRIBE_SAMPLE */
/* Description: Subscribe configuration for task SAMPLE */

/* Bit 31 :   */
#define LPCOMP_SUBSCRIBE_SAMPLE_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define LPCOMP_SUBSCRIBE_SAMPLE_EN_Msk         ( 0x1UL << LPCOMP_SUBSCRIBE_SAMPLE_EN_Pos ) /*!< Bit mask of EN field. */
#define LPCOMP_SUBSCRIBE_SAMPLE_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define LPCOMP_SUBSCRIBE_SAMPLE_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SAMPLE will subscribe to */
#define LPCOMP_SUBSCRIBE_SAMPLE_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define LPCOMP_SUBSCRIBE_SAMPLE_CHIDX_Msk      ( 0xFFUL << LPCOMP_SUBSCRIBE_SAMPLE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: LPCOMP_EVENTS_READY */
/* Description: LPCOMP is ready and output is valid */

/* Bit 0 : LPCOMP is ready and output is valid */
#define LPCOMP_EVENTS_READY_EVENTS_READY_Pos             ( 0UL )                                           /*!< Position of EVENTS_READY field. */
#define LPCOMP_EVENTS_READY_EVENTS_READY_Msk             ( 0x1UL << LPCOMP_EVENTS_READY_EVENTS_READY_Pos ) /*!< Bit mask of EVENTS_READY field. */
#define LPCOMP_EVENTS_READY_EVENTS_READY_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define LPCOMP_EVENTS_READY_EVENTS_READY_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: LPCOMP_EVENTS_DOWN */
/* Description: Downward crossing */

/* Bit 0 : Downward crossing */
#define LPCOMP_EVENTS_DOWN_EVENTS_DOWN_Pos             ( 0UL )                                         /*!< Position of EVENTS_DOWN field. */
#define LPCOMP_EVENTS_DOWN_EVENTS_DOWN_Msk             ( 0x1UL << LPCOMP_EVENTS_DOWN_EVENTS_DOWN_Pos ) /*!< Bit mask of EVENTS_DOWN field. */
#define LPCOMP_EVENTS_DOWN_EVENTS_DOWN_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define LPCOMP_EVENTS_DOWN_EVENTS_DOWN_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: LPCOMP_EVENTS_UP */
/* Description: Upward crossing */

/* Bit 0 : Upward crossing */
#define LPCOMP_EVENTS_UP_EVENTS_UP_Pos             ( 0UL )                                     /*!< Position of EVENTS_UP field. */
#define LPCOMP_EVENTS_UP_EVENTS_UP_Msk             ( 0x1UL << LPCOMP_EVENTS_UP_EVENTS_UP_Pos ) /*!< Bit mask of EVENTS_UP field. */
#define LPCOMP_EVENTS_UP_EVENTS_UP_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define LPCOMP_EVENTS_UP_EVENTS_UP_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: LPCOMP_EVENTS_CROSS */
/* Description: Downward or upward crossing */

/* Bit 0 : Downward or upward crossing */
#define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Pos             ( 0UL )                                           /*!< Position of EVENTS_CROSS field. */
#define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Msk             ( 0x1UL << LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Pos ) /*!< Bit mask of EVENTS_CROSS field. */
#define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: LPCOMP_PUBLISH_READY */
/* Description: Publish configuration for event READY */

/* Bit 31 :   */
#define LPCOMP_PUBLISH_READY_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define LPCOMP_PUBLISH_READY_EN_Msk         ( 0x1UL << LPCOMP_PUBLISH_READY_EN_Pos ) /*!< Bit mask of EN field. */
#define LPCOMP_PUBLISH_READY_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define LPCOMP_PUBLISH_READY_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event READY will publish to. */
#define LPCOMP_PUBLISH_READY_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define LPCOMP_PUBLISH_READY_CHIDX_Msk      ( 0xFFUL << LPCOMP_PUBLISH_READY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: LPCOMP_PUBLISH_DOWN */
/* Description: Publish configuration for event DOWN */

/* Bit 31 :   */
#define LPCOMP_PUBLISH_DOWN_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define LPCOMP_PUBLISH_DOWN_EN_Msk         ( 0x1UL << LPCOMP_PUBLISH_DOWN_EN_Pos ) /*!< Bit mask of EN field. */
#define LPCOMP_PUBLISH_DOWN_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define LPCOMP_PUBLISH_DOWN_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event DOWN will publish to. */
#define LPCOMP_PUBLISH_DOWN_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define LPCOMP_PUBLISH_DOWN_CHIDX_Msk      ( 0xFFUL << LPCOMP_PUBLISH_DOWN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: LPCOMP_PUBLISH_UP */
/* Description: Publish configuration for event UP */

/* Bit 31 :   */
#define LPCOMP_PUBLISH_UP_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define LPCOMP_PUBLISH_UP_EN_Msk         ( 0x1UL << LPCOMP_PUBLISH_UP_EN_Pos ) /*!< Bit mask of EN field. */
#define LPCOMP_PUBLISH_UP_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define LPCOMP_PUBLISH_UP_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event UP will publish to. */
#define LPCOMP_PUBLISH_UP_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define LPCOMP_PUBLISH_UP_CHIDX_Msk      ( 0xFFUL << LPCOMP_PUBLISH_UP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: LPCOMP_PUBLISH_CROSS */
/* Description: Publish configuration for event CROSS */

/* Bit 31 :   */
#define LPCOMP_PUBLISH_CROSS_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define LPCOMP_PUBLISH_CROSS_EN_Msk         ( 0x1UL << LPCOMP_PUBLISH_CROSS_EN_Pos ) /*!< Bit mask of EN field. */
#define LPCOMP_PUBLISH_CROSS_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define LPCOMP_PUBLISH_CROSS_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CROSS will publish to. */
#define LPCOMP_PUBLISH_CROSS_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define LPCOMP_PUBLISH_CROSS_CHIDX_Msk      ( 0xFFUL << LPCOMP_PUBLISH_CROSS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: LPCOMP_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 4 : Shortcut between event CROSS and task STOP */
#define LPCOMP_SHORTS_CROSS_STOP_Pos           ( 4UL )                                   /*!< Position of CROSS_STOP field. */
#define LPCOMP_SHORTS_CROSS_STOP_Msk           ( 0x1UL << LPCOMP_SHORTS_CROSS_STOP_Pos ) /*!< Bit mask of CROSS_STOP field. */
#define LPCOMP_SHORTS_CROSS_STOP_Disabled      ( 0UL )                                   /*!< Disable shortcut */
#define LPCOMP_SHORTS_CROSS_STOP_Enabled       ( 1UL )                                   /*!< Enable shortcut */

/* Bit 3 : Shortcut between event UP and task STOP */
#define LPCOMP_SHORTS_UP_STOP_Pos              ( 3UL )                                /*!< Position of UP_STOP field. */
#define LPCOMP_SHORTS_UP_STOP_Msk              ( 0x1UL << LPCOMP_SHORTS_UP_STOP_Pos ) /*!< Bit mask of UP_STOP field. */
#define LPCOMP_SHORTS_UP_STOP_Disabled         ( 0UL )                                /*!< Disable shortcut */
#define LPCOMP_SHORTS_UP_STOP_Enabled          ( 1UL )                                /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DOWN and task STOP */
#define LPCOMP_SHORTS_DOWN_STOP_Pos            ( 2UL )                                  /*!< Position of DOWN_STOP field. */
#define LPCOMP_SHORTS_DOWN_STOP_Msk            ( 0x1UL << LPCOMP_SHORTS_DOWN_STOP_Pos ) /*!< Bit mask of DOWN_STOP field. */
#define LPCOMP_SHORTS_DOWN_STOP_Disabled       ( 0UL )                                  /*!< Disable shortcut */
#define LPCOMP_SHORTS_DOWN_STOP_Enabled        ( 1UL )                                  /*!< Enable shortcut */

/* Bit 1 : Shortcut between event READY and task STOP */
#define LPCOMP_SHORTS_READY_STOP_Pos           ( 1UL )                                   /*!< Position of READY_STOP field. */
#define LPCOMP_SHORTS_READY_STOP_Msk           ( 0x1UL << LPCOMP_SHORTS_READY_STOP_Pos ) /*!< Bit mask of READY_STOP field. */
#define LPCOMP_SHORTS_READY_STOP_Disabled      ( 0UL )                                   /*!< Disable shortcut */
#define LPCOMP_SHORTS_READY_STOP_Enabled       ( 1UL )                                   /*!< Enable shortcut */

/* Bit 0 : Shortcut between event READY and task SAMPLE */
#define LPCOMP_SHORTS_READY_SAMPLE_Pos         ( 0UL )                                     /*!< Position of READY_SAMPLE field. */
#define LPCOMP_SHORTS_READY_SAMPLE_Msk         ( 0x1UL << LPCOMP_SHORTS_READY_SAMPLE_Pos ) /*!< Bit mask of READY_SAMPLE field. */
#define LPCOMP_SHORTS_READY_SAMPLE_Disabled    ( 0UL )                                     /*!< Disable shortcut */
#define LPCOMP_SHORTS_READY_SAMPLE_Enabled     ( 1UL )                                     /*!< Enable shortcut */

/* Register: LPCOMP_INTENSET */
/* Description: Enable interrupt */

/* Bit 3 : Write '1' to enable interrupt for event CROSS */
#define LPCOMP_INTENSET_CROSS_Pos         ( 3UL )                                /*!< Position of CROSS field. */
#define LPCOMP_INTENSET_CROSS_Msk         ( 0x1UL << LPCOMP_INTENSET_CROSS_Pos ) /*!< Bit mask of CROSS field. */
#define LPCOMP_INTENSET_CROSS_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define LPCOMP_INTENSET_CROSS_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define LPCOMP_INTENSET_CROSS_Set         ( 1UL )                                /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event UP */
#define LPCOMP_INTENSET_UP_Pos            ( 2UL )                             /*!< Position of UP field. */
#define LPCOMP_INTENSET_UP_Msk            ( 0x1UL << LPCOMP_INTENSET_UP_Pos ) /*!< Bit mask of UP field. */
#define LPCOMP_INTENSET_UP_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define LPCOMP_INTENSET_UP_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define LPCOMP_INTENSET_UP_Set            ( 1UL )                             /*!< Enable */

