FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Write '1' to enable interrupt for event DOWN */
#define LPCOMP_INTENSET_DOWN_Pos          ( 1UL )                               /*!< Position of DOWN field. */
#define LPCOMP_INTENSET_DOWN_Msk          ( 0x1UL << LPCOMP_INTENSET_DOWN_Pos ) /*!< Bit mask of DOWN field. */
#define LPCOMP_INTENSET_DOWN_Disabled     ( 0UL )                               /*!< Read: Disabled */
#define LPCOMP_INTENSET_DOWN_Enabled      ( 1UL )                               /*!< Read: Enabled */
#define LPCOMP_INTENSET_DOWN_Set          ( 1UL )                               /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event READY */
#define LPCOMP_INTENSET_READY_Pos         ( 0UL )                                /*!< Position of READY field. */
#define LPCOMP_INTENSET_READY_Msk         ( 0x1UL << LPCOMP_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define LPCOMP_INTENSET_READY_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define LPCOMP_INTENSET_READY_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define LPCOMP_INTENSET_READY_Set         ( 1UL )                                /*!< Enable */

/* Register: LPCOMP_INTENCLR */
/* Description: Disable interrupt */

/* Bit 3 : Write '1' to disable interrupt for event CROSS */
#define LPCOMP_INTENCLR_CROSS_Pos         ( 3UL )                                /*!< Position of CROSS field. */
#define LPCOMP_INTENCLR_CROSS_Msk         ( 0x1UL << LPCOMP_INTENCLR_CROSS_Pos ) /*!< Bit mask of CROSS field. */
#define LPCOMP_INTENCLR_CROSS_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define LPCOMP_INTENCLR_CROSS_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define LPCOMP_INTENCLR_CROSS_Clear       ( 1UL )                                /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event UP */
#define LPCOMP_INTENCLR_UP_Pos            ( 2UL )                             /*!< Position of UP field. */
#define LPCOMP_INTENCLR_UP_Msk            ( 0x1UL << LPCOMP_INTENCLR_UP_Pos ) /*!< Bit mask of UP field. */
#define LPCOMP_INTENCLR_UP_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define LPCOMP_INTENCLR_UP_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define LPCOMP_INTENCLR_UP_Clear          ( 1UL )                             /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event DOWN */
#define LPCOMP_INTENCLR_DOWN_Pos          ( 1UL )                               /*!< Position of DOWN field. */
#define LPCOMP_INTENCLR_DOWN_Msk          ( 0x1UL << LPCOMP_INTENCLR_DOWN_Pos ) /*!< Bit mask of DOWN field. */
#define LPCOMP_INTENCLR_DOWN_Disabled     ( 0UL )                               /*!< Read: Disabled */
#define LPCOMP_INTENCLR_DOWN_Enabled      ( 1UL )                               /*!< Read: Enabled */
#define LPCOMP_INTENCLR_DOWN_Clear        ( 1UL )                               /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event READY */
#define LPCOMP_INTENCLR_READY_Pos         ( 0UL )                                /*!< Position of READY field. */
#define LPCOMP_INTENCLR_READY_Msk         ( 0x1UL << LPCOMP_INTENCLR_READY_Pos ) /*!< Bit mask of READY field. */
#define LPCOMP_INTENCLR_READY_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define LPCOMP_INTENCLR_READY_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define LPCOMP_INTENCLR_READY_Clear       ( 1UL )                                /*!< Disable */

/* Register: LPCOMP_RESULT */
/* Description: Compare result */

/* Bit 0 : Result of last compare. Decision point SAMPLE task. */
#define LPCOMP_RESULT_RESULT_Pos      ( 0UL )                               /*!< Position of RESULT field. */
#define LPCOMP_RESULT_RESULT_Msk      ( 0x1UL << LPCOMP_RESULT_RESULT_Pos ) /*!< Bit mask of RESULT field. */
#define LPCOMP_RESULT_RESULT_Below    ( 0UL )                               /*!< Input voltage is below the reference threshold (VIN+ &lt; VIN-) */
#define LPCOMP_RESULT_RESULT_Above    ( 1UL )                               /*!< Input voltage is above the reference threshold (VIN+ &gt; VIN-) */

/* Register: LPCOMP_ENABLE */
/* Description: Enable LPCOMP */

/* Bits 1..0 : Enable or disable LPCOMP */
#define LPCOMP_ENABLE_ENABLE_Pos         ( 0UL )                               /*!< Position of ENABLE field. */
#define LPCOMP_ENABLE_ENABLE_Msk         ( 0x3UL << LPCOMP_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define LPCOMP_ENABLE_ENABLE_Disabled    ( 0UL )                               /*!< Disable */
#define LPCOMP_ENABLE_ENABLE_Enabled     ( 1UL )                               /*!< Enable */

/* Register: LPCOMP_PSEL */
/* Description: Input pin select */

/* Bits 2..0 : Analog pin select */
#define LPCOMP_PSEL_PSEL_Pos             ( 0UL )                           /*!< Position of PSEL field. */
#define LPCOMP_PSEL_PSEL_Msk             ( 0x7UL << LPCOMP_PSEL_PSEL_Pos ) /*!< Bit mask of PSEL field. */
#define LPCOMP_PSEL_PSEL_AnalogInput0    ( 0UL )                           /*!< AIN0 selected as analog input */
#define LPCOMP_PSEL_PSEL_AnalogInput1    ( 1UL )                           /*!< AIN1 selected as analog input */
#define LPCOMP_PSEL_PSEL_AnalogInput2    ( 2UL )                           /*!< AIN2 selected as analog input */
#define LPCOMP_PSEL_PSEL_AnalogInput3    ( 3UL )                           /*!< AIN3 selected as analog input */
#define LPCOMP_PSEL_PSEL_AnalogInput4    ( 4UL )                           /*!< AIN4 selected as analog input */
#define LPCOMP_PSEL_PSEL_AnalogInput5    ( 5UL )                           /*!< AIN5 selected as analog input */
#define LPCOMP_PSEL_PSEL_AnalogInput6    ( 6UL )                           /*!< AIN6 selected as analog input */
#define LPCOMP_PSEL_PSEL_AnalogInput7    ( 7UL )                           /*!< AIN7 selected as analog input */

/* Register: LPCOMP_REFSEL */
/* Description: Reference select */

/* Bits 3..0 : Reference select */
#define LPCOMP_REFSEL_REFSEL_Pos            ( 0UL )                               /*!< Position of REFSEL field. */
#define LPCOMP_REFSEL_REFSEL_Msk            ( 0xFUL << LPCOMP_REFSEL_REFSEL_Pos ) /*!< Bit mask of REFSEL field. */
#define LPCOMP_REFSEL_REFSEL_Ref1_8Vdd      ( 0UL )                               /*!< VDD * 1/8 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref2_8Vdd      ( 1UL )                               /*!< VDD * 2/8 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref3_8Vdd      ( 2UL )                               /*!< VDD * 3/8 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref4_8Vdd      ( 3UL )                               /*!< VDD * 4/8 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref5_8Vdd      ( 4UL )                               /*!< VDD * 5/8 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref6_8Vdd      ( 5UL )                               /*!< VDD * 6/8 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref7_8Vdd      ( 6UL )                               /*!< VDD * 7/8 selected as reference */
#define LPCOMP_REFSEL_REFSEL_ARef           ( 7UL )                               /*!< External analog reference selected */
#define LPCOMP_REFSEL_REFSEL_Ref1_16Vdd     ( 8UL )                               /*!< VDD * 1/16 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref3_16Vdd     ( 9UL )                               /*!< VDD * 3/16 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref5_16Vdd     ( 10UL )                              /*!< VDD * 5/16 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref7_16Vdd     ( 11UL )                              /*!< VDD * 7/16 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref9_16Vdd     ( 12UL )                              /*!< VDD * 9/16 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref11_16Vdd    ( 13UL )                              /*!< VDD * 11/16 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref13_16Vdd    ( 14UL )                              /*!< VDD * 13/16 selected as reference */
#define LPCOMP_REFSEL_REFSEL_Ref15_16Vdd    ( 15UL )                              /*!< VDD * 15/16 selected as reference */

/* Register: LPCOMP_EXTREFSEL */
/* Description: External reference select */

/* Bit 0 : External analog reference select */
#define LPCOMP_EXTREFSEL_EXTREFSEL_Pos                 ( 0UL )                                     /*!< Position of EXTREFSEL field. */
#define LPCOMP_EXTREFSEL_EXTREFSEL_Msk                 ( 0x1UL << LPCOMP_EXTREFSEL_EXTREFSEL_Pos ) /*!< Bit mask of EXTREFSEL field. */
#define LPCOMP_EXTREFSEL_EXTREFSEL_AnalogReference0    ( 0UL )                                     /*!< Use AIN0 as external analog reference */
#define LPCOMP_EXTREFSEL_EXTREFSEL_AnalogReference1    ( 1UL )                                     /*!< Use AIN1 as external analog reference */

/* Register: LPCOMP_ANADETECT */
/* Description: Analog detect configuration */

/* Bits 1..0 : Analog detect configuration */
#define LPCOMP_ANADETECT_ANADETECT_Pos      ( 0UL )                                     /*!< Position of ANADETECT field. */
#define LPCOMP_ANADETECT_ANADETECT_Msk      ( 0x3UL << LPCOMP_ANADETECT_ANADETECT_Pos ) /*!< Bit mask of ANADETECT field. */
#define LPCOMP_ANADETECT_ANADETECT_Cross    ( 0UL )                                     /*!< Generate ANADETECT on crossing, both upward crossing and downward crossing */
#define LPCOMP_ANADETECT_ANADETECT_Up       ( 1UL )                                     /*!< Generate ANADETECT on upward crossing only */
#define LPCOMP_ANADETECT_ANADETECT_Down     ( 2UL )                                     /*!< Generate ANADETECT on downward crossing only */

