FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: LPCOMP_HYST */
/* Description: Comparator hysteresis enable */

/* Bit 0 : Comparator hysteresis enable */
#define LPCOMP_HYST_HYST_Pos         ( 0UL )                           /*!< Position of HYST field. */
#define LPCOMP_HYST_HYST_Msk         ( 0x1UL << LPCOMP_HYST_HYST_Pos ) /*!< Bit mask of HYST field. */
#define LPCOMP_HYST_HYST_Disabled    ( 0UL )                           /*!< Comparator hysteresis disabled */
#define LPCOMP_HYST_HYST_Enabled     ( 1UL )                           /*!< Comparator hysteresis enabled */


/* Peripheral: MUTEX */
/* Description: MUTEX 0 */

/* Register: MUTEX_MUTEX */
/* Description: Description collection: Mutex register */

/* Bit 0 : Mutex register n */
#define MUTEX_MUTEX_MUTEX_Pos         ( 0UL )                            /*!< Position of MUTEX field. */
#define MUTEX_MUTEX_MUTEX_Msk         ( 0x1UL << MUTEX_MUTEX_MUTEX_Pos ) /*!< Bit mask of MUTEX field. */
#define MUTEX_MUTEX_MUTEX_Unlocked    ( 0UL )                            /*!< Mutex n is in unlocked state */
#define MUTEX_MUTEX_MUTEX_Locked      ( 1UL )                            /*!< Mutex n is in locked state */


/* Peripheral: NFCT */
/* Description: NFC-A compatible radio 0 */

/* Register: NFCT_TASKS_ACTIVATE */
/* Description: Activate NFCT peripheral for incoming and outgoing frames, change state to activated */

/* Bit 0 : Activate NFCT peripheral for incoming and outgoing frames, change state to activated */
#define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos        ( 0UL )                                             /*!< Position of TASKS_ACTIVATE field. */
#define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Msk        ( 0x1UL << NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos ) /*!< Bit mask of TASKS_ACTIVATE field. */
#define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Trigger    ( 1UL )                                             /*!< Trigger task */

/* Register: NFCT_TASKS_DISABLE */
/* Description: Disable NFCT peripheral */

/* Bit 0 : Disable NFCT peripheral */
#define NFCT_TASKS_DISABLE_TASKS_DISABLE_Pos        ( 0UL )                                           /*!< Position of TASKS_DISABLE field. */
#define NFCT_TASKS_DISABLE_TASKS_DISABLE_Msk        ( 0x1UL << NFCT_TASKS_DISABLE_TASKS_DISABLE_Pos ) /*!< Bit mask of TASKS_DISABLE field. */
#define NFCT_TASKS_DISABLE_TASKS_DISABLE_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: NFCT_TASKS_SENSE */
/* Description: Enable NFC sense field mode, change state to sense mode */

/* Bit 0 : Enable NFC sense field mode, change state to sense mode */
#define NFCT_TASKS_SENSE_TASKS_SENSE_Pos        ( 0UL )                                       /*!< Position of TASKS_SENSE field. */
#define NFCT_TASKS_SENSE_TASKS_SENSE_Msk        ( 0x1UL << NFCT_TASKS_SENSE_TASKS_SENSE_Pos ) /*!< Bit mask of TASKS_SENSE field. */
#define NFCT_TASKS_SENSE_TASKS_SENSE_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: NFCT_TASKS_STARTTX */
/* Description: Start transmission of an outgoing frame, change state to transmit */

/* Bit 0 : Start transmission of an outgoing frame, change state to transmit */
#define NFCT_TASKS_STARTTX_TASKS_STARTTX_Pos        ( 0UL )                                           /*!< Position of TASKS_STARTTX field. */
#define NFCT_TASKS_STARTTX_TASKS_STARTTX_Msk        ( 0x1UL << NFCT_TASKS_STARTTX_TASKS_STARTTX_Pos ) /*!< Bit mask of TASKS_STARTTX field. */
#define NFCT_TASKS_STARTTX_TASKS_STARTTX_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: NFCT_TASKS_ENABLERXDATA */
/* Description: Initializes the EasyDMA for receive. */

/* Bit 0 : Initializes the EasyDMA for receive. */
#define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Pos        ( 0UL )                                                     /*!< Position of TASKS_ENABLERXDATA field. */
#define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Msk        ( 0x1UL << NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Pos ) /*!< Bit mask of TASKS_ENABLERXDATA field. */
#define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Trigger    ( 1UL )                                                     /*!< Trigger task */

/* Register: NFCT_TASKS_GOIDLE */
/* Description: Force state machine to IDLE state */

/* Bit 0 : Force state machine to IDLE state */
#define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Pos        ( 0UL )                                         /*!< Position of TASKS_GOIDLE field. */
#define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Msk        ( 0x1UL << NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Pos ) /*!< Bit mask of TASKS_GOIDLE field. */
#define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: NFCT_TASKS_GOSLEEP */
/* Description: Force state machine to SLEEP_A state */

/* Bit 0 : Force state machine to SLEEP_A state */
#define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Pos        ( 0UL )                                           /*!< Position of TASKS_GOSLEEP field. */
#define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Msk        ( 0x1UL << NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Pos ) /*!< Bit mask of TASKS_GOSLEEP field. */
#define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: NFCT_SUBSCRIBE_ACTIVATE */
/* Description: Subscribe configuration for task ACTIVATE */

/* Bit 31 :   */
#define NFCT_SUBSCRIBE_ACTIVATE_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define NFCT_SUBSCRIBE_ACTIVATE_EN_Msk         ( 0x1UL << NFCT_SUBSCRIBE_ACTIVATE_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_SUBSCRIBE_ACTIVATE_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define NFCT_SUBSCRIBE_ACTIVATE_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task ACTIVATE will subscribe to */
#define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Msk      ( 0xFFUL << NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_SUBSCRIBE_DISABLE */
/* Description: Subscribe configuration for task DISABLE */

/* Bit 31 :   */
#define NFCT_SUBSCRIBE_DISABLE_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define NFCT_SUBSCRIBE_DISABLE_EN_Msk         ( 0x1UL << NFCT_SUBSCRIBE_DISABLE_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_SUBSCRIBE_DISABLE_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define NFCT_SUBSCRIBE_DISABLE_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DISABLE will subscribe to */
#define NFCT_SUBSCRIBE_DISABLE_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define NFCT_SUBSCRIBE_DISABLE_CHIDX_Msk      ( 0xFFUL << NFCT_SUBSCRIBE_DISABLE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_SUBSCRIBE_SENSE */
/* Description: Subscribe configuration for task SENSE */

/* Bit 31 :   */
#define NFCT_SUBSCRIBE_SENSE_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define NFCT_SUBSCRIBE_SENSE_EN_Msk         ( 0x1UL << NFCT_SUBSCRIBE_SENSE_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_SUBSCRIBE_SENSE_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define NFCT_SUBSCRIBE_SENSE_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SENSE will subscribe to */
#define NFCT_SUBSCRIBE_SENSE_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define NFCT_SUBSCRIBE_SENSE_CHIDX_Msk      ( 0xFFUL << NFCT_SUBSCRIBE_SENSE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_SUBSCRIBE_STARTTX */
/* Description: Subscribe configuration for task STARTTX */

/* Bit 31 :   */
#define NFCT_SUBSCRIBE_STARTTX_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define NFCT_SUBSCRIBE_STARTTX_EN_Msk         ( 0x1UL << NFCT_SUBSCRIBE_STARTTX_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_SUBSCRIBE_STARTTX_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define NFCT_SUBSCRIBE_STARTTX_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTTX will subscribe to */
#define NFCT_SUBSCRIBE_STARTTX_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define NFCT_SUBSCRIBE_STARTTX_CHIDX_Msk      ( 0xFFUL << NFCT_SUBSCRIBE_STARTTX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

