FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : EasyDMA is ready to receive or send frames. */
#define NFCT_EVENTS_STARTED_EVENTS_STARTED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STARTED field. */
#define NFCT_EVENTS_STARTED_EVENTS_STARTED_Msk             ( 0x1UL << NFCT_EVENTS_STARTED_EVENTS_STARTED_Pos ) /*!< Bit mask of EVENTS_STARTED field. */
#define NFCT_EVENTS_STARTED_EVENTS_STARTED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define NFCT_EVENTS_STARTED_EVENTS_STARTED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: NFCT_PUBLISH_READY */
/* Description: Publish configuration for event READY */

/* Bit 31 :   */
#define NFCT_PUBLISH_READY_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define NFCT_PUBLISH_READY_EN_Msk         ( 0x1UL << NFCT_PUBLISH_READY_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_READY_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define NFCT_PUBLISH_READY_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event READY will publish to. */
#define NFCT_PUBLISH_READY_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_READY_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_READY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_FIELDDETECTED */
/* Description: Publish configuration for event FIELDDETECTED */

/* Bit 31 :   */
#define NFCT_PUBLISH_FIELDDETECTED_EN_Pos         ( 31UL )                                       /*!< Position of EN field. */
#define NFCT_PUBLISH_FIELDDETECTED_EN_Msk         ( 0x1UL << NFCT_PUBLISH_FIELDDETECTED_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_FIELDDETECTED_EN_Disabled    ( 0UL )                                        /*!< Disable publishing */
#define NFCT_PUBLISH_FIELDDETECTED_EN_Enabled     ( 1UL )                                        /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event FIELDDETECTED will publish to. */
#define NFCT_PUBLISH_FIELDDETECTED_CHIDX_Pos      ( 0UL )                                            /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_FIELDDETECTED_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_FIELDDETECTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_FIELDLOST */
/* Description: Publish configuration for event FIELDLOST */

/* Bit 31 :   */
#define NFCT_PUBLISH_FIELDLOST_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define NFCT_PUBLISH_FIELDLOST_EN_Msk         ( 0x1UL << NFCT_PUBLISH_FIELDLOST_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_FIELDLOST_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define NFCT_PUBLISH_FIELDLOST_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event FIELDLOST will publish to. */
#define NFCT_PUBLISH_FIELDLOST_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_FIELDLOST_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_FIELDLOST_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_TXFRAMESTART */
/* Description: Publish configuration for event TXFRAMESTART */

/* Bit 31 :   */
#define NFCT_PUBLISH_TXFRAMESTART_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define NFCT_PUBLISH_TXFRAMESTART_EN_Msk         ( 0x1UL << NFCT_PUBLISH_TXFRAMESTART_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_TXFRAMESTART_EN_Disabled    ( 0UL )                                       /*!< Disable publishing */
#define NFCT_PUBLISH_TXFRAMESTART_EN_Enabled     ( 1UL )                                       /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXFRAMESTART will publish to. */
#define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_TXFRAMESTART_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_TXFRAMESTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_TXFRAMEEND */
/* Description: Publish configuration for event TXFRAMEEND */

/* Bit 31 :   */
#define NFCT_PUBLISH_TXFRAMEEND_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define NFCT_PUBLISH_TXFRAMEEND_EN_Msk         ( 0x1UL << NFCT_PUBLISH_TXFRAMEEND_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_TXFRAMEEND_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define NFCT_PUBLISH_TXFRAMEEND_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXFRAMEEND will publish to. */
#define NFCT_PUBLISH_TXFRAMEEND_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_TXFRAMEEND_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_TXFRAMEEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_RXFRAMESTART */
/* Description: Publish configuration for event RXFRAMESTART */

/* Bit 31 :   */
#define NFCT_PUBLISH_RXFRAMESTART_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define NFCT_PUBLISH_RXFRAMESTART_EN_Msk         ( 0x1UL << NFCT_PUBLISH_RXFRAMESTART_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_RXFRAMESTART_EN_Disabled    ( 0UL )                                       /*!< Disable publishing */
#define NFCT_PUBLISH_RXFRAMESTART_EN_Enabled     ( 1UL )                                       /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RXFRAMESTART will publish to. */
#define NFCT_PUBLISH_RXFRAMESTART_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_RXFRAMESTART_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_RXFRAMESTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_RXFRAMEEND */
/* Description: Publish configuration for event RXFRAMEEND */

/* Bit 31 :   */
#define NFCT_PUBLISH_RXFRAMEEND_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define NFCT_PUBLISH_RXFRAMEEND_EN_Msk         ( 0x1UL << NFCT_PUBLISH_RXFRAMEEND_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_RXFRAMEEND_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define NFCT_PUBLISH_RXFRAMEEND_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RXFRAMEEND will publish to. */
#define NFCT_PUBLISH_RXFRAMEEND_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_RXFRAMEEND_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_RXFRAMEEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_ERROR */
/* Description: Publish configuration for event ERROR */

/* Bit 31 :   */
#define NFCT_PUBLISH_ERROR_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define NFCT_PUBLISH_ERROR_EN_Msk         ( 0x1UL << NFCT_PUBLISH_ERROR_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_ERROR_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define NFCT_PUBLISH_ERROR_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ERROR will publish to. */
#define NFCT_PUBLISH_ERROR_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_ERROR_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_ERROR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_RXERROR */
/* Description: Publish configuration for event RXERROR */

/* Bit 31 :   */
#define NFCT_PUBLISH_RXERROR_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define NFCT_PUBLISH_RXERROR_EN_Msk         ( 0x1UL << NFCT_PUBLISH_RXERROR_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_RXERROR_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define NFCT_PUBLISH_RXERROR_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

