FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 7..0 : DPPI channel that event RXERROR will publish to. */
#define NFCT_PUBLISH_RXERROR_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_RXERROR_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_RXERROR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_ENDRX */
/* Description: Publish configuration for event ENDRX */

/* Bit 31 :   */
#define NFCT_PUBLISH_ENDRX_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define NFCT_PUBLISH_ENDRX_EN_Msk         ( 0x1UL << NFCT_PUBLISH_ENDRX_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_ENDRX_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define NFCT_PUBLISH_ENDRX_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDRX will publish to. */
#define NFCT_PUBLISH_ENDRX_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_ENDRX_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_ENDRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_ENDTX */
/* Description: Publish configuration for event ENDTX */

/* Bit 31 :   */
#define NFCT_PUBLISH_ENDTX_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define NFCT_PUBLISH_ENDTX_EN_Msk         ( 0x1UL << NFCT_PUBLISH_ENDTX_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_ENDTX_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define NFCT_PUBLISH_ENDTX_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDTX will publish to. */
#define NFCT_PUBLISH_ENDTX_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_ENDTX_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_ENDTX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_AUTOCOLRESSTARTED */
/* Description: Publish configuration for event AUTOCOLRESSTARTED */

/* Bit 31 :   */
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Pos         ( 31UL )                                           /*!< Position of EN field. */
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Msk         ( 0x1UL << NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Disabled    ( 0UL )                                            /*!< Disable publishing */
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_Enabled     ( 1UL )                                            /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event AUTOCOLRESSTARTED will publish to. */
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Pos      ( 0UL )                                                /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_COLLISION */
/* Description: Publish configuration for event COLLISION */

/* Bit 31 :   */
#define NFCT_PUBLISH_COLLISION_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define NFCT_PUBLISH_COLLISION_EN_Msk         ( 0x1UL << NFCT_PUBLISH_COLLISION_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_COLLISION_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define NFCT_PUBLISH_COLLISION_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event COLLISION will publish to. */
#define NFCT_PUBLISH_COLLISION_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_COLLISION_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_COLLISION_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_SELECTED */
/* Description: Publish configuration for event SELECTED */

/* Bit 31 :   */
#define NFCT_PUBLISH_SELECTED_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define NFCT_PUBLISH_SELECTED_EN_Msk         ( 0x1UL << NFCT_PUBLISH_SELECTED_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_SELECTED_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define NFCT_PUBLISH_SELECTED_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SELECTED will publish to. */
#define NFCT_PUBLISH_SELECTED_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_SELECTED_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_SELECTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_PUBLISH_STARTED */
/* Description: Publish configuration for event STARTED */

/* Bit 31 :   */
#define NFCT_PUBLISH_STARTED_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define NFCT_PUBLISH_STARTED_EN_Msk         ( 0x1UL << NFCT_PUBLISH_STARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define NFCT_PUBLISH_STARTED_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define NFCT_PUBLISH_STARTED_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STARTED will publish to. */
#define NFCT_PUBLISH_STARTED_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define NFCT_PUBLISH_STARTED_CHIDX_Msk      ( 0xFFUL << NFCT_PUBLISH_STARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: NFCT_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 5 : Shortcut between event TXFRAMEEND and task ENABLERXDATA */
#define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Pos         ( 5UL )                                              /*!< Position of TXFRAMEEND_ENABLERXDATA field. */
#define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Msk         ( 0x1UL << NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Pos ) /*!< Bit mask of TXFRAMEEND_ENABLERXDATA field. */
#define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Disabled    ( 0UL )                                              /*!< Disable shortcut */
#define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_Enabled     ( 1UL )                                              /*!< Enable shortcut */

/* Bit 1 : Shortcut between event FIELDLOST and task SENSE */
#define NFCT_SHORTS_FIELDLOST_SENSE_Pos                 ( 1UL )                                      /*!< Position of FIELDLOST_SENSE field. */
#define NFCT_SHORTS_FIELDLOST_SENSE_Msk                 ( 0x1UL << NFCT_SHORTS_FIELDLOST_SENSE_Pos ) /*!< Bit mask of FIELDLOST_SENSE field. */
#define NFCT_SHORTS_FIELDLOST_SENSE_Disabled            ( 0UL )                                      /*!< Disable shortcut */
#define NFCT_SHORTS_FIELDLOST_SENSE_Enabled             ( 1UL )                                      /*!< Enable shortcut */

