FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : Shortcut between event FIELDDETECTED and task ACTIVATE */
#define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Pos          ( 0UL )                                             /*!< Position of FIELDDETECTED_ACTIVATE field. */
#define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Msk          ( 0x1UL << NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Pos ) /*!< Bit mask of FIELDDETECTED_ACTIVATE field. */
#define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Disabled     ( 0UL )                                             /*!< Disable shortcut */
#define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_Enabled      ( 1UL )                                             /*!< Enable shortcut */

/* Register: NFCT_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 20 : Enable or disable interrupt for event STARTED */
#define NFCT_INTEN_STARTED_Pos                   ( 20UL )                            /*!< Position of STARTED field. */
#define NFCT_INTEN_STARTED_Msk                   ( 0x1UL << NFCT_INTEN_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define NFCT_INTEN_STARTED_Disabled              ( 0UL )                             /*!< Disable */
#define NFCT_INTEN_STARTED_Enabled               ( 1UL )                             /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event SELECTED */
#define NFCT_INTEN_SELECTED_Pos                  ( 19UL )                             /*!< Position of SELECTED field. */
#define NFCT_INTEN_SELECTED_Msk                  ( 0x1UL << NFCT_INTEN_SELECTED_Pos ) /*!< Bit mask of SELECTED field. */
#define NFCT_INTEN_SELECTED_Disabled             ( 0UL )                              /*!< Disable */
#define NFCT_INTEN_SELECTED_Enabled              ( 1UL )                              /*!< Enable */

/* Bit 18 : Enable or disable interrupt for event COLLISION */
#define NFCT_INTEN_COLLISION_Pos                 ( 18UL )                              /*!< Position of COLLISION field. */
#define NFCT_INTEN_COLLISION_Msk                 ( 0x1UL << NFCT_INTEN_COLLISION_Pos ) /*!< Bit mask of COLLISION field. */
#define NFCT_INTEN_COLLISION_Disabled            ( 0UL )                               /*!< Disable */
#define NFCT_INTEN_COLLISION_Enabled             ( 1UL )                               /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event AUTOCOLRESSTARTED */
#define NFCT_INTEN_AUTOCOLRESSTARTED_Pos         ( 14UL )                                      /*!< Position of AUTOCOLRESSTARTED field. */
#define NFCT_INTEN_AUTOCOLRESSTARTED_Msk         ( 0x1UL << NFCT_INTEN_AUTOCOLRESSTARTED_Pos ) /*!< Bit mask of AUTOCOLRESSTARTED field. */
#define NFCT_INTEN_AUTOCOLRESSTARTED_Disabled    ( 0UL )                                       /*!< Disable */
#define NFCT_INTEN_AUTOCOLRESSTARTED_Enabled     ( 1UL )                                       /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event ENDTX */
#define NFCT_INTEN_ENDTX_Pos                     ( 12UL )                          /*!< Position of ENDTX field. */
#define NFCT_INTEN_ENDTX_Msk                     ( 0x1UL << NFCT_INTEN_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define NFCT_INTEN_ENDTX_Disabled                ( 0UL )                           /*!< Disable */
#define NFCT_INTEN_ENDTX_Enabled                 ( 1UL )                           /*!< Enable */

/* Bit 11 : Enable or disable interrupt for event ENDRX */
#define NFCT_INTEN_ENDRX_Pos                     ( 11UL )                          /*!< Position of ENDRX field. */
#define NFCT_INTEN_ENDRX_Msk                     ( 0x1UL << NFCT_INTEN_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define NFCT_INTEN_ENDRX_Disabled                ( 0UL )                           /*!< Disable */
#define NFCT_INTEN_ENDRX_Enabled                 ( 1UL )                           /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event RXERROR */
#define NFCT_INTEN_RXERROR_Pos                   ( 10UL )                            /*!< Position of RXERROR field. */
#define NFCT_INTEN_RXERROR_Msk                   ( 0x1UL << NFCT_INTEN_RXERROR_Pos ) /*!< Bit mask of RXERROR field. */
#define NFCT_INTEN_RXERROR_Disabled              ( 0UL )                             /*!< Disable */
#define NFCT_INTEN_RXERROR_Enabled               ( 1UL )                             /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event ERROR */
#define NFCT_INTEN_ERROR_Pos                     ( 7UL )                           /*!< Position of ERROR field. */
#define NFCT_INTEN_ERROR_Msk                     ( 0x1UL << NFCT_INTEN_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define NFCT_INTEN_ERROR_Disabled                ( 0UL )                           /*!< Disable */
#define NFCT_INTEN_ERROR_Enabled                 ( 1UL )                           /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event RXFRAMEEND */
#define NFCT_INTEN_RXFRAMEEND_Pos                ( 6UL )                                /*!< Position of RXFRAMEEND field. */
#define NFCT_INTEN_RXFRAMEEND_Msk                ( 0x1UL << NFCT_INTEN_RXFRAMEEND_Pos ) /*!< Bit mask of RXFRAMEEND field. */
#define NFCT_INTEN_RXFRAMEEND_Disabled           ( 0UL )                                /*!< Disable */
#define NFCT_INTEN_RXFRAMEEND_Enabled            ( 1UL )                                /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event RXFRAMESTART */
#define NFCT_INTEN_RXFRAMESTART_Pos              ( 5UL )                                  /*!< Position of RXFRAMESTART field. */
#define NFCT_INTEN_RXFRAMESTART_Msk              ( 0x1UL << NFCT_INTEN_RXFRAMESTART_Pos ) /*!< Bit mask of RXFRAMESTART field. */
#define NFCT_INTEN_RXFRAMESTART_Disabled         ( 0UL )                                  /*!< Disable */
#define NFCT_INTEN_RXFRAMESTART_Enabled          ( 1UL )                                  /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event TXFRAMEEND */
#define NFCT_INTEN_TXFRAMEEND_Pos                ( 4UL )                                /*!< Position of TXFRAMEEND field. */
#define NFCT_INTEN_TXFRAMEEND_Msk                ( 0x1UL << NFCT_INTEN_TXFRAMEEND_Pos ) /*!< Bit mask of TXFRAMEEND field. */
#define NFCT_INTEN_TXFRAMEEND_Disabled           ( 0UL )                                /*!< Disable */
#define NFCT_INTEN_TXFRAMEEND_Enabled            ( 1UL )                                /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event TXFRAMESTART */
#define NFCT_INTEN_TXFRAMESTART_Pos              ( 3UL )                                  /*!< Position of TXFRAMESTART field. */
#define NFCT_INTEN_TXFRAMESTART_Msk              ( 0x1UL << NFCT_INTEN_TXFRAMESTART_Pos ) /*!< Bit mask of TXFRAMESTART field. */
#define NFCT_INTEN_TXFRAMESTART_Disabled         ( 0UL )                                  /*!< Disable */
#define NFCT_INTEN_TXFRAMESTART_Enabled          ( 1UL )                                  /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event FIELDLOST */
#define NFCT_INTEN_FIELDLOST_Pos                 ( 2UL )                               /*!< Position of FIELDLOST field. */
#define NFCT_INTEN_FIELDLOST_Msk                 ( 0x1UL << NFCT_INTEN_FIELDLOST_Pos ) /*!< Bit mask of FIELDLOST field. */
#define NFCT_INTEN_FIELDLOST_Disabled            ( 0UL )                               /*!< Disable */
#define NFCT_INTEN_FIELDLOST_Enabled             ( 1UL )                               /*!< Enable */

