FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Enable or disable interrupt for event FIELDDETECTED */
#define NFCT_INTEN_FIELDDETECTED_Pos             ( 1UL )                                   /*!< Position of FIELDDETECTED field. */
#define NFCT_INTEN_FIELDDETECTED_Msk             ( 0x1UL << NFCT_INTEN_FIELDDETECTED_Pos ) /*!< Bit mask of FIELDDETECTED field. */
#define NFCT_INTEN_FIELDDETECTED_Disabled        ( 0UL )                                   /*!< Disable */
#define NFCT_INTEN_FIELDDETECTED_Enabled         ( 1UL )                                   /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event READY */
#define NFCT_INTEN_READY_Pos                     ( 0UL )                           /*!< Position of READY field. */
#define NFCT_INTEN_READY_Msk                     ( 0x1UL << NFCT_INTEN_READY_Pos ) /*!< Bit mask of READY field. */
#define NFCT_INTEN_READY_Disabled                ( 0UL )                           /*!< Disable */
#define NFCT_INTEN_READY_Enabled                 ( 1UL )                           /*!< Enable */

/* Register: NFCT_INTENSET */
/* Description: Enable interrupt */

/* Bit 20 : Write '1' to enable interrupt for event STARTED */
#define NFCT_INTENSET_STARTED_Pos                   ( 20UL )                               /*!< Position of STARTED field. */
#define NFCT_INTENSET_STARTED_Msk                   ( 0x1UL << NFCT_INTENSET_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define NFCT_INTENSET_STARTED_Disabled              ( 0UL )                                /*!< Read: Disabled */
#define NFCT_INTENSET_STARTED_Enabled               ( 1UL )                                /*!< Read: Enabled */
#define NFCT_INTENSET_STARTED_Set                   ( 1UL )                                /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event SELECTED */
#define NFCT_INTENSET_SELECTED_Pos                  ( 19UL )                                /*!< Position of SELECTED field. */
#define NFCT_INTENSET_SELECTED_Msk                  ( 0x1UL << NFCT_INTENSET_SELECTED_Pos ) /*!< Bit mask of SELECTED field. */
#define NFCT_INTENSET_SELECTED_Disabled             ( 0UL )                                 /*!< Read: Disabled */
#define NFCT_INTENSET_SELECTED_Enabled              ( 1UL )                                 /*!< Read: Enabled */
#define NFCT_INTENSET_SELECTED_Set                  ( 1UL )                                 /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event COLLISION */
#define NFCT_INTENSET_COLLISION_Pos                 ( 18UL )                                 /*!< Position of COLLISION field. */
#define NFCT_INTENSET_COLLISION_Msk                 ( 0x1UL << NFCT_INTENSET_COLLISION_Pos ) /*!< Bit mask of COLLISION field. */
#define NFCT_INTENSET_COLLISION_Disabled            ( 0UL )                                  /*!< Read: Disabled */
#define NFCT_INTENSET_COLLISION_Enabled             ( 1UL )                                  /*!< Read: Enabled */
#define NFCT_INTENSET_COLLISION_Set                 ( 1UL )                                  /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event AUTOCOLRESSTARTED */
#define NFCT_INTENSET_AUTOCOLRESSTARTED_Pos         ( 14UL )                                         /*!< Position of AUTOCOLRESSTARTED field. */
#define NFCT_INTENSET_AUTOCOLRESSTARTED_Msk         ( 0x1UL << NFCT_INTENSET_AUTOCOLRESSTARTED_Pos ) /*!< Bit mask of AUTOCOLRESSTARTED field. */
#define NFCT_INTENSET_AUTOCOLRESSTARTED_Disabled    ( 0UL )                                          /*!< Read: Disabled */
#define NFCT_INTENSET_AUTOCOLRESSTARTED_Enabled     ( 1UL )                                          /*!< Read: Enabled */
#define NFCT_INTENSET_AUTOCOLRESSTARTED_Set         ( 1UL )                                          /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event ENDTX */
#define NFCT_INTENSET_ENDTX_Pos                     ( 12UL )                             /*!< Position of ENDTX field. */
#define NFCT_INTENSET_ENDTX_Msk                     ( 0x1UL << NFCT_INTENSET_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define NFCT_INTENSET_ENDTX_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENSET_ENDTX_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENSET_ENDTX_Set                     ( 1UL )                              /*!< Enable */

/* Bit 11 : Write '1' to enable interrupt for event ENDRX */
#define NFCT_INTENSET_ENDRX_Pos                     ( 11UL )                             /*!< Position of ENDRX field. */
#define NFCT_INTENSET_ENDRX_Msk                     ( 0x1UL << NFCT_INTENSET_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define NFCT_INTENSET_ENDRX_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENSET_ENDRX_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENSET_ENDRX_Set                     ( 1UL )                              /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event RXERROR */
#define NFCT_INTENSET_RXERROR_Pos                   ( 10UL )                               /*!< Position of RXERROR field. */
#define NFCT_INTENSET_RXERROR_Msk                   ( 0x1UL << NFCT_INTENSET_RXERROR_Pos ) /*!< Bit mask of RXERROR field. */
#define NFCT_INTENSET_RXERROR_Disabled              ( 0UL )                                /*!< Read: Disabled */
#define NFCT_INTENSET_RXERROR_Enabled               ( 1UL )                                /*!< Read: Enabled */
#define NFCT_INTENSET_RXERROR_Set                   ( 1UL )                                /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event ERROR */
#define NFCT_INTENSET_ERROR_Pos                     ( 7UL )                              /*!< Position of ERROR field. */
#define NFCT_INTENSET_ERROR_Msk                     ( 0x1UL << NFCT_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define NFCT_INTENSET_ERROR_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENSET_ERROR_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENSET_ERROR_Set                     ( 1UL )                              /*!< Enable */

