FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 6 : Write '1' to enable interrupt for event RXFRAMEEND */
#define NFCT_INTENSET_RXFRAMEEND_Pos                ( 6UL )                                   /*!< Position of RXFRAMEEND field. */
#define NFCT_INTENSET_RXFRAMEEND_Msk                ( 0x1UL << NFCT_INTENSET_RXFRAMEEND_Pos ) /*!< Bit mask of RXFRAMEEND field. */
#define NFCT_INTENSET_RXFRAMEEND_Disabled           ( 0UL )                                   /*!< Read: Disabled */
#define NFCT_INTENSET_RXFRAMEEND_Enabled            ( 1UL )                                   /*!< Read: Enabled */
#define NFCT_INTENSET_RXFRAMEEND_Set                ( 1UL )                                   /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event RXFRAMESTART */
#define NFCT_INTENSET_RXFRAMESTART_Pos              ( 5UL )                                     /*!< Position of RXFRAMESTART field. */
#define NFCT_INTENSET_RXFRAMESTART_Msk              ( 0x1UL << NFCT_INTENSET_RXFRAMESTART_Pos ) /*!< Bit mask of RXFRAMESTART field. */
#define NFCT_INTENSET_RXFRAMESTART_Disabled         ( 0UL )                                     /*!< Read: Disabled */
#define NFCT_INTENSET_RXFRAMESTART_Enabled          ( 1UL )                                     /*!< Read: Enabled */
#define NFCT_INTENSET_RXFRAMESTART_Set              ( 1UL )                                     /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event TXFRAMEEND */
#define NFCT_INTENSET_TXFRAMEEND_Pos                ( 4UL )                                   /*!< Position of TXFRAMEEND field. */
#define NFCT_INTENSET_TXFRAMEEND_Msk                ( 0x1UL << NFCT_INTENSET_TXFRAMEEND_Pos ) /*!< Bit mask of TXFRAMEEND field. */
#define NFCT_INTENSET_TXFRAMEEND_Disabled           ( 0UL )                                   /*!< Read: Disabled */
#define NFCT_INTENSET_TXFRAMEEND_Enabled            ( 1UL )                                   /*!< Read: Enabled */
#define NFCT_INTENSET_TXFRAMEEND_Set                ( 1UL )                                   /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event TXFRAMESTART */
#define NFCT_INTENSET_TXFRAMESTART_Pos              ( 3UL )                                     /*!< Position of TXFRAMESTART field. */
#define NFCT_INTENSET_TXFRAMESTART_Msk              ( 0x1UL << NFCT_INTENSET_TXFRAMESTART_Pos ) /*!< Bit mask of TXFRAMESTART field. */
#define NFCT_INTENSET_TXFRAMESTART_Disabled         ( 0UL )                                     /*!< Read: Disabled */
#define NFCT_INTENSET_TXFRAMESTART_Enabled          ( 1UL )                                     /*!< Read: Enabled */
#define NFCT_INTENSET_TXFRAMESTART_Set              ( 1UL )                                     /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event FIELDLOST */
#define NFCT_INTENSET_FIELDLOST_Pos                 ( 2UL )                                  /*!< Position of FIELDLOST field. */
#define NFCT_INTENSET_FIELDLOST_Msk                 ( 0x1UL << NFCT_INTENSET_FIELDLOST_Pos ) /*!< Bit mask of FIELDLOST field. */
#define NFCT_INTENSET_FIELDLOST_Disabled            ( 0UL )                                  /*!< Read: Disabled */
#define NFCT_INTENSET_FIELDLOST_Enabled             ( 1UL )                                  /*!< Read: Enabled */
#define NFCT_INTENSET_FIELDLOST_Set                 ( 1UL )                                  /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event FIELDDETECTED */
#define NFCT_INTENSET_FIELDDETECTED_Pos             ( 1UL )                                      /*!< Position of FIELDDETECTED field. */
#define NFCT_INTENSET_FIELDDETECTED_Msk             ( 0x1UL << NFCT_INTENSET_FIELDDETECTED_Pos ) /*!< Bit mask of FIELDDETECTED field. */
#define NFCT_INTENSET_FIELDDETECTED_Disabled        ( 0UL )                                      /*!< Read: Disabled */
#define NFCT_INTENSET_FIELDDETECTED_Enabled         ( 1UL )                                      /*!< Read: Enabled */
#define NFCT_INTENSET_FIELDDETECTED_Set             ( 1UL )                                      /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event READY */
#define NFCT_INTENSET_READY_Pos                     ( 0UL )                              /*!< Position of READY field. */
#define NFCT_INTENSET_READY_Msk                     ( 0x1UL << NFCT_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define NFCT_INTENSET_READY_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENSET_READY_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENSET_READY_Set                     ( 1UL )                              /*!< Enable */

/* Register: NFCT_INTENCLR */
/* Description: Disable interrupt */

/* Bit 20 : Write '1' to disable interrupt for event STARTED */
#define NFCT_INTENCLR_STARTED_Pos                   ( 20UL )                               /*!< Position of STARTED field. */
#define NFCT_INTENCLR_STARTED_Msk                   ( 0x1UL << NFCT_INTENCLR_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define NFCT_INTENCLR_STARTED_Disabled              ( 0UL )                                /*!< Read: Disabled */
#define NFCT_INTENCLR_STARTED_Enabled               ( 1UL )                                /*!< Read: Enabled */
#define NFCT_INTENCLR_STARTED_Clear                 ( 1UL )                                /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event SELECTED */
#define NFCT_INTENCLR_SELECTED_Pos                  ( 19UL )                                /*!< Position of SELECTED field. */
#define NFCT_INTENCLR_SELECTED_Msk                  ( 0x1UL << NFCT_INTENCLR_SELECTED_Pos ) /*!< Bit mask of SELECTED field. */
#define NFCT_INTENCLR_SELECTED_Disabled             ( 0UL )                                 /*!< Read: Disabled */
#define NFCT_INTENCLR_SELECTED_Enabled              ( 1UL )                                 /*!< Read: Enabled */
#define NFCT_INTENCLR_SELECTED_Clear                ( 1UL )                                 /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event COLLISION */
#define NFCT_INTENCLR_COLLISION_Pos                 ( 18UL )                                 /*!< Position of COLLISION field. */
#define NFCT_INTENCLR_COLLISION_Msk                 ( 0x1UL << NFCT_INTENCLR_COLLISION_Pos ) /*!< Bit mask of COLLISION field. */
#define NFCT_INTENCLR_COLLISION_Disabled            ( 0UL )                                  /*!< Read: Disabled */
#define NFCT_INTENCLR_COLLISION_Enabled             ( 1UL )                                  /*!< Read: Enabled */
#define NFCT_INTENCLR_COLLISION_Clear               ( 1UL )                                  /*!< Disable */

/* Bit 14 : Write '1' to disable interrupt for event AUTOCOLRESSTARTED */
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_Pos         ( 14UL )                                         /*!< Position of AUTOCOLRESSTARTED field. */
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_Msk         ( 0x1UL << NFCT_INTENCLR_AUTOCOLRESSTARTED_Pos ) /*!< Bit mask of AUTOCOLRESSTARTED field. */
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_Disabled    ( 0UL )                                          /*!< Read: Disabled */
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_Enabled     ( 1UL )                                          /*!< Read: Enabled */
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_Clear       ( 1UL )                                          /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event ENDTX */
#define NFCT_INTENCLR_ENDTX_Pos                     ( 12UL )                             /*!< Position of ENDTX field. */
#define NFCT_INTENCLR_ENDTX_Msk                     ( 0x1UL << NFCT_INTENCLR_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define NFCT_INTENCLR_ENDTX_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENCLR_ENDTX_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENCLR_ENDTX_Clear                   ( 1UL )                              /*!< Disable */

/* Bit 11 : Write '1' to disable interrupt for event ENDRX */
#define NFCT_INTENCLR_ENDRX_Pos                     ( 11UL )                             /*!< Position of ENDRX field. */
#define NFCT_INTENCLR_ENDRX_Msk                     ( 0x1UL << NFCT_INTENCLR_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define NFCT_INTENCLR_ENDRX_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENCLR_ENDRX_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENCLR_ENDRX_Clear                   ( 1UL )                              /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event RXERROR */
#define NFCT_INTENCLR_RXERROR_Pos                   ( 10UL )                               /*!< Position of RXERROR field. */
#define NFCT_INTENCLR_RXERROR_Msk                   ( 0x1UL << NFCT_INTENCLR_RXERROR_Pos ) /*!< Bit mask of RXERROR field. */
#define NFCT_INTENCLR_RXERROR_Disabled              ( 0UL )                                /*!< Read: Disabled */
#define NFCT_INTENCLR_RXERROR_Enabled               ( 1UL )                                /*!< Read: Enabled */
#define NFCT_INTENCLR_RXERROR_Clear                 ( 1UL )                                /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event ERROR */
#define NFCT_INTENCLR_ERROR_Pos                     ( 7UL )                              /*!< Position of ERROR field. */
#define NFCT_INTENCLR_ERROR_Msk                     ( 0x1UL << NFCT_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define NFCT_INTENCLR_ERROR_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENCLR_ERROR_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENCLR_ERROR_Clear                   ( 1UL )                              /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event RXFRAMEEND */
#define NFCT_INTENCLR_RXFRAMEEND_Pos                ( 6UL )                                   /*!< Position of RXFRAMEEND field. */
#define NFCT_INTENCLR_RXFRAMEEND_Msk                ( 0x1UL << NFCT_INTENCLR_RXFRAMEEND_Pos ) /*!< Bit mask of RXFRAMEEND field. */
#define NFCT_INTENCLR_RXFRAMEEND_Disabled           ( 0UL )                                   /*!< Read: Disabled */
#define NFCT_INTENCLR_RXFRAMEEND_Enabled            ( 1UL )                                   /*!< Read: Enabled */
#define NFCT_INTENCLR_RXFRAMEEND_Clear              ( 1UL )                                   /*!< Disable */

