FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 5 : Write '1' to disable interrupt for event RXFRAMESTART */
#define NFCT_INTENCLR_RXFRAMESTART_Pos              ( 5UL )                                     /*!< Position of RXFRAMESTART field. */
#define NFCT_INTENCLR_RXFRAMESTART_Msk              ( 0x1UL << NFCT_INTENCLR_RXFRAMESTART_Pos ) /*!< Bit mask of RXFRAMESTART field. */
#define NFCT_INTENCLR_RXFRAMESTART_Disabled         ( 0UL )                                     /*!< Read: Disabled */
#define NFCT_INTENCLR_RXFRAMESTART_Enabled          ( 1UL )                                     /*!< Read: Enabled */
#define NFCT_INTENCLR_RXFRAMESTART_Clear            ( 1UL )                                     /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event TXFRAMEEND */
#define NFCT_INTENCLR_TXFRAMEEND_Pos                ( 4UL )                                   /*!< Position of TXFRAMEEND field. */
#define NFCT_INTENCLR_TXFRAMEEND_Msk                ( 0x1UL << NFCT_INTENCLR_TXFRAMEEND_Pos ) /*!< Bit mask of TXFRAMEEND field. */
#define NFCT_INTENCLR_TXFRAMEEND_Disabled           ( 0UL )                                   /*!< Read: Disabled */
#define NFCT_INTENCLR_TXFRAMEEND_Enabled            ( 1UL )                                   /*!< Read: Enabled */
#define NFCT_INTENCLR_TXFRAMEEND_Clear              ( 1UL )                                   /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event TXFRAMESTART */
#define NFCT_INTENCLR_TXFRAMESTART_Pos              ( 3UL )                                     /*!< Position of TXFRAMESTART field. */
#define NFCT_INTENCLR_TXFRAMESTART_Msk              ( 0x1UL << NFCT_INTENCLR_TXFRAMESTART_Pos ) /*!< Bit mask of TXFRAMESTART field. */
#define NFCT_INTENCLR_TXFRAMESTART_Disabled         ( 0UL )                                     /*!< Read: Disabled */
#define NFCT_INTENCLR_TXFRAMESTART_Enabled          ( 1UL )                                     /*!< Read: Enabled */
#define NFCT_INTENCLR_TXFRAMESTART_Clear            ( 1UL )                                     /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event FIELDLOST */
#define NFCT_INTENCLR_FIELDLOST_Pos                 ( 2UL )                                  /*!< Position of FIELDLOST field. */
#define NFCT_INTENCLR_FIELDLOST_Msk                 ( 0x1UL << NFCT_INTENCLR_FIELDLOST_Pos ) /*!< Bit mask of FIELDLOST field. */
#define NFCT_INTENCLR_FIELDLOST_Disabled            ( 0UL )                                  /*!< Read: Disabled */
#define NFCT_INTENCLR_FIELDLOST_Enabled             ( 1UL )                                  /*!< Read: Enabled */
#define NFCT_INTENCLR_FIELDLOST_Clear               ( 1UL )                                  /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event FIELDDETECTED */
#define NFCT_INTENCLR_FIELDDETECTED_Pos             ( 1UL )                                      /*!< Position of FIELDDETECTED field. */
#define NFCT_INTENCLR_FIELDDETECTED_Msk             ( 0x1UL << NFCT_INTENCLR_FIELDDETECTED_Pos ) /*!< Bit mask of FIELDDETECTED field. */
#define NFCT_INTENCLR_FIELDDETECTED_Disabled        ( 0UL )                                      /*!< Read: Disabled */
#define NFCT_INTENCLR_FIELDDETECTED_Enabled         ( 1UL )                                      /*!< Read: Enabled */
#define NFCT_INTENCLR_FIELDDETECTED_Clear           ( 1UL )                                      /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event READY */
#define NFCT_INTENCLR_READY_Pos                     ( 0UL )                              /*!< Position of READY field. */
#define NFCT_INTENCLR_READY_Msk                     ( 0x1UL << NFCT_INTENCLR_READY_Pos ) /*!< Bit mask of READY field. */
#define NFCT_INTENCLR_READY_Disabled                ( 0UL )                              /*!< Read: Disabled */
#define NFCT_INTENCLR_READY_Enabled                 ( 1UL )                              /*!< Read: Enabled */
#define NFCT_INTENCLR_READY_Clear                   ( 1UL )                              /*!< Disable */

/* Register: NFCT_ERRORSTATUS */
/* Description: NFC Error Status register */

/* Bit 0 : No STARTTX task triggered before expiration of the time set in FRAMEDELAYMAX */
#define NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Pos    ( 0UL )                                             /*!< Position of FRAMEDELAYTIMEOUT field. */
#define NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Msk    ( 0x1UL << NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT_Pos ) /*!< Bit mask of FRAMEDELAYTIMEOUT field. */

/* Register: NFCT_FRAMESTATUS_RX */
/* Description: Result of last incoming frame */

/* Bit 3 : Overrun detected */
#define NFCT_FRAMESTATUS_RX_OVERRUN_Pos                 ( 3UL )                                      /*!< Position of OVERRUN field. */
#define NFCT_FRAMESTATUS_RX_OVERRUN_Msk                 ( 0x1UL << NFCT_FRAMESTATUS_RX_OVERRUN_Pos ) /*!< Bit mask of OVERRUN field. */
#define NFCT_FRAMESTATUS_RX_OVERRUN_NoOverrun           ( 0UL )                                      /*!< No overrun detected */
#define NFCT_FRAMESTATUS_RX_OVERRUN_Overrun             ( 1UL )                                      /*!< Overrun error */

/* Bit 2 : Parity status of received frame */
#define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos            ( 2UL )                                           /*!< Position of PARITYSTATUS field. */
#define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Msk            ( 0x1UL << NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos ) /*!< Bit mask of PARITYSTATUS field. */
#define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityOK       ( 0UL )                                           /*!< Frame received with parity OK */
#define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityError    ( 1UL )                                           /*!< Frame received with parity error */

/* Bit 0 : No valid end of frame (EoF) detected */
#define NFCT_FRAMESTATUS_RX_CRCERROR_Pos                ( 0UL )                                       /*!< Position of CRCERROR field. */
#define NFCT_FRAMESTATUS_RX_CRCERROR_Msk                ( 0x1UL << NFCT_FRAMESTATUS_RX_CRCERROR_Pos ) /*!< Bit mask of CRCERROR field. */
#define NFCT_FRAMESTATUS_RX_CRCERROR_CRCCorrect         ( 0UL )                                       /*!< Valid CRC detected */
#define NFCT_FRAMESTATUS_RX_CRCERROR_CRCError           ( 1UL )                                       /*!< CRC received does not match local check */

/* Register: NFCT_NFCTAGSTATE */
/* Description: Current operating state of NFC tag */

/* Bits 2..0 : NfcTag state */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_Pos           ( 0UL )                                       /*!< Position of NFCTAGSTATE field. */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_Msk           ( 0x7UL << NFCT_NFCTAGSTATE_NFCTAGSTATE_Pos ) /*!< Bit mask of NFCTAGSTATE field. */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_Disabled      ( 0UL )                                       /*!< Disabled or sense */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_RampUp        ( 2UL )                                       /*!< RampUp */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_Idle          ( 3UL )                                       /*!< Idle */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_Receive       ( 4UL )                                       /*!< Receive */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_FrameDelay    ( 5UL )                                       /*!< FrameDelay */
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_Transmit      ( 6UL )                                       /*!< Transmit */

/* Register: NFCT_SLEEPSTATE */
/* Description: Sleep state during automatic collision resolution */

/* Bit 0 : Reflects the sleep state during automatic collision resolution. Set to IDLE
 *      by a GOIDLE task. Set to SLEEP_A when a valid SLEEP_REQ frame is received or by a
 *      GOSLEEP task. */
#define NFCT_SLEEPSTATE_SLEEPSTATE_Pos       ( 0UL )                                     /*!< Position of SLEEPSTATE field. */
#define NFCT_SLEEPSTATE_SLEEPSTATE_Msk       ( 0x1UL << NFCT_SLEEPSTATE_SLEEPSTATE_Pos ) /*!< Bit mask of SLEEPSTATE field. */
#define NFCT_SLEEPSTATE_SLEEPSTATE_Idle      ( 0UL )                                     /*!< State is IDLE. */
#define NFCT_SLEEPSTATE_SLEEPSTATE_SleepA    ( 1UL )                                     /*!< State is SLEEP_A. */

/* Register: NFCT_FIELDPRESENT */
/* Description: Indicates the presence or not of a valid field */

