FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Indicates if the low level has locked to the field */
#define NFCT_FIELDPRESENT_LOCKDETECT_Pos               ( 1UL )                                       /*!< Position of LOCKDETECT field. */
#define NFCT_FIELDPRESENT_LOCKDETECT_Msk               ( 0x1UL << NFCT_FIELDPRESENT_LOCKDETECT_Pos ) /*!< Bit mask of LOCKDETECT field. */
#define NFCT_FIELDPRESENT_LOCKDETECT_NotLocked         ( 0UL )                                       /*!< Not locked to field */
#define NFCT_FIELDPRESENT_LOCKDETECT_Locked            ( 1UL )                                       /*!< Locked to field */

/* Bit 0 : Indicates if a valid field is present. Available only in the activated state. */
#define NFCT_FIELDPRESENT_FIELDPRESENT_Pos             ( 0UL )                                         /*!< Position of FIELDPRESENT field. */
#define NFCT_FIELDPRESENT_FIELDPRESENT_Msk             ( 0x1UL << NFCT_FIELDPRESENT_FIELDPRESENT_Pos ) /*!< Bit mask of FIELDPRESENT field. */
#define NFCT_FIELDPRESENT_FIELDPRESENT_NoField         ( 0UL )                                         /*!< No valid field detected */
#define NFCT_FIELDPRESENT_FIELDPRESENT_FieldPresent    ( 1UL )                                         /*!< Valid field detected */

/* Register: NFCT_FRAMEDELAYMIN */
/* Description: Minimum frame delay */

/* Bits 15..0 : Minimum frame delay in number of 13.56 MHz clock cycles */
#define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos    ( 0UL )                                              /*!< Position of FRAMEDELAYMIN field. */
#define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Msk    ( 0xFFFFUL << NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos ) /*!< Bit mask of FRAMEDELAYMIN field. */

/* Register: NFCT_FRAMEDELAYMAX */
/* Description: Maximum frame delay */

/* Bits 19..0 : Maximum frame delay in number of 13.56 MHz clock cycles */
#define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos    ( 0UL )                                               /*!< Position of FRAMEDELAYMAX field. */
#define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Msk    ( 0xFFFFFUL << NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos ) /*!< Bit mask of FRAMEDELAYMAX field. */

/* Register: NFCT_FRAMEDELAYMODE */
/* Description: Configuration register for the Frame Delay Timer */

/* Bits 1..0 : Configuration register for the Frame Delay Timer */
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos           ( 0UL )                                             /*!< Position of FRAMEDELAYMODE field. */
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Msk           ( 0x3UL << NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos ) /*!< Bit mask of FRAMEDELAYMODE field. */
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_FreeRun       ( 0UL )                                             /*!< Transmission is independent of frame timer and will start when the STARTTX task is triggered. No timeout. */
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Window        ( 1UL )                                             /*!< Frame is transmitted between FRAMEDELAYMIN and FRAMEDELAYMAX */
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_ExactVal      ( 2UL )                                             /*!< Frame is transmitted exactly at FRAMEDELAYMAX */
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid    ( 3UL )                                             /*!< Frame is transmitted on a bit grid between FRAMEDELAYMIN and FRAMEDELAYMAX */

/* Register: NFCT_PACKETPTR */
/* Description: Packet pointer for TXD and RXD data storage in Data RAM */

/* Bits 31..0 : Packet pointer for TXD and RXD data storage in Data RAM. This address is a byte-aligned RAM address. */
#define NFCT_PACKETPTR_PTR_Pos    ( 0UL )                                    /*!< Position of PTR field. */
#define NFCT_PACKETPTR_PTR_Msk    ( 0xFFFFFFFFUL << NFCT_PACKETPTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: NFCT_MAXLEN */
/* Description: Size of the RAM buffer allocated to TXD and RXD data storage each */

/* Bits 8..0 : Size of the RAM buffer allocated to TXD and RXD data storage each */
#define NFCT_MAXLEN_MAXLEN_Pos    ( 0UL )                               /*!< Position of MAXLEN field. */
#define NFCT_MAXLEN_MAXLEN_Msk    ( 0x1FFUL << NFCT_MAXLEN_MAXLEN_Pos ) /*!< Bit mask of MAXLEN field. */

/* Register: NFCT_TXD_FRAMECONFIG */
/* Description: Configuration of outgoing frames */

/* Bit 4 : CRC mode for outgoing frames */
#define NFCT_TXD_FRAMECONFIG_CRCMODETX_Pos               ( 4UL )                                         /*!< Position of CRCMODETX field. */
#define NFCT_TXD_FRAMECONFIG_CRCMODETX_Msk               ( 0x1UL << NFCT_TXD_FRAMECONFIG_CRCMODETX_Pos ) /*!< Bit mask of CRCMODETX field. */
#define NFCT_TXD_FRAMECONFIG_CRCMODETX_NoCRCTX           ( 0UL )                                         /*!< CRC is not added to the frame */
#define NFCT_TXD_FRAMECONFIG_CRCMODETX_CRC16TX           ( 1UL )                                         /*!< 16 bit CRC added to the frame based on all the data read from RAM that is used in the frame */

/* Bit 2 : Adding SoF or not in TX frames */
#define NFCT_TXD_FRAMECONFIG_SOF_Pos                     ( 2UL )                                   /*!< Position of SOF field. */
#define NFCT_TXD_FRAMECONFIG_SOF_Msk                     ( 0x1UL << NFCT_TXD_FRAMECONFIG_SOF_Pos ) /*!< Bit mask of SOF field. */
#define NFCT_TXD_FRAMECONFIG_SOF_NoSoF                   ( 0UL )                                   /*!< SoF symbol not added */
#define NFCT_TXD_FRAMECONFIG_SOF_SoF                     ( 1UL )                                   /*!< SoF symbol added */

/* Bit 1 : Discarding unused bits at start or end of a frame */
#define NFCT_TXD_FRAMECONFIG_DISCARDMODE_Pos             ( 1UL )                                           /*!< Position of DISCARDMODE field. */
#define NFCT_TXD_FRAMECONFIG_DISCARDMODE_Msk             ( 0x1UL << NFCT_TXD_FRAMECONFIG_DISCARDMODE_Pos ) /*!< Bit mask of DISCARDMODE field. */
#define NFCT_TXD_FRAMECONFIG_DISCARDMODE_DiscardEnd      ( 0UL )                                           /*!< Unused bits are discarded at end of frame (EoF) */
#define NFCT_TXD_FRAMECONFIG_DISCARDMODE_DiscardStart    ( 1UL )                                           /*!< Unused bits are discarded at start of frame (SoF) */

/* Bit 0 : Indicates if parity is added to the frame */
#define NFCT_TXD_FRAMECONFIG_PARITY_Pos                  ( 0UL )                                      /*!< Position of PARITY field. */
#define NFCT_TXD_FRAMECONFIG_PARITY_Msk                  ( 0x1UL << NFCT_TXD_FRAMECONFIG_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define NFCT_TXD_FRAMECONFIG_PARITY_NoParity             ( 0UL )                                      /*!< Parity is not added to TX frames */
#define NFCT_TXD_FRAMECONFIG_PARITY_Parity               ( 1UL )                                      /*!< Parity is added to TX frames */

/* Register: NFCT_TXD_AMOUNT */
/* Description: Size of outgoing frame */

