FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 11..3 : Number of complete bytes that shall be included in the frame, excluding CRC, parity, and framing. */
#define NFCT_TXD_AMOUNT_TXDATABYTES_Pos    ( 3UL )                                        /*!< Position of TXDATABYTES field. */
#define NFCT_TXD_AMOUNT_TXDATABYTES_Msk    ( 0x1FFUL << NFCT_TXD_AMOUNT_TXDATABYTES_Pos ) /*!< Bit mask of TXDATABYTES field. */

/* Bits 2..0 : Number of bits in the last or first byte read from RAM that shall be included in the frame (excluding parity bit). */
#define NFCT_TXD_AMOUNT_TXDATABITS_Pos     ( 0UL )                                     /*!< Position of TXDATABITS field. */
#define NFCT_TXD_AMOUNT_TXDATABITS_Msk     ( 0x7UL << NFCT_TXD_AMOUNT_TXDATABITS_Pos ) /*!< Bit mask of TXDATABITS field. */

/* Register: NFCT_RXD_FRAMECONFIG */
/* Description: Configuration of incoming frames */

/* Bit 4 : CRC mode for incoming frames */
#define NFCT_RXD_FRAMECONFIG_CRCMODERX_Pos        ( 4UL )                                         /*!< Position of CRCMODERX field. */
#define NFCT_RXD_FRAMECONFIG_CRCMODERX_Msk        ( 0x1UL << NFCT_RXD_FRAMECONFIG_CRCMODERX_Pos ) /*!< Bit mask of CRCMODERX field. */
#define NFCT_RXD_FRAMECONFIG_CRCMODERX_NoCRCRX    ( 0UL )                                         /*!< CRC is not expected in RX frames */
#define NFCT_RXD_FRAMECONFIG_CRCMODERX_CRC16RX    ( 1UL )                                         /*!< Last 16 bits in RX frame is CRC, CRC is checked and CRCSTATUS updated */

/* Bit 2 : SoF expected or not in RX frames */
#define NFCT_RXD_FRAMECONFIG_SOF_Pos              ( 2UL )                                   /*!< Position of SOF field. */
#define NFCT_RXD_FRAMECONFIG_SOF_Msk              ( 0x1UL << NFCT_RXD_FRAMECONFIG_SOF_Pos ) /*!< Bit mask of SOF field. */
#define NFCT_RXD_FRAMECONFIG_SOF_NoSoF            ( 0UL )                                   /*!< SoF symbol is not expected in RX frames */
#define NFCT_RXD_FRAMECONFIG_SOF_SoF              ( 1UL )                                   /*!< SoF symbol is expected in RX frames */

/* Bit 0 : Indicates if parity expected in RX frame */
#define NFCT_RXD_FRAMECONFIG_PARITY_Pos           ( 0UL )                                      /*!< Position of PARITY field. */
#define NFCT_RXD_FRAMECONFIG_PARITY_Msk           ( 0x1UL << NFCT_RXD_FRAMECONFIG_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define NFCT_RXD_FRAMECONFIG_PARITY_NoParity      ( 0UL )                                      /*!< Parity is not expected in RX frames */
#define NFCT_RXD_FRAMECONFIG_PARITY_Parity        ( 1UL )                                      /*!< Parity is expected in RX frames */

/* Register: NFCT_RXD_AMOUNT */
/* Description: Size of last incoming frame */

/* Bits 11..3 : Number of complete bytes received in the frame (including CRC, but excluding parity and SoF/EoF framing) */
#define NFCT_RXD_AMOUNT_RXDATABYTES_Pos    ( 3UL )                                        /*!< Position of RXDATABYTES field. */
#define NFCT_RXD_AMOUNT_RXDATABYTES_Msk    ( 0x1FFUL << NFCT_RXD_AMOUNT_RXDATABYTES_Pos ) /*!< Bit mask of RXDATABYTES field. */

/* Bits 2..0 : Number of bits in the last byte in the frame, if less than 8 (including CRC, but excluding parity and SoF/EoF framing). */
#define NFCT_RXD_AMOUNT_RXDATABITS_Pos     ( 0UL )                                     /*!< Position of RXDATABITS field. */
#define NFCT_RXD_AMOUNT_RXDATABITS_Msk     ( 0x7UL << NFCT_RXD_AMOUNT_RXDATABITS_Pos ) /*!< Bit mask of RXDATABITS field. */

/* Register: NFCT_MODULATIONCTRL */
/* Description: Enables the modulation output to a GPIO pin which can be connected to a second external antenna. */

/* Bits 1..0 : Configuration of modulation control. */
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos                     ( 0UL )                                             /*!< Position of MODULATIONCTRL field. */
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_Msk                     ( 0x3UL << NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos ) /*!< Bit mask of MODULATIONCTRL field. */
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_Invalid                 ( 0x0UL )                                           /*!< Invalid, defaults to same behaviour as for Internal */
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_Internal                ( 0x1UL )                                           /*!< Use internal modulator only */
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_ModToGpio               ( 0x2UL )                                           /*!< Output digital modulation signal to a GPIO pin. */
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_InternalAndModToGpio    ( 0x3UL )                                           /*!< Use internal modulator and output digital modulation signal to a GPIO pin. */

/* Register: NFCT_MODULATIONPSEL */
/* Description: Pin select for Modulation control */

/* Bit 31 : Connection */
#define NFCT_MODULATIONPSEL_CONNECT_Pos             ( 31UL )                                     /*!< Position of CONNECT field. */
#define NFCT_MODULATIONPSEL_CONNECT_Msk             ( 0x1UL << NFCT_MODULATIONPSEL_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define NFCT_MODULATIONPSEL_CONNECT_Connected       ( 0UL )                                      /*!< Connect */
#define NFCT_MODULATIONPSEL_CONNECT_Disconnected    ( 1UL )                                      /*!< Disconnect */

/* Bit 5 : Port number */
#define NFCT_MODULATIONPSEL_PORT_Pos                ( 5UL )                                   /*!< Position of PORT field. */
#define NFCT_MODULATIONPSEL_PORT_Msk                ( 0x1UL << NFCT_MODULATIONPSEL_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define NFCT_MODULATIONPSEL_PIN_Pos                 ( 0UL )                                   /*!< Position of PIN field. */
#define NFCT_MODULATIONPSEL_PIN_Msk                 ( 0x1FUL << NFCT_MODULATIONPSEL_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: NFCT_NFCID1_LAST */
/* Description: Last NFCID1 part (4, 7 or 10 bytes ID) */

/* Bits 31..24 : NFCID1 byte W */
#define NFCT_NFCID1_LAST_NFCID1_W_Pos    ( 24UL )                                    /*!< Position of NFCID1_W field. */
#define NFCT_NFCID1_LAST_NFCID1_W_Msk    ( 0xFFUL << NFCT_NFCID1_LAST_NFCID1_W_Pos ) /*!< Bit mask of NFCID1_W field. */

/* Bits 23..16 : NFCID1 byte X */
#define NFCT_NFCID1_LAST_NFCID1_X_Pos    ( 16UL )                                    /*!< Position of NFCID1_X field. */
#define NFCT_NFCID1_LAST_NFCID1_X_Msk    ( 0xFFUL << NFCT_NFCID1_LAST_NFCID1_X_Pos ) /*!< Bit mask of NFCID1_X field. */

/* Bits 15..8 : NFCID1 byte Y */
#define NFCT_NFCID1_LAST_NFCID1_Y_Pos    ( 8UL )                                     /*!< Position of NFCID1_Y field. */
#define NFCT_NFCID1_LAST_NFCID1_Y_Msk    ( 0xFFUL << NFCT_NFCID1_LAST_NFCID1_Y_Pos ) /*!< Bit mask of NFCID1_Y field. */

/* Bits 7..0 : NFCID1 byte Z (very last byte sent) */
#define NFCT_NFCID1_LAST_NFCID1_Z_Pos    ( 0UL )                                     /*!< Position of NFCID1_Z field. */
#define NFCT_NFCID1_LAST_NFCID1_Z_Msk    ( 0xFFUL << NFCT_NFCID1_LAST_NFCID1_Z_Pos ) /*!< Bit mask of NFCID1_Z field. */

/* Register: NFCT_NFCID1_2ND_LAST */
/* Description: Second last NFCID1 part (7 or 10 bytes ID) */

/* Bits 23..16 : NFCID1 byte T */
#define NFCT_NFCID1_2ND_LAST_NFCID1_T_Pos    ( 16UL )                                        /*!< Position of NFCID1_T field. */
#define NFCT_NFCID1_2ND_LAST_NFCID1_T_Msk    ( 0xFFUL << NFCT_NFCID1_2ND_LAST_NFCID1_T_Pos ) /*!< Bit mask of NFCID1_T field. */

/* Bits 15..8 : NFCID1 byte U */
#define NFCT_NFCID1_2ND_LAST_NFCID1_U_Pos    ( 8UL )                                         /*!< Position of NFCID1_U field. */
#define NFCT_NFCID1_2ND_LAST_NFCID1_U_Msk    ( 0xFFUL << NFCT_NFCID1_2ND_LAST_NFCID1_U_Pos ) /*!< Bit mask of NFCID1_U field. */

/* Bits 7..0 : NFCID1 byte V */
#define NFCT_NFCID1_2ND_LAST_NFCID1_V_Pos    ( 0UL )                                         /*!< Position of NFCID1_V field. */
#define NFCT_NFCID1_2ND_LAST_NFCID1_V_Msk    ( 0xFFUL << NFCT_NFCID1_2ND_LAST_NFCID1_V_Pos ) /*!< Bit mask of NFCID1_V field. */

/* Register: NFCT_NFCID1_3RD_LAST */
/* Description: Third last NFCID1 part (10 bytes ID) */

