FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 23..16 : NFCID1 byte Q */
#define NFCT_NFCID1_3RD_LAST_NFCID1_Q_Pos    ( 16UL )                                        /*!< Position of NFCID1_Q field. */
#define NFCT_NFCID1_3RD_LAST_NFCID1_Q_Msk    ( 0xFFUL << NFCT_NFCID1_3RD_LAST_NFCID1_Q_Pos ) /*!< Bit mask of NFCID1_Q field. */

/* Bits 15..8 : NFCID1 byte R */
#define NFCT_NFCID1_3RD_LAST_NFCID1_R_Pos    ( 8UL )                                         /*!< Position of NFCID1_R field. */
#define NFCT_NFCID1_3RD_LAST_NFCID1_R_Msk    ( 0xFFUL << NFCT_NFCID1_3RD_LAST_NFCID1_R_Pos ) /*!< Bit mask of NFCID1_R field. */

/* Bits 7..0 : NFCID1 byte S */
#define NFCT_NFCID1_3RD_LAST_NFCID1_S_Pos    ( 0UL )                                         /*!< Position of NFCID1_S field. */
#define NFCT_NFCID1_3RD_LAST_NFCID1_S_Msk    ( 0xFFUL << NFCT_NFCID1_3RD_LAST_NFCID1_S_Pos ) /*!< Bit mask of NFCID1_S field. */

/* Register: NFCT_AUTOCOLRESCONFIG */
/* Description: Controls the auto collision resolution function. This setting must be done before the NFCT peripheral is activated. */

/* Bit 0 : Enables/disables auto collision resolution */
#define NFCT_AUTOCOLRESCONFIG_MODE_Pos         ( 0UL )                                     /*!< Position of MODE field. */
#define NFCT_AUTOCOLRESCONFIG_MODE_Msk         ( 0x1UL << NFCT_AUTOCOLRESCONFIG_MODE_Pos ) /*!< Bit mask of MODE field. */
#define NFCT_AUTOCOLRESCONFIG_MODE_Enabled     ( 0UL )                                     /*!< Auto collision resolution enabled */
#define NFCT_AUTOCOLRESCONFIG_MODE_Disabled    ( 1UL )                                     /*!< Auto collision resolution disabled */

/* Register: NFCT_SENSRES */
/* Description: NFC-A SENS_RES auto-response settings */

/* Bits 15..12 : Reserved for future use. Shall be 0. */
#define NFCT_SENSRES_RFU74_Pos                 ( 12UL )                            /*!< Position of RFU74 field. */
#define NFCT_SENSRES_RFU74_Msk                 ( 0xFUL << NFCT_SENSRES_RFU74_Pos ) /*!< Bit mask of RFU74 field. */

/* Bits 11..8 : Tag platform configuration as defined by the b4:b1 of byte 2 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification */
#define NFCT_SENSRES_PLATFCONFIG_Pos           ( 8UL )                                   /*!< Position of PLATFCONFIG field. */
#define NFCT_SENSRES_PLATFCONFIG_Msk           ( 0xFUL << NFCT_SENSRES_PLATFCONFIG_Pos ) /*!< Bit mask of PLATFCONFIG field. */

/* Bits 7..6 : NFCID1 size. This value is used by the auto collision resolution engine. */
#define NFCT_SENSRES_NFCIDSIZE_Pos             ( 6UL )                                 /*!< Position of NFCIDSIZE field. */
#define NFCT_SENSRES_NFCIDSIZE_Msk             ( 0x3UL << NFCT_SENSRES_NFCIDSIZE_Pos ) /*!< Bit mask of NFCIDSIZE field. */
#define NFCT_SENSRES_NFCIDSIZE_NFCID1Single    ( 0UL )                                 /*!< NFCID1 size: single (4 bytes) */
#define NFCT_SENSRES_NFCIDSIZE_NFCID1Double    ( 1UL )                                 /*!< NFCID1 size: double (7 bytes) */
#define NFCT_SENSRES_NFCIDSIZE_NFCID1Triple    ( 2UL )                                 /*!< NFCID1 size: triple (10 bytes) */

/* Bit 5 : Reserved for future use. Shall be 0. */
#define NFCT_SENSRES_RFU5_Pos                  ( 5UL )                            /*!< Position of RFU5 field. */
#define NFCT_SENSRES_RFU5_Msk                  ( 0x1UL << NFCT_SENSRES_RFU5_Pos ) /*!< Bit mask of RFU5 field. */

/* Bits 4..0 : Bit frame SDD as defined by the b5:b1 of byte 1 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification */
#define NFCT_SENSRES_BITFRAMESDD_Pos           ( 0UL )                                    /*!< Position of BITFRAMESDD field. */
#define NFCT_SENSRES_BITFRAMESDD_Msk           ( 0x1FUL << NFCT_SENSRES_BITFRAMESDD_Pos ) /*!< Bit mask of BITFRAMESDD field. */
#define NFCT_SENSRES_BITFRAMESDD_SDD00000      ( 0UL )                                    /*!< SDD pattern 00000 */
#define NFCT_SENSRES_BITFRAMESDD_SDD00001      ( 1UL )                                    /*!< SDD pattern 00001 */
#define NFCT_SENSRES_BITFRAMESDD_SDD00010      ( 2UL )                                    /*!< SDD pattern 00010 */
#define NFCT_SENSRES_BITFRAMESDD_SDD00100      ( 4UL )                                    /*!< SDD pattern 00100 */
#define NFCT_SENSRES_BITFRAMESDD_SDD01000      ( 8UL )                                    /*!< SDD pattern 01000 */
#define NFCT_SENSRES_BITFRAMESDD_SDD10000      ( 16UL )                                   /*!< SDD pattern 10000 */

/* Register: NFCT_SELRES */
/* Description: NFC-A SEL_RES auto-response settings */

/* Bit 7 : Reserved for future use. Shall be 0. */
#define NFCT_SELRES_RFU7_Pos        ( 7UL )                           /*!< Position of RFU7 field. */
#define NFCT_SELRES_RFU7_Msk        ( 0x1UL << NFCT_SELRES_RFU7_Pos ) /*!< Bit mask of RFU7 field. */

/* Bits 6..5 : Protocol as defined by the b7:b6 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical Specification */
#define NFCT_SELRES_PROTOCOL_Pos    ( 5UL )                               /*!< Position of PROTOCOL field. */
#define NFCT_SELRES_PROTOCOL_Msk    ( 0x3UL << NFCT_SELRES_PROTOCOL_Pos ) /*!< Bit mask of PROTOCOL field. */

/* Bits 4..3 : Reserved for future use. Shall be 0. */
#define NFCT_SELRES_RFU43_Pos       ( 3UL )                            /*!< Position of RFU43 field. */
#define NFCT_SELRES_RFU43_Msk       ( 0x3UL << NFCT_SELRES_RFU43_Pos ) /*!< Bit mask of RFU43 field. */

/* Bit 2 : Cascade as defined by the b3 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical Specification (controlled by hardware, shall be 0) */
#define NFCT_SELRES_CASCADE_Pos     ( 2UL )                              /*!< Position of CASCADE field. */
#define NFCT_SELRES_CASCADE_Msk     ( 0x1UL << NFCT_SELRES_CASCADE_Pos ) /*!< Bit mask of CASCADE field. */

/* Bits 1..0 : Reserved for future use. Shall be 0. */
#define NFCT_SELRES_RFU10_Pos       ( 0UL )                            /*!< Position of RFU10 field. */
#define NFCT_SELRES_RFU10_Msk       ( 0x3UL << NFCT_SELRES_RFU10_Pos ) /*!< Bit mask of RFU10 field. */


/* Peripheral: NVMC */
/* Description: Non-volatile memory controller 0 */

/* Register: NVMC_READY */
/* Description: Ready flag */

/* Bit 0 : NVMC is ready or busy */
#define NVMC_READY_READY_Pos      ( 0UL )                           /*!< Position of READY field. */
#define NVMC_READY_READY_Msk      ( 0x1UL << NVMC_READY_READY_Pos ) /*!< Bit mask of READY field. */
#define NVMC_READY_READY_Busy     ( 0UL )                           /*!< NVMC is busy (ongoing write or erase operation) */
#define NVMC_READY_READY_Ready    ( 1UL )                           /*!< NVMC is ready */

/* Register: NVMC_READYNEXT */
/* Description: Ready flag */

/* Bit 0 : NVMC can accept a new write operation */
#define NVMC_READYNEXT_READYNEXT_Pos      ( 0UL )                                   /*!< Position of READYNEXT field. */
#define NVMC_READYNEXT_READYNEXT_Msk      ( 0x1UL << NVMC_READYNEXT_READYNEXT_Pos ) /*!< Bit mask of READYNEXT field. */
#define NVMC_READYNEXT_READYNEXT_Busy     ( 0UL )                                   /*!< NVMC cannot accept any write operation */
#define NVMC_READYNEXT_READYNEXT_Ready    ( 1UL )                                   /*!< NVMC is ready */

/* Register: NVMC_CONFIG */
/* Description: Configuration register */

