FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 2..0 : Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. */
#define NVMC_CONFIG_WEN_Pos     ( 0UL )                          /*!< Position of WEN field. */
#define NVMC_CONFIG_WEN_Msk     ( 0x7UL << NVMC_CONFIG_WEN_Pos ) /*!< Bit mask of WEN field. */
#define NVMC_CONFIG_WEN_Ren     ( 0UL )                          /*!< Read only access */
#define NVMC_CONFIG_WEN_Wen     ( 1UL )                          /*!< Write enabled */
#define NVMC_CONFIG_WEN_Een     ( 2UL )                          /*!< Erase enabled */
#define NVMC_CONFIG_WEN_PEen    ( 4UL )                          /*!< Partial erase enabled */

/* Register: NVMC_ERASEALL */
/* Description: Register for erasing all non-volatile user memory */

/* Bit 0 : Erase all non-volatile memory including UICR registers. Before the non-volatile memory can be erased, erasing must be enabled by setting CONFIG.WEN=Een. */
#define NVMC_ERASEALL_ERASEALL_Pos            ( 0UL )                                 /*!< Position of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_Msk            ( 0x1UL << NVMC_ERASEALL_ERASEALL_Pos ) /*!< Bit mask of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_NoOperation    ( 0UL )                                 /*!< No operation */
#define NVMC_ERASEALL_ERASEALL_Erase          ( 1UL )                                 /*!< Start chip erase */

/* Register: NVMC_ERASEPAGEPARTIALCFG */
/* Description: Register for partial erase configuration */

/* Bits 6..0 : Duration of the partial erase in milliseconds */
#define NVMC_ERASEPAGEPARTIALCFG_DURATION_Pos    ( 0UL )                                             /*!< Position of DURATION field. */
#define NVMC_ERASEPAGEPARTIALCFG_DURATION_Msk    ( 0x7FUL << NVMC_ERASEPAGEPARTIALCFG_DURATION_Pos ) /*!< Bit mask of DURATION field. */

/* Register: NVMC_CONFIGNS */
/* Description: Non-secure configuration register */

/* Bits 1..0 : Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. */
#define NVMC_CONFIGNS_WEN_Pos    ( 0UL )                            /*!< Position of WEN field. */
#define NVMC_CONFIGNS_WEN_Msk    ( 0x3UL << NVMC_CONFIGNS_WEN_Pos ) /*!< Bit mask of WEN field. */
#define NVMC_CONFIGNS_WEN_Ren    ( 0UL )                            /*!< Read only access */
#define NVMC_CONFIGNS_WEN_Wen    ( 1UL )                            /*!< Write enabled */
#define NVMC_CONFIGNS_WEN_Een    ( 2UL )                            /*!< Erase enabled */

/* Register: NVMC_WRITEUICRNS */
/* Description: Non-secure APPROTECT enable register */

/* Bits 31..4 : Key to write in order to validate the write operation */
#define NVMC_WRITEUICRNS_KEY_Pos         ( 4UL )                                     /*!< Position of KEY field. */
#define NVMC_WRITEUICRNS_KEY_Msk         ( 0xFFFFFFFUL << NVMC_WRITEUICRNS_KEY_Pos ) /*!< Bit mask of KEY field. */
#define NVMC_WRITEUICRNS_KEY_Keyvalid    ( 0xAFBE5A7UL )                             /*!< Key value */

/* Bit 0 : Allow non-secure code to set APPROTECT */
#define NVMC_WRITEUICRNS_SET_Pos         ( 0UL )                               /*!< Position of SET field. */
#define NVMC_WRITEUICRNS_SET_Msk         ( 0x1UL << NVMC_WRITEUICRNS_SET_Pos ) /*!< Bit mask of SET field. */
#define NVMC_WRITEUICRNS_SET_Set         ( 1UL )                               /*!< Set value */


/* Peripheral: OSCILLATORS */
/* Description: Oscillator control 0 */

/* Register: OSCILLATORS_XOSC32MCAPS */
/* Description: Programmable capacitance of XC1 and XC2 */

/* Bit 8 : Enable on-chip capacitors on XC1 and XC2 */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Pos         ( 8UL )                                         /*!< Position of ENABLE field. */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Msk         ( 0x1UL << OSCILLATORS_XOSC32MCAPS_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Disabled    ( 0UL )                                         /*!< Capacitor disabled (use external caps) */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Enabled     ( 1UL )                                         /*!< Capacitor enabled */

/* Bits 4..0 : Value representing capacitance, calculated using provided equation */
#define OSCILLATORS_XOSC32MCAPS_CAPVALUE_Pos       ( 0UL )                                            /*!< Position of CAPVALUE field. */
#define OSCILLATORS_XOSC32MCAPS_CAPVALUE_Msk       ( 0x1FUL << OSCILLATORS_XOSC32MCAPS_CAPVALUE_Pos ) /*!< Bit mask of CAPVALUE field. */

/* Register: OSCILLATORS_XOSC32KI_BYPASS */
/* Description: Enable or disable bypass of LFCLK crystal oscillator with external clock source */

/* Bit 0 : Enable or disable bypass of LFCLK crystal oscillator with external clock source */
#define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Pos         ( 0UL )                                             /*!< Position of BYPASS field. */
#define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Msk         ( 0x1UL << OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Pos ) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Disabled    ( 0UL )                                             /*!< Disable (use with crystal or low-swing external source) */
#define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Enabled     ( 1UL )                                             /*!< Enable (use with rail-to-rail external source) */

/* Register: OSCILLATORS_XOSC32KI_INTCAP */
/* Description: Control usage of internal load capacitors */

/* Bits 1..0 : Control usage of internal load capacitors */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_Pos         ( 0UL )                                             /*!< Position of INTCAP field. */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_Msk         ( 0x3UL << OSCILLATORS_XOSC32KI_INTCAP_INTCAP_Pos ) /*!< Bit mask of INTCAP field. */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_External    ( 0UL )                                             /*!< Use external load capacitors */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_C6PF        ( 1UL )                                             /*!< 6 pF internal load capacitance */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_C7PF        ( 2UL )                                             /*!< 7 pF internal load capacitance */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_C9PF        ( 3UL )                                             /*!< 9 pF internal load capacitance */


