FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Peripheral: GPIO */
/* Description: GPIO Port 0 */

/* Register: GPIO_OUT */
/* Description: Write GPIO port */

/* Bit 31 : Pin 31 */
#define GPIO_OUT_PIN31_Pos     ( 31UL )                        /*!< Position of PIN31 field. */
#define GPIO_OUT_PIN31_Msk     ( 0x1UL << GPIO_OUT_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_OUT_PIN31_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN31_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 30 : Pin 30 */
#define GPIO_OUT_PIN30_Pos     ( 30UL )                        /*!< Position of PIN30 field. */
#define GPIO_OUT_PIN30_Msk     ( 0x1UL << GPIO_OUT_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_OUT_PIN30_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN30_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 29 : Pin 29 */
#define GPIO_OUT_PIN29_Pos     ( 29UL )                        /*!< Position of PIN29 field. */
#define GPIO_OUT_PIN29_Msk     ( 0x1UL << GPIO_OUT_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_OUT_PIN29_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN29_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 28 : Pin 28 */
#define GPIO_OUT_PIN28_Pos     ( 28UL )                        /*!< Position of PIN28 field. */
#define GPIO_OUT_PIN28_Msk     ( 0x1UL << GPIO_OUT_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_OUT_PIN28_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN28_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 27 : Pin 27 */
#define GPIO_OUT_PIN27_Pos     ( 27UL )                        /*!< Position of PIN27 field. */
#define GPIO_OUT_PIN27_Msk     ( 0x1UL << GPIO_OUT_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_OUT_PIN27_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN27_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 26 : Pin 26 */
#define GPIO_OUT_PIN26_Pos     ( 26UL )                        /*!< Position of PIN26 field. */
#define GPIO_OUT_PIN26_Msk     ( 0x1UL << GPIO_OUT_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_OUT_PIN26_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN26_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 25 : Pin 25 */
#define GPIO_OUT_PIN25_Pos     ( 25UL )                        /*!< Position of PIN25 field. */
#define GPIO_OUT_PIN25_Msk     ( 0x1UL << GPIO_OUT_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_OUT_PIN25_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN25_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 24 : Pin 24 */
#define GPIO_OUT_PIN24_Pos     ( 24UL )                        /*!< Position of PIN24 field. */
#define GPIO_OUT_PIN24_Msk     ( 0x1UL << GPIO_OUT_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_OUT_PIN24_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN24_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 23 : Pin 23 */
#define GPIO_OUT_PIN23_Pos     ( 23UL )                        /*!< Position of PIN23 field. */
#define GPIO_OUT_PIN23_Msk     ( 0x1UL << GPIO_OUT_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_OUT_PIN23_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN23_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 22 : Pin 22 */
#define GPIO_OUT_PIN22_Pos     ( 22UL )                        /*!< Position of PIN22 field. */
#define GPIO_OUT_PIN22_Msk     ( 0x1UL << GPIO_OUT_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_OUT_PIN22_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN22_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 21 : Pin 21 */
#define GPIO_OUT_PIN21_Pos     ( 21UL )                        /*!< Position of PIN21 field. */
#define GPIO_OUT_PIN21_Msk     ( 0x1UL << GPIO_OUT_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_OUT_PIN21_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN21_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 20 : Pin 20 */
#define GPIO_OUT_PIN20_Pos     ( 20UL )                        /*!< Position of PIN20 field. */
#define GPIO_OUT_PIN20_Msk     ( 0x1UL << GPIO_OUT_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_OUT_PIN20_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN20_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 19 : Pin 19 */
#define GPIO_OUT_PIN19_Pos     ( 19UL )                        /*!< Position of PIN19 field. */
#define GPIO_OUT_PIN19_Msk     ( 0x1UL << GPIO_OUT_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_OUT_PIN19_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN19_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 18 : Pin 18 */
#define GPIO_OUT_PIN18_Pos     ( 18UL )                        /*!< Position of PIN18 field. */
#define GPIO_OUT_PIN18_Msk     ( 0x1UL << GPIO_OUT_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_OUT_PIN18_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN18_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 17 : Pin 17 */
#define GPIO_OUT_PIN17_Pos     ( 17UL )                        /*!< Position of PIN17 field. */
#define GPIO_OUT_PIN17_Msk     ( 0x1UL << GPIO_OUT_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_OUT_PIN17_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN17_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 16 : Pin 16 */
#define GPIO_OUT_PIN16_Pos     ( 16UL )                        /*!< Position of PIN16 field. */
#define GPIO_OUT_PIN16_Msk     ( 0x1UL << GPIO_OUT_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_OUT_PIN16_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN16_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 15 : Pin 15 */
#define GPIO_OUT_PIN15_Pos     ( 15UL )                        /*!< Position of PIN15 field. */
#define GPIO_OUT_PIN15_Msk     ( 0x1UL << GPIO_OUT_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_OUT_PIN15_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN15_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 14 : Pin 14 */
#define GPIO_OUT_PIN14_Pos     ( 14UL )                        /*!< Position of PIN14 field. */
#define GPIO_OUT_PIN14_Msk     ( 0x1UL << GPIO_OUT_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_OUT_PIN14_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN14_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 13 : Pin 13 */
#define GPIO_OUT_PIN13_Pos     ( 13UL )                        /*!< Position of PIN13 field. */
#define GPIO_OUT_PIN13_Msk     ( 0x1UL << GPIO_OUT_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_OUT_PIN13_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN13_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 12 : Pin 12 */
#define GPIO_OUT_PIN12_Pos     ( 12UL )                        /*!< Position of PIN12 field. */
#define GPIO_OUT_PIN12_Msk     ( 0x1UL << GPIO_OUT_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_OUT_PIN12_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN12_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 11 : Pin 11 */
#define GPIO_OUT_PIN11_Pos     ( 11UL )                        /*!< Position of PIN11 field. */
#define GPIO_OUT_PIN11_Msk     ( 0x1UL << GPIO_OUT_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_OUT_PIN11_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN11_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 10 : Pin 10 */
#define GPIO_OUT_PIN10_Pos     ( 10UL )                        /*!< Position of PIN10 field. */
#define GPIO_OUT_PIN10_Msk     ( 0x1UL << GPIO_OUT_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_OUT_PIN10_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN10_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 9 : Pin 9 */
#define GPIO_OUT_PIN9_Pos      ( 9UL )                        /*!< Position of PIN9 field. */
#define GPIO_OUT_PIN9_Msk      ( 0x1UL << GPIO_OUT_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_OUT_PIN9_Low      ( 0UL )                        /*!< Pin driver is low */
#define GPIO_OUT_PIN9_High     ( 1UL )                        /*!< Pin driver is high */

