FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 2 : Set as output pin 2 */
#define GPIO_DIRSET_PIN2_Pos        ( 2UL )                           /*!< Position of PIN2 field. */
#define GPIO_DIRSET_PIN2_Msk        ( 0x1UL << GPIO_DIRSET_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_DIRSET_PIN2_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN2_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN2_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 1 : Set as output pin 1 */
#define GPIO_DIRSET_PIN1_Pos        ( 1UL )                           /*!< Position of PIN1 field. */
#define GPIO_DIRSET_PIN1_Msk        ( 0x1UL << GPIO_DIRSET_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_DIRSET_PIN1_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN1_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN1_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 0 : Set as output pin 0 */
#define GPIO_DIRSET_PIN0_Pos        ( 0UL )                           /*!< Position of PIN0 field. */
#define GPIO_DIRSET_PIN0_Msk        ( 0x1UL << GPIO_DIRSET_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_DIRSET_PIN0_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN0_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN0_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Register: GPIO_DIRCLR */
/* Description: DIR clear register */

/* Bit 31 : Set as input pin 31 */
#define GPIO_DIRCLR_PIN31_Pos       ( 31UL )                           /*!< Position of PIN31 field. */
#define GPIO_DIRCLR_PIN31_Msk       ( 0x1UL << GPIO_DIRCLR_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_DIRCLR_PIN31_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN31_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN31_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 30 : Set as input pin 30 */
#define GPIO_DIRCLR_PIN30_Pos       ( 30UL )                           /*!< Position of PIN30 field. */
#define GPIO_DIRCLR_PIN30_Msk       ( 0x1UL << GPIO_DIRCLR_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_DIRCLR_PIN30_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN30_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN30_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 29 : Set as input pin 29 */
#define GPIO_DIRCLR_PIN29_Pos       ( 29UL )                           /*!< Position of PIN29 field. */
#define GPIO_DIRCLR_PIN29_Msk       ( 0x1UL << GPIO_DIRCLR_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_DIRCLR_PIN29_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN29_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN29_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 28 : Set as input pin 28 */
#define GPIO_DIRCLR_PIN28_Pos       ( 28UL )                           /*!< Position of PIN28 field. */
#define GPIO_DIRCLR_PIN28_Msk       ( 0x1UL << GPIO_DIRCLR_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_DIRCLR_PIN28_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN28_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN28_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 27 : Set as input pin 27 */
#define GPIO_DIRCLR_PIN27_Pos       ( 27UL )                           /*!< Position of PIN27 field. */
#define GPIO_DIRCLR_PIN27_Msk       ( 0x1UL << GPIO_DIRCLR_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_DIRCLR_PIN27_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN27_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN27_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 26 : Set as input pin 26 */
#define GPIO_DIRCLR_PIN26_Pos       ( 26UL )                           /*!< Position of PIN26 field. */
#define GPIO_DIRCLR_PIN26_Msk       ( 0x1UL << GPIO_DIRCLR_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_DIRCLR_PIN26_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN26_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN26_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 25 : Set as input pin 25 */
#define GPIO_DIRCLR_PIN25_Pos       ( 25UL )                           /*!< Position of PIN25 field. */
#define GPIO_DIRCLR_PIN25_Msk       ( 0x1UL << GPIO_DIRCLR_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_DIRCLR_PIN25_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN25_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN25_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 24 : Set as input pin 24 */
#define GPIO_DIRCLR_PIN24_Pos       ( 24UL )                           /*!< Position of PIN24 field. */
#define GPIO_DIRCLR_PIN24_Msk       ( 0x1UL << GPIO_DIRCLR_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_DIRCLR_PIN24_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN24_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN24_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 23 : Set as input pin 23 */
#define GPIO_DIRCLR_PIN23_Pos       ( 23UL )                           /*!< Position of PIN23 field. */
#define GPIO_DIRCLR_PIN23_Msk       ( 0x1UL << GPIO_DIRCLR_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_DIRCLR_PIN23_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN23_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN23_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

