FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 6 : Set as input pin 6 */
#define GPIO_DIRCLR_PIN6_Pos        ( 6UL )                           /*!< Position of PIN6 field. */
#define GPIO_DIRCLR_PIN6_Msk        ( 0x1UL << GPIO_DIRCLR_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_DIRCLR_PIN6_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN6_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN6_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 5 : Set as input pin 5 */
#define GPIO_DIRCLR_PIN5_Pos        ( 5UL )                           /*!< Position of PIN5 field. */
#define GPIO_DIRCLR_PIN5_Msk        ( 0x1UL << GPIO_DIRCLR_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_DIRCLR_PIN5_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN5_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN5_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 4 : Set as input pin 4 */
#define GPIO_DIRCLR_PIN4_Pos        ( 4UL )                           /*!< Position of PIN4 field. */
#define GPIO_DIRCLR_PIN4_Msk        ( 0x1UL << GPIO_DIRCLR_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_DIRCLR_PIN4_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN4_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN4_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 3 : Set as input pin 3 */
#define GPIO_DIRCLR_PIN3_Pos        ( 3UL )                           /*!< Position of PIN3 field. */
#define GPIO_DIRCLR_PIN3_Msk        ( 0x1UL << GPIO_DIRCLR_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_DIRCLR_PIN3_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN3_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN3_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 2 : Set as input pin 2 */
#define GPIO_DIRCLR_PIN2_Pos        ( 2UL )                           /*!< Position of PIN2 field. */
#define GPIO_DIRCLR_PIN2_Msk        ( 0x1UL << GPIO_DIRCLR_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_DIRCLR_PIN2_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN2_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN2_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 1 : Set as input pin 1 */
#define GPIO_DIRCLR_PIN1_Pos        ( 1UL )                           /*!< Position of PIN1 field. */
#define GPIO_DIRCLR_PIN1_Msk        ( 0x1UL << GPIO_DIRCLR_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_DIRCLR_PIN1_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN1_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN1_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 0 : Set as input pin 0 */
#define GPIO_DIRCLR_PIN0_Pos        ( 0UL )                           /*!< Position of PIN0 field. */
#define GPIO_DIRCLR_PIN0_Msk        ( 0x1UL << GPIO_DIRCLR_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_DIRCLR_PIN0_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN0_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN0_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Register: GPIO_LATCH */
/* Description: Latch register indicating what GPIO pins that have met the criteria set in the PIN_CNF[n].SENSE registers */

/* Bit 31 : Status on whether PIN[31] has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN31_Pos           ( 31UL )                          /*!< Position of PIN31 field. */
#define GPIO_LATCH_PIN31_Msk           ( 0x1UL << GPIO_LATCH_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_LATCH_PIN31_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN31_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 30 : Status on whether PIN[30] has met criteria set in PIN_CNF[30].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN30_Pos           ( 30UL )                          /*!< Position of PIN30 field. */
#define GPIO_LATCH_PIN30_Msk           ( 0x1UL << GPIO_LATCH_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_LATCH_PIN30_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN30_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 29 : Status on whether PIN[29] has met criteria set in PIN_CNF[29].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN29_Pos           ( 29UL )                          /*!< Position of PIN29 field. */
#define GPIO_LATCH_PIN29_Msk           ( 0x1UL << GPIO_LATCH_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_LATCH_PIN29_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN29_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 28 : Status on whether PIN[28] has met criteria set in PIN_CNF[28].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN28_Pos           ( 28UL )                          /*!< Position of PIN28 field. */
#define GPIO_LATCH_PIN28_Msk           ( 0x1UL << GPIO_LATCH_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_LATCH_PIN28_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN28_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 27 : Status on whether PIN[27] has met criteria set in PIN_CNF[27].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN27_Pos           ( 27UL )                          /*!< Position of PIN27 field. */
#define GPIO_LATCH_PIN27_Msk           ( 0x1UL << GPIO_LATCH_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_LATCH_PIN27_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN27_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 26 : Status on whether PIN[26] has met criteria set in PIN_CNF[26].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN26_Pos           ( 26UL )                          /*!< Position of PIN26 field. */
#define GPIO_LATCH_PIN26_Msk           ( 0x1UL << GPIO_LATCH_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_LATCH_PIN26_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN26_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 25 : Status on whether PIN[25] has met criteria set in PIN_CNF[25].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN25_Pos           ( 25UL )                          /*!< Position of PIN25 field. */
#define GPIO_LATCH_PIN25_Msk           ( 0x1UL << GPIO_LATCH_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_LATCH_PIN25_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN25_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 24 : Status on whether PIN[24] has met criteria set in PIN_CNF[24].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN24_Pos           ( 24UL )                          /*!< Position of PIN24 field. */
#define GPIO_LATCH_PIN24_Msk           ( 0x1UL << GPIO_LATCH_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_LATCH_PIN24_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN24_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 23 : Status on whether PIN[23] has met criteria set in PIN_CNF[23].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN23_Pos           ( 23UL )                          /*!< Position of PIN23 field. */
#define GPIO_LATCH_PIN23_Msk           ( 0x1UL << GPIO_LATCH_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_LATCH_PIN23_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN23_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 22 : Status on whether PIN[22] has met criteria set in PIN_CNF[22].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN22_Pos           ( 22UL )                          /*!< Position of PIN22 field. */
#define GPIO_LATCH_PIN22_Msk           ( 0x1UL << GPIO_LATCH_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_LATCH_PIN22_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN22_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 21 : Status on whether PIN[21] has met criteria set in PIN_CNF[21].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN21_Pos           ( 21UL )                          /*!< Position of PIN21 field. */
#define GPIO_LATCH_PIN21_Msk           ( 0x1UL << GPIO_LATCH_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_LATCH_PIN21_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN21_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 20 : Status on whether PIN[20] has met criteria set in PIN_CNF[20].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN20_Pos           ( 20UL )                          /*!< Position of PIN20 field. */
#define GPIO_LATCH_PIN20_Msk           ( 0x1UL << GPIO_LATCH_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_LATCH_PIN20_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN20_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 19 : Status on whether PIN[19] has met criteria set in PIN_CNF[19].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN19_Pos           ( 19UL )                          /*!< Position of PIN19 field. */
#define GPIO_LATCH_PIN19_Msk           ( 0x1UL << GPIO_LATCH_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_LATCH_PIN19_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN19_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 18 : Status on whether PIN[18] has met criteria set in PIN_CNF[18].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN18_Pos           ( 18UL )                          /*!< Position of PIN18 field. */
#define GPIO_LATCH_PIN18_Msk           ( 0x1UL << GPIO_LATCH_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_LATCH_PIN18_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN18_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 17 : Status on whether PIN[17] has met criteria set in PIN_CNF[17].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN17_Pos           ( 17UL )                          /*!< Position of PIN17 field. */
#define GPIO_LATCH_PIN17_Msk           ( 0x1UL << GPIO_LATCH_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_LATCH_PIN17_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN17_Latched       ( 1UL )                           /*!< Criteria has been met */

