FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Peripheral: PDM */
/* Description: Pulse Density Modulation (Digital Microphone) Interface 0 */

/* Register: PDM_TASKS_START */
/* Description: Starts continuous PDM transfer */

/* Bit 0 : Starts continuous PDM transfer */
#define PDM_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define PDM_TASKS_START_TASKS_START_Msk        ( 0x1UL << PDM_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define PDM_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: PDM_TASKS_STOP */
/* Description: Stops PDM transfer */

/* Bit 0 : Stops PDM transfer */
#define PDM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define PDM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << PDM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define PDM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: PDM_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define PDM_SUBSCRIBE_START_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define PDM_SUBSCRIBE_START_EN_Msk         ( 0x1UL << PDM_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define PDM_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define PDM_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define PDM_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define PDM_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << PDM_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PDM_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define PDM_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define PDM_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << PDM_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define PDM_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define PDM_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define PDM_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define PDM_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << PDM_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PDM_EVENTS_STARTED */
/* Description: PDM transfer has started */

/* Bit 0 : PDM transfer has started */
#define PDM_EVENTS_STARTED_EVENTS_STARTED_Pos             ( 0UL )                                            /*!< Position of EVENTS_STARTED field. */
#define PDM_EVENTS_STARTED_EVENTS_STARTED_Msk             ( 0x1UL << PDM_EVENTS_STARTED_EVENTS_STARTED_Pos ) /*!< Bit mask of EVENTS_STARTED field. */
#define PDM_EVENTS_STARTED_EVENTS_STARTED_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define PDM_EVENTS_STARTED_EVENTS_STARTED_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: PDM_EVENTS_STOPPED */
/* Description: PDM transfer has finished */

/* Bit 0 : PDM transfer has finished */
#define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                            /*!< Position of EVENTS_STOPPED field. */
#define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << PDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define PDM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: PDM_EVENTS_END */
/* Description: The PDM has written the last sample specified by SAMPLE.MAXCNT (or the last sample after a STOP task has been received) to Data RAM */

/* Bit 0 : The PDM has written the last sample specified by SAMPLE.MAXCNT (or the last sample after a STOP task has been received) to Data RAM */
#define PDM_EVENTS_END_EVENTS_END_Pos             ( 0UL )                                    /*!< Position of EVENTS_END field. */
#define PDM_EVENTS_END_EVENTS_END_Msk             ( 0x1UL << PDM_EVENTS_END_EVENTS_END_Pos ) /*!< Bit mask of EVENTS_END field. */
#define PDM_EVENTS_END_EVENTS_END_NotGenerated    ( 0UL )                                    /*!< Event not generated */
#define PDM_EVENTS_END_EVENTS_END_Generated       ( 1UL )                                    /*!< Event generated */

/* Register: PDM_PUBLISH_STARTED */
/* Description: Publish configuration for event STARTED */

/* Bit 31 :   */
#define PDM_PUBLISH_STARTED_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define PDM_PUBLISH_STARTED_EN_Msk         ( 0x1UL << PDM_PUBLISH_STARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define PDM_PUBLISH_STARTED_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define PDM_PUBLISH_STARTED_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STARTED will publish to. */
#define PDM_PUBLISH_STARTED_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define PDM_PUBLISH_STARTED_CHIDX_Msk      ( 0xFFUL << PDM_PUBLISH_STARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PDM_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define PDM_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define PDM_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << PDM_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define PDM_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define PDM_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define PDM_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define PDM_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << PDM_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

