FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: PDM_PUBLISH_END */
/* Description: Publish configuration for event END */

/* Bit 31 :   */
#define PDM_PUBLISH_END_EN_Pos         ( 31UL )                            /*!< Position of EN field. */
#define PDM_PUBLISH_END_EN_Msk         ( 0x1UL << PDM_PUBLISH_END_EN_Pos ) /*!< Bit mask of EN field. */
#define PDM_PUBLISH_END_EN_Disabled    ( 0UL )                             /*!< Disable publishing */
#define PDM_PUBLISH_END_EN_Enabled     ( 1UL )                             /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event END will publish to. */
#define PDM_PUBLISH_END_CHIDX_Pos      ( 0UL )                                 /*!< Position of CHIDX field. */
#define PDM_PUBLISH_END_CHIDX_Msk      ( 0xFFUL << PDM_PUBLISH_END_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PDM_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 2 : Enable or disable interrupt for event END */
#define PDM_INTEN_END_Pos             ( 2UL )                        /*!< Position of END field. */
#define PDM_INTEN_END_Msk             ( 0x1UL << PDM_INTEN_END_Pos ) /*!< Bit mask of END field. */
#define PDM_INTEN_END_Disabled        ( 0UL )                        /*!< Disable */
#define PDM_INTEN_END_Enabled         ( 1UL )                        /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event STOPPED */
#define PDM_INTEN_STOPPED_Pos         ( 1UL )                            /*!< Position of STOPPED field. */
#define PDM_INTEN_STOPPED_Msk         ( 0x1UL << PDM_INTEN_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define PDM_INTEN_STOPPED_Disabled    ( 0UL )                            /*!< Disable */
#define PDM_INTEN_STOPPED_Enabled     ( 1UL )                            /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event STARTED */
#define PDM_INTEN_STARTED_Pos         ( 0UL )                            /*!< Position of STARTED field. */
#define PDM_INTEN_STARTED_Msk         ( 0x1UL << PDM_INTEN_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define PDM_INTEN_STARTED_Disabled    ( 0UL )                            /*!< Disable */
#define PDM_INTEN_STARTED_Enabled     ( 1UL )                            /*!< Enable */

/* Register: PDM_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event END */
#define PDM_INTENSET_END_Pos             ( 2UL )                           /*!< Position of END field. */
#define PDM_INTENSET_END_Msk             ( 0x1UL << PDM_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define PDM_INTENSET_END_Disabled        ( 0UL )                           /*!< Read: Disabled */
#define PDM_INTENSET_END_Enabled         ( 1UL )                           /*!< Read: Enabled */
#define PDM_INTENSET_END_Set             ( 1UL )                           /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define PDM_INTENSET_STOPPED_Pos         ( 1UL )                               /*!< Position of STOPPED field. */
#define PDM_INTENSET_STOPPED_Msk         ( 0x1UL << PDM_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define PDM_INTENSET_STOPPED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define PDM_INTENSET_STOPPED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define PDM_INTENSET_STOPPED_Set         ( 1UL )                               /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event STARTED */
#define PDM_INTENSET_STARTED_Pos         ( 0UL )                               /*!< Position of STARTED field. */
#define PDM_INTENSET_STARTED_Msk         ( 0x1UL << PDM_INTENSET_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define PDM_INTENSET_STARTED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define PDM_INTENSET_STARTED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define PDM_INTENSET_STARTED_Set         ( 1UL )                               /*!< Enable */

/* Register: PDM_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event END */
#define PDM_INTENCLR_END_Pos             ( 2UL )                           /*!< Position of END field. */
#define PDM_INTENCLR_END_Msk             ( 0x1UL << PDM_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define PDM_INTENCLR_END_Disabled        ( 0UL )                           /*!< Read: Disabled */
#define PDM_INTENCLR_END_Enabled         ( 1UL )                           /*!< Read: Enabled */
#define PDM_INTENCLR_END_Clear           ( 1UL )                           /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define PDM_INTENCLR_STOPPED_Pos         ( 1UL )                               /*!< Position of STOPPED field. */
#define PDM_INTENCLR_STOPPED_Msk         ( 0x1UL << PDM_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define PDM_INTENCLR_STOPPED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define PDM_INTENCLR_STOPPED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define PDM_INTENCLR_STOPPED_Clear       ( 1UL )                               /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event STARTED */
#define PDM_INTENCLR_STARTED_Pos         ( 0UL )                               /*!< Position of STARTED field. */
#define PDM_INTENCLR_STARTED_Msk         ( 0x1UL << PDM_INTENCLR_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define PDM_INTENCLR_STARTED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define PDM_INTENCLR_STARTED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define PDM_INTENCLR_STARTED_Clear       ( 1UL )                               /*!< Disable */

/* Register: PDM_ENABLE */
/* Description: PDM module enable register */

/* Bit 0 : Enable or disable PDM module */
#define PDM_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define PDM_ENABLE_ENABLE_Msk         ( 0x1UL << PDM_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define PDM_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable */
#define PDM_ENABLE_ENABLE_Enabled     ( 1UL )                            /*!< Enable */

