FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: PDM_PDMCLKCTRL */
/* Description: PDM clock generator control */

/* Bits 31..0 : PDM_CLK frequency configuration. Enumerations are deprecated, use
 *      PDMCLKCTRL equation to find the register value. The 12 least significant bits of the
 *      register are ignored and shall be set to zero. */
#define PDM_PDMCLKCTRL_FREQ_Pos        ( 0UL )                                     /*!< Position of FREQ field. */
#define PDM_PDMCLKCTRL_FREQ_Msk        ( 0xFFFFFFFFUL << PDM_PDMCLKCTRL_FREQ_Pos ) /*!< Bit mask of FREQ field. */
#define PDM_PDMCLKCTRL_FREQ_1000K      ( 0x08000000UL )                            /*!< PDM_CLK = 32 MHz / 32 = 1.000 MHz */
#define PDM_PDMCLKCTRL_FREQ_Default    ( 0x08400000UL )                            /*!< PDM_CLK = 32 MHz / 31 = 1.032 MHz. Nominal clock for RATIO=Ratio64. */
#define PDM_PDMCLKCTRL_FREQ_1067K      ( 0x08800000UL )                            /*!< PDM_CLK = 32 MHz / 30 = 1.067 MHz */
#define PDM_PDMCLKCTRL_FREQ_1231K      ( 0x09800000UL )                            /*!< PDM_CLK = 32 MHz / 26 = 1.231 MHz */
#define PDM_PDMCLKCTRL_FREQ_1280K      ( 0x0A000000UL )                            /*!< PDM_CLK = 32 MHz / 25 = 1.280 MHz. Nominal clock for RATIO=Ratio80. */
#define PDM_PDMCLKCTRL_FREQ_1333K      ( 0x0A800000UL )                            /*!< PDM_CLK = 32 MHz / 24 = 1.333 MHz */

/* Register: PDM_MODE */
/* Description: Defines the routing of the connected PDM microphones' signals */

/* Bit 1 : Defines on which PDM_CLK edge left (or mono) is sampled */
#define PDM_MODE_EDGE_Pos            ( 1UL )                        /*!< Position of EDGE field. */
#define PDM_MODE_EDGE_Msk            ( 0x1UL << PDM_MODE_EDGE_Pos ) /*!< Bit mask of EDGE field. */
#define PDM_MODE_EDGE_LeftFalling    ( 0UL )                        /*!< Left (or mono) is sampled on falling edge of PDM_CLK */
#define PDM_MODE_EDGE_LeftRising     ( 1UL )                        /*!< Left (or mono) is sampled on rising edge of PDM_CLK */

/* Bit 0 : Mono or stereo operation */
#define PDM_MODE_OPERATION_Pos       ( 0UL )                             /*!< Position of OPERATION field. */
#define PDM_MODE_OPERATION_Msk       ( 0x1UL << PDM_MODE_OPERATION_Pos ) /*!< Bit mask of OPERATION field. */
#define PDM_MODE_OPERATION_Stereo    ( 0UL )                             /*!< Sample and store one pair (left + right) of 16-bit samples per RAM word R=[31:16]; L=[15:0] */
#define PDM_MODE_OPERATION_Mono      ( 1UL )                             /*!< Sample and store two successive left samples (16 bits each) per RAM word L1=[31:16]; L0=[15:0] */

/* Register: PDM_GAINL */
/* Description: Left output gain adjustment */

/* Bits 6..0 : Left output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters) 0x00    -20 dB gain adjust 0x01  -19.5 dB gain adjust (...) 0x27   -0.5 dB gain adjust 0x28      0 dB gain adjust 0x29   +0.5 dB gain adjust (...) 0x4F  +19.5 dB gain adjust 0x50    +20 dB gain adjust */
#define PDM_GAINL_GAINL_Pos            ( 0UL )                           /*!< Position of GAINL field. */
#define PDM_GAINL_GAINL_Msk            ( 0x7FUL << PDM_GAINL_GAINL_Pos ) /*!< Bit mask of GAINL field. */
#define PDM_GAINL_GAINL_MinGain        ( 0x00UL )                        /*!< -20 dB gain adjustment (minimum) */
#define PDM_GAINL_GAINL_DefaultGain    ( 0x28UL )                        /*!< 0 dB gain adjustment */
#define PDM_GAINL_GAINL_MaxGain        ( 0x50UL )                        /*!< +20 dB gain adjustment (maximum) */

/* Register: PDM_GAINR */
/* Description: Right output gain adjustment */

/* Bits 6..0 : Right output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters) */
#define PDM_GAINR_GAINR_Pos            ( 0UL )                           /*!< Position of GAINR field. */
#define PDM_GAINR_GAINR_Msk            ( 0x7FUL << PDM_GAINR_GAINR_Pos ) /*!< Bit mask of GAINR field. */
#define PDM_GAINR_GAINR_MinGain        ( 0x00UL )                        /*!< -20 dB gain adjustment (minimum) */
#define PDM_GAINR_GAINR_DefaultGain    ( 0x28UL )                        /*!< 0 dB gain adjustment */
#define PDM_GAINR_GAINR_MaxGain        ( 0x50UL )                        /*!< +20 dB gain adjustment (maximum) */

/* Register: PDM_RATIO */
/* Description: Selects the ratio between PDM_CLK and output sample rate. Change PDMCLKCTRL accordingly. */

/* Bit 0 : Selects the ratio between PDM_CLK and output sample rate */
#define PDM_RATIO_RATIO_Pos        ( 0UL )                          /*!< Position of RATIO field. */
#define PDM_RATIO_RATIO_Msk        ( 0x1UL << PDM_RATIO_RATIO_Pos ) /*!< Bit mask of RATIO field. */
#define PDM_RATIO_RATIO_Ratio64    ( 0UL )                          /*!< Ratio of 64 */
#define PDM_RATIO_RATIO_Ratio80    ( 1UL )                          /*!< Ratio of 80 */

/* Register: PDM_PSEL_CLK */
/* Description: Pin number configuration for PDM CLK signal */

/* Bit 31 : Connection */
#define PDM_PSEL_CLK_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define PDM_PSEL_CLK_CONNECT_Msk             ( 0x1UL << PDM_PSEL_CLK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define PDM_PSEL_CLK_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define PDM_PSEL_CLK_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bit 5 : Port number */
#define PDM_PSEL_CLK_PORT_Pos                ( 5UL )                            /*!< Position of PORT field. */
#define PDM_PSEL_CLK_PORT_Msk                ( 0x1UL << PDM_PSEL_CLK_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define PDM_PSEL_CLK_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define PDM_PSEL_CLK_PIN_Msk                 ( 0x1FUL << PDM_PSEL_CLK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: PDM_PSEL_DIN */
/* Description: Pin number configuration for PDM DIN signal */

/* Bit 31 : Connection */
#define PDM_PSEL_DIN_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define PDM_PSEL_DIN_CONNECT_Msk             ( 0x1UL << PDM_PSEL_DIN_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define PDM_PSEL_DIN_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define PDM_PSEL_DIN_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bit 5 : Port number */
#define PDM_PSEL_DIN_PORT_Pos                ( 5UL )                            /*!< Position of PORT field. */
#define PDM_PSEL_DIN_PORT_Msk                ( 0x1UL << PDM_PSEL_DIN_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define PDM_PSEL_DIN_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define PDM_PSEL_DIN_PIN_Msk                 ( 0x1FUL << PDM_PSEL_DIN_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: PDM_MCLKCONFIG */
/* Description: Master clock generator configuration */

/* Bit 0 : Master clock source selection */
#define PDM_MCLKCONFIG_SRC_Pos        ( 0UL )                             /*!< Position of SRC field. */
#define PDM_MCLKCONFIG_SRC_Msk        ( 0x1UL << PDM_MCLKCONFIG_SRC_Pos ) /*!< Bit mask of SRC field. */
#define PDM_MCLKCONFIG_SRC_PCLK32M    ( 0UL )                             /*!< 32 MHz peripheral clock */
#define PDM_MCLKCONFIG_SRC_ACLK       ( 1UL )                             /*!< Audio PLL clock */

/* Register: PDM_SAMPLE_PTR */
/* Description: RAM address pointer to write samples to with EasyDMA */

/* Bits 31..0 : Address to write PDM samples to over DMA */
#define PDM_SAMPLE_PTR_SAMPLEPTR_Pos    ( 0UL )                                          /*!< Position of SAMPLEPTR field. */
#define PDM_SAMPLE_PTR_SAMPLEPTR_Msk    ( 0xFFFFFFFFUL << PDM_SAMPLE_PTR_SAMPLEPTR_Pos ) /*!< Bit mask of SAMPLEPTR field. */

/* Register: PDM_SAMPLE_MAXCNT */
/* Description: Number of samples to allocate memory for in EasyDMA mode */

/* Bits 14..0 : Length of DMA RAM allocation in number of samples */
#define PDM_SAMPLE_MAXCNT_BUFFSIZE_Pos    ( 0UL )                                        /*!< Position of BUFFSIZE field. */
#define PDM_SAMPLE_MAXCNT_BUFFSIZE_Msk    ( 0x7FFFUL << PDM_SAMPLE_MAXCNT_BUFFSIZE_Pos ) /*!< Bit mask of BUFFSIZE field. */


/* Peripheral: POWER */
/* Description: Power control 0 */

/* Register: POWER_TASKS_CONSTLAT */
/* Description: Enable Constant Latency mode */

/* Bit 0 : Enable Constant Latency mode */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos        ( 0UL )                                              /*!< Position of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk        ( 0x1UL << POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos ) /*!< Bit mask of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: POWER_TASKS_LOWPWR */
/* Description: Enable Low-Power mode (variable latency) */

/* Bit 0 : Enable Low-Power mode (variable latency) */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos        ( 0UL )                                          /*!< Position of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Msk        ( 0x1UL << POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos ) /*!< Bit mask of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: POWER_SUBSCRIBE_CONSTLAT */
/* Description: Subscribe configuration for task CONSTLAT */

/* Bit 31 :   */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Msk         ( 0x1UL << POWER_SUBSCRIBE_CONSTLAT_EN_Pos ) /*!< Bit mask of EN field. */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CONSTLAT will subscribe to */
#define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Msk      ( 0xFFUL << POWER_SUBSCRIBE_CONSTLAT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: POWER_SUBSCRIBE_LOWPWR */
/* Description: Subscribe configuration for task LOWPWR */

/* Bit 31 :   */
#define POWER_SUBSCRIBE_LOWPWR_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define POWER_SUBSCRIBE_LOWPWR_EN_Msk         ( 0x1UL << POWER_SUBSCRIBE_LOWPWR_EN_Pos ) /*!< Bit mask of EN field. */
#define POWER_SUBSCRIBE_LOWPWR_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define POWER_SUBSCRIBE_LOWPWR_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task LOWPWR will subscribe to */
#define POWER_SUBSCRIBE_LOWPWR_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define POWER_SUBSCRIBE_LOWPWR_CHIDX_Msk      ( 0xFFUL << POWER_SUBSCRIBE_LOWPWR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

