FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: POWER_GPREGRET */
/* Description: Description collection: General purpose retention register */

/* Bits 7..0 : General purpose retention register */
#define POWER_GPREGRET_GPREGRET_Pos    ( 0UL )                                   /*!< Position of GPREGRET field. */
#define POWER_GPREGRET_GPREGRET_Msk    ( 0xFFUL << POWER_GPREGRET_GPREGRET_Pos ) /*!< Bit mask of GPREGRET field. */


/* Peripheral: PWM */
/* Description: Pulse width modulation unit 0 */

/* Register: PWM_TASKS_STOP */
/* Description: Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback */

/* Bit 0 : Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback */
#define PWM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define PWM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << PWM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define PWM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: PWM_TASKS_SEQSTART */
/* Description: Description collection: Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start if not running. */

/* Bit 0 : Loads the first PWM value on all enabled channels from sequence n, and starts playing that sequence at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE. Causes PWM generation to start if not running. */
#define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Pos        ( 0UL )                                            /*!< Position of TASKS_SEQSTART field. */
#define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Msk        ( 0x1UL << PWM_TASKS_SEQSTART_TASKS_SEQSTART_Pos ) /*!< Bit mask of TASKS_SEQSTART field. */
#define PWM_TASKS_SEQSTART_TASKS_SEQSTART_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: PWM_TASKS_NEXTSTEP */
/* Description: Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start if not running. */

/* Bit 0 : Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not cause PWM generation to start if not running. */
#define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Pos        ( 0UL )                                            /*!< Position of TASKS_NEXTSTEP field. */
#define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Msk        ( 0x1UL << PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Pos ) /*!< Bit mask of TASKS_NEXTSTEP field. */
#define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: PWM_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define PWM_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define PWM_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << PWM_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define PWM_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define PWM_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define PWM_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << PWM_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PWM_SUBSCRIBE_SEQSTART */
/* Description: Description collection: Subscribe configuration for task SEQSTART[n] */

/* Bit 31 :   */
#define PWM_SUBSCRIBE_SEQSTART_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define PWM_SUBSCRIBE_SEQSTART_EN_Msk         ( 0x1UL << PWM_SUBSCRIBE_SEQSTART_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_SUBSCRIBE_SEQSTART_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define PWM_SUBSCRIBE_SEQSTART_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SEQSTART[n] will subscribe to */
#define PWM_SUBSCRIBE_SEQSTART_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define PWM_SUBSCRIBE_SEQSTART_CHIDX_Msk      ( 0xFFUL << PWM_SUBSCRIBE_SEQSTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PWM_SUBSCRIBE_NEXTSTEP */
/* Description: Subscribe configuration for task NEXTSTEP */

/* Bit 31 :   */
#define PWM_SUBSCRIBE_NEXTSTEP_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define PWM_SUBSCRIBE_NEXTSTEP_EN_Msk         ( 0x1UL << PWM_SUBSCRIBE_NEXTSTEP_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_SUBSCRIBE_NEXTSTEP_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define PWM_SUBSCRIBE_NEXTSTEP_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task NEXTSTEP will subscribe to */
#define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Msk      ( 0xFFUL << PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PWM_EVENTS_STOPPED */
/* Description: Response to STOP task, emitted when PWM pulses are no longer generated */

/* Bit 0 : Response to STOP task, emitted when PWM pulses are no longer generated */
#define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                            /*!< Position of EVENTS_STOPPED field. */
#define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << PWM_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define PWM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: PWM_EVENTS_SEQSTARTED */
/* Description: Description collection: First PWM period started on sequence n */

/* Bit 0 : First PWM period started on sequence n */
#define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Pos             ( 0UL )                                                  /*!< Position of EVENTS_SEQSTARTED field. */
#define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Msk             ( 0x1UL << PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Pos ) /*!< Bit mask of EVENTS_SEQSTARTED field. */
#define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: PWM_EVENTS_SEQEND */
/* Description: Description collection: Emitted at end of every sequence n, when last value from RAM has been applied to wave counter */

/* Bit 0 : Emitted at end of every sequence n, when last value from RAM has been applied to wave counter */
#define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Pos             ( 0UL )                                          /*!< Position of EVENTS_SEQEND field. */
#define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Msk             ( 0x1UL << PWM_EVENTS_SEQEND_EVENTS_SEQEND_Pos ) /*!< Bit mask of EVENTS_SEQEND field. */
#define PWM_EVENTS_SEQEND_EVENTS_SEQEND_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: PWM_EVENTS_PWMPERIODEND */
/* Description: Emitted at the end of each PWM period */

/* Bit 0 : Emitted at the end of each PWM period */
#define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Pos             ( 0UL )                                                      /*!< Position of EVENTS_PWMPERIODEND field. */
#define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Msk             ( 0x1UL << PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Pos ) /*!< Bit mask of EVENTS_PWMPERIODEND field. */
#define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_NotGenerated    ( 0UL )                                                      /*!< Event not generated */
#define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Generated       ( 1UL )                                                      /*!< Event generated */

/* Register: PWM_EVENTS_LOOPSDONE */
/* Description: Concatenated sequences have been played the amount of times defined in LOOP.CNT */

/* Bit 0 : Concatenated sequences have been played the amount of times defined in LOOP.CNT */
#define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Pos             ( 0UL )                                                /*!< Position of EVENTS_LOOPSDONE field. */
#define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Msk             ( 0x1UL << PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Pos ) /*!< Bit mask of EVENTS_LOOPSDONE field. */
#define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_NotGenerated    ( 0UL )                                                /*!< Event not generated */
#define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Generated       ( 1UL )                                                /*!< Event generated */

/* Register: PWM_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define PWM_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define PWM_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << PWM_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define PWM_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define PWM_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define PWM_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << PWM_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

