FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: PWM_PUBLISH_SEQSTARTED */
/* Description: Description collection: Publish configuration for event SEQSTARTED[n] */

/* Bit 31 :   */
#define PWM_PUBLISH_SEQSTARTED_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define PWM_PUBLISH_SEQSTARTED_EN_Msk         ( 0x1UL << PWM_PUBLISH_SEQSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_SEQSTARTED_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define PWM_PUBLISH_SEQSTARTED_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SEQSTARTED[n] will publish to. */
#define PWM_PUBLISH_SEQSTARTED_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define PWM_PUBLISH_SEQSTARTED_CHIDX_Msk      ( 0xFFUL << PWM_PUBLISH_SEQSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PWM_PUBLISH_SEQEND */
/* Description: Description collection: Publish configuration for event SEQEND[n] */

/* Bit 31 :   */
#define PWM_PUBLISH_SEQEND_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define PWM_PUBLISH_SEQEND_EN_Msk         ( 0x1UL << PWM_PUBLISH_SEQEND_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_SEQEND_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define PWM_PUBLISH_SEQEND_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SEQEND[n] will publish to. */
#define PWM_PUBLISH_SEQEND_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define PWM_PUBLISH_SEQEND_CHIDX_Msk      ( 0xFFUL << PWM_PUBLISH_SEQEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PWM_PUBLISH_PWMPERIODEND */
/* Description: Publish configuration for event PWMPERIODEND */

/* Bit 31 :   */
#define PWM_PUBLISH_PWMPERIODEND_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define PWM_PUBLISH_PWMPERIODEND_EN_Msk         ( 0x1UL << PWM_PUBLISH_PWMPERIODEND_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_PWMPERIODEND_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define PWM_PUBLISH_PWMPERIODEND_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event PWMPERIODEND will publish to. */
#define PWM_PUBLISH_PWMPERIODEND_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define PWM_PUBLISH_PWMPERIODEND_CHIDX_Msk      ( 0xFFUL << PWM_PUBLISH_PWMPERIODEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PWM_PUBLISH_LOOPSDONE */
/* Description: Publish configuration for event LOOPSDONE */

/* Bit 31 :   */
#define PWM_PUBLISH_LOOPSDONE_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define PWM_PUBLISH_LOOPSDONE_EN_Msk         ( 0x1UL << PWM_PUBLISH_LOOPSDONE_EN_Pos ) /*!< Bit mask of EN field. */
#define PWM_PUBLISH_LOOPSDONE_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define PWM_PUBLISH_LOOPSDONE_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event LOOPSDONE will publish to. */
#define PWM_PUBLISH_LOOPSDONE_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define PWM_PUBLISH_LOOPSDONE_CHIDX_Msk      ( 0xFFUL << PWM_PUBLISH_LOOPSDONE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: PWM_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 4 : Shortcut between event LOOPSDONE and task STOP */
#define PWM_SHORTS_LOOPSDONE_STOP_Pos              ( 4UL )                                    /*!< Position of LOOPSDONE_STOP field. */
#define PWM_SHORTS_LOOPSDONE_STOP_Msk              ( 0x1UL << PWM_SHORTS_LOOPSDONE_STOP_Pos ) /*!< Bit mask of LOOPSDONE_STOP field. */
#define PWM_SHORTS_LOOPSDONE_STOP_Disabled         ( 0UL )                                    /*!< Disable shortcut */
#define PWM_SHORTS_LOOPSDONE_STOP_Enabled          ( 1UL )                                    /*!< Enable shortcut */

/* Bit 3 : Shortcut between event LOOPSDONE and task SEQSTART[1] */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Pos         ( 3UL )                                         /*!< Position of LOOPSDONE_SEQSTART1 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Msk         ( 0x1UL << PWM_SHORTS_LOOPSDONE_SEQSTART1_Pos ) /*!< Bit mask of LOOPSDONE_SEQSTART1 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Disabled    ( 0UL )                                         /*!< Disable shortcut */
#define PWM_SHORTS_LOOPSDONE_SEQSTART1_Enabled     ( 1UL )                                         /*!< Enable shortcut */

/* Bit 2 : Shortcut between event LOOPSDONE and task SEQSTART[0] */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Pos         ( 2UL )                                         /*!< Position of LOOPSDONE_SEQSTART0 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Msk         ( 0x1UL << PWM_SHORTS_LOOPSDONE_SEQSTART0_Pos ) /*!< Bit mask of LOOPSDONE_SEQSTART0 field. */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Disabled    ( 0UL )                                         /*!< Disable shortcut */
#define PWM_SHORTS_LOOPSDONE_SEQSTART0_Enabled     ( 1UL )                                         /*!< Enable shortcut */

/* Bit 1 : Shortcut between event SEQEND[1] and task STOP */
#define PWM_SHORTS_SEQEND1_STOP_Pos                ( 1UL )                                  /*!< Position of SEQEND1_STOP field. */
#define PWM_SHORTS_SEQEND1_STOP_Msk                ( 0x1UL << PWM_SHORTS_SEQEND1_STOP_Pos ) /*!< Bit mask of SEQEND1_STOP field. */
#define PWM_SHORTS_SEQEND1_STOP_Disabled           ( 0UL )                                  /*!< Disable shortcut */
#define PWM_SHORTS_SEQEND1_STOP_Enabled            ( 1UL )                                  /*!< Enable shortcut */

