FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : Shortcut between event SEQEND[0] and task STOP */
#define PWM_SHORTS_SEQEND0_STOP_Pos                ( 0UL )                                  /*!< Position of SEQEND0_STOP field. */
#define PWM_SHORTS_SEQEND0_STOP_Msk                ( 0x1UL << PWM_SHORTS_SEQEND0_STOP_Pos ) /*!< Bit mask of SEQEND0_STOP field. */
#define PWM_SHORTS_SEQEND0_STOP_Disabled           ( 0UL )                                  /*!< Disable shortcut */
#define PWM_SHORTS_SEQEND0_STOP_Enabled            ( 1UL )                                  /*!< Enable shortcut */

/* Register: PWM_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 7 : Enable or disable interrupt for event LOOPSDONE */
#define PWM_INTEN_LOOPSDONE_Pos            ( 7UL )                              /*!< Position of LOOPSDONE field. */
#define PWM_INTEN_LOOPSDONE_Msk            ( 0x1UL << PWM_INTEN_LOOPSDONE_Pos ) /*!< Bit mask of LOOPSDONE field. */
#define PWM_INTEN_LOOPSDONE_Disabled       ( 0UL )                              /*!< Disable */
#define PWM_INTEN_LOOPSDONE_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event PWMPERIODEND */
#define PWM_INTEN_PWMPERIODEND_Pos         ( 6UL )                                 /*!< Position of PWMPERIODEND field. */
#define PWM_INTEN_PWMPERIODEND_Msk         ( 0x1UL << PWM_INTEN_PWMPERIODEND_Pos ) /*!< Bit mask of PWMPERIODEND field. */
#define PWM_INTEN_PWMPERIODEND_Disabled    ( 0UL )                                 /*!< Disable */
#define PWM_INTEN_PWMPERIODEND_Enabled     ( 1UL )                                 /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event SEQEND[1] */
#define PWM_INTEN_SEQEND1_Pos              ( 5UL )                            /*!< Position of SEQEND1 field. */
#define PWM_INTEN_SEQEND1_Msk              ( 0x1UL << PWM_INTEN_SEQEND1_Pos ) /*!< Bit mask of SEQEND1 field. */
#define PWM_INTEN_SEQEND1_Disabled         ( 0UL )                            /*!< Disable */
#define PWM_INTEN_SEQEND1_Enabled          ( 1UL )                            /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event SEQEND[0] */
#define PWM_INTEN_SEQEND0_Pos              ( 4UL )                            /*!< Position of SEQEND0 field. */
#define PWM_INTEN_SEQEND0_Msk              ( 0x1UL << PWM_INTEN_SEQEND0_Pos ) /*!< Bit mask of SEQEND0 field. */
#define PWM_INTEN_SEQEND0_Disabled         ( 0UL )                            /*!< Disable */
#define PWM_INTEN_SEQEND0_Enabled          ( 1UL )                            /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event SEQSTARTED[1] */
#define PWM_INTEN_SEQSTARTED1_Pos          ( 3UL )                                /*!< Position of SEQSTARTED1 field. */
#define PWM_INTEN_SEQSTARTED1_Msk          ( 0x1UL << PWM_INTEN_SEQSTARTED1_Pos ) /*!< Bit mask of SEQSTARTED1 field. */
#define PWM_INTEN_SEQSTARTED1_Disabled     ( 0UL )                                /*!< Disable */
#define PWM_INTEN_SEQSTARTED1_Enabled      ( 1UL )                                /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event SEQSTARTED[0] */
#define PWM_INTEN_SEQSTARTED0_Pos          ( 2UL )                                /*!< Position of SEQSTARTED0 field. */
#define PWM_INTEN_SEQSTARTED0_Msk          ( 0x1UL << PWM_INTEN_SEQSTARTED0_Pos ) /*!< Bit mask of SEQSTARTED0 field. */
#define PWM_INTEN_SEQSTARTED0_Disabled     ( 0UL )                                /*!< Disable */
#define PWM_INTEN_SEQSTARTED0_Enabled      ( 1UL )                                /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event STOPPED */
#define PWM_INTEN_STOPPED_Pos              ( 1UL )                            /*!< Position of STOPPED field. */
#define PWM_INTEN_STOPPED_Msk              ( 0x1UL << PWM_INTEN_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define PWM_INTEN_STOPPED_Disabled         ( 0UL )                            /*!< Disable */
#define PWM_INTEN_STOPPED_Enabled          ( 1UL )                            /*!< Enable */

/* Register: PWM_INTENSET */
/* Description: Enable interrupt */

/* Bit 7 : Write '1' to enable interrupt for event LOOPSDONE */
#define PWM_INTENSET_LOOPSDONE_Pos            ( 7UL )                                 /*!< Position of LOOPSDONE field. */
#define PWM_INTENSET_LOOPSDONE_Msk            ( 0x1UL << PWM_INTENSET_LOOPSDONE_Pos ) /*!< Bit mask of LOOPSDONE field. */
#define PWM_INTENSET_LOOPSDONE_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define PWM_INTENSET_LOOPSDONE_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define PWM_INTENSET_LOOPSDONE_Set            ( 1UL )                                 /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event PWMPERIODEND */
#define PWM_INTENSET_PWMPERIODEND_Pos         ( 6UL )                                    /*!< Position of PWMPERIODEND field. */
#define PWM_INTENSET_PWMPERIODEND_Msk         ( 0x1UL << PWM_INTENSET_PWMPERIODEND_Pos ) /*!< Bit mask of PWMPERIODEND field. */
#define PWM_INTENSET_PWMPERIODEND_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define PWM_INTENSET_PWMPERIODEND_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define PWM_INTENSET_PWMPERIODEND_Set         ( 1UL )                                    /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event SEQEND[1] */
#define PWM_INTENSET_SEQEND1_Pos              ( 5UL )                               /*!< Position of SEQEND1 field. */
#define PWM_INTENSET_SEQEND1_Msk              ( 0x1UL << PWM_INTENSET_SEQEND1_Pos ) /*!< Bit mask of SEQEND1 field. */
#define PWM_INTENSET_SEQEND1_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define PWM_INTENSET_SEQEND1_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define PWM_INTENSET_SEQEND1_Set              ( 1UL )                               /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event SEQEND[0] */
#define PWM_INTENSET_SEQEND0_Pos              ( 4UL )                               /*!< Position of SEQEND0 field. */
#define PWM_INTENSET_SEQEND0_Msk              ( 0x1UL << PWM_INTENSET_SEQEND0_Pos ) /*!< Bit mask of SEQEND0 field. */
#define PWM_INTENSET_SEQEND0_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define PWM_INTENSET_SEQEND0_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define PWM_INTENSET_SEQEND0_Set              ( 1UL )                               /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event SEQSTARTED[1] */
#define PWM_INTENSET_SEQSTARTED1_Pos          ( 3UL )                                   /*!< Position of SEQSTARTED1 field. */
#define PWM_INTENSET_SEQSTARTED1_Msk          ( 0x1UL << PWM_INTENSET_SEQSTARTED1_Pos ) /*!< Bit mask of SEQSTARTED1 field. */
#define PWM_INTENSET_SEQSTARTED1_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define PWM_INTENSET_SEQSTARTED1_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define PWM_INTENSET_SEQSTARTED1_Set          ( 1UL )                                   /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event SEQSTARTED[0] */
#define PWM_INTENSET_SEQSTARTED0_Pos          ( 2UL )                                   /*!< Position of SEQSTARTED0 field. */
#define PWM_INTENSET_SEQSTARTED0_Msk          ( 0x1UL << PWM_INTENSET_SEQSTARTED0_Pos ) /*!< Bit mask of SEQSTARTED0 field. */
#define PWM_INTENSET_SEQSTARTED0_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define PWM_INTENSET_SEQSTARTED0_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define PWM_INTENSET_SEQSTARTED0_Set          ( 1UL )                                   /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define PWM_INTENSET_STOPPED_Pos              ( 1UL )                               /*!< Position of STOPPED field. */
#define PWM_INTENSET_STOPPED_Msk              ( 0x1UL << PWM_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define PWM_INTENSET_STOPPED_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define PWM_INTENSET_STOPPED_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define PWM_INTENSET_STOPPED_Set              ( 1UL )                               /*!< Enable */

