FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: PWM_INTENCLR */
/* Description: Disable interrupt */

/* Bit 7 : Write '1' to disable interrupt for event LOOPSDONE */
#define PWM_INTENCLR_LOOPSDONE_Pos            ( 7UL )                                 /*!< Position of LOOPSDONE field. */
#define PWM_INTENCLR_LOOPSDONE_Msk            ( 0x1UL << PWM_INTENCLR_LOOPSDONE_Pos ) /*!< Bit mask of LOOPSDONE field. */
#define PWM_INTENCLR_LOOPSDONE_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define PWM_INTENCLR_LOOPSDONE_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define PWM_INTENCLR_LOOPSDONE_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event PWMPERIODEND */
#define PWM_INTENCLR_PWMPERIODEND_Pos         ( 6UL )                                    /*!< Position of PWMPERIODEND field. */
#define PWM_INTENCLR_PWMPERIODEND_Msk         ( 0x1UL << PWM_INTENCLR_PWMPERIODEND_Pos ) /*!< Bit mask of PWMPERIODEND field. */
#define PWM_INTENCLR_PWMPERIODEND_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define PWM_INTENCLR_PWMPERIODEND_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define PWM_INTENCLR_PWMPERIODEND_Clear       ( 1UL )                                    /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event SEQEND[1] */
#define PWM_INTENCLR_SEQEND1_Pos              ( 5UL )                               /*!< Position of SEQEND1 field. */
#define PWM_INTENCLR_SEQEND1_Msk              ( 0x1UL << PWM_INTENCLR_SEQEND1_Pos ) /*!< Bit mask of SEQEND1 field. */
#define PWM_INTENCLR_SEQEND1_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define PWM_INTENCLR_SEQEND1_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define PWM_INTENCLR_SEQEND1_Clear            ( 1UL )                               /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event SEQEND[0] */
#define PWM_INTENCLR_SEQEND0_Pos              ( 4UL )                               /*!< Position of SEQEND0 field. */
#define PWM_INTENCLR_SEQEND0_Msk              ( 0x1UL << PWM_INTENCLR_SEQEND0_Pos ) /*!< Bit mask of SEQEND0 field. */
#define PWM_INTENCLR_SEQEND0_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define PWM_INTENCLR_SEQEND0_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define PWM_INTENCLR_SEQEND0_Clear            ( 1UL )                               /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event SEQSTARTED[1] */
#define PWM_INTENCLR_SEQSTARTED1_Pos          ( 3UL )                                   /*!< Position of SEQSTARTED1 field. */
#define PWM_INTENCLR_SEQSTARTED1_Msk          ( 0x1UL << PWM_INTENCLR_SEQSTARTED1_Pos ) /*!< Bit mask of SEQSTARTED1 field. */
#define PWM_INTENCLR_SEQSTARTED1_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define PWM_INTENCLR_SEQSTARTED1_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define PWM_INTENCLR_SEQSTARTED1_Clear        ( 1UL )                                   /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event SEQSTARTED[0] */
#define PWM_INTENCLR_SEQSTARTED0_Pos          ( 2UL )                                   /*!< Position of SEQSTARTED0 field. */
#define PWM_INTENCLR_SEQSTARTED0_Msk          ( 0x1UL << PWM_INTENCLR_SEQSTARTED0_Pos ) /*!< Bit mask of SEQSTARTED0 field. */
#define PWM_INTENCLR_SEQSTARTED0_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define PWM_INTENCLR_SEQSTARTED0_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define PWM_INTENCLR_SEQSTARTED0_Clear        ( 1UL )                                   /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define PWM_INTENCLR_STOPPED_Pos              ( 1UL )                               /*!< Position of STOPPED field. */
#define PWM_INTENCLR_STOPPED_Msk              ( 0x1UL << PWM_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define PWM_INTENCLR_STOPPED_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define PWM_INTENCLR_STOPPED_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define PWM_INTENCLR_STOPPED_Clear            ( 1UL )                               /*!< Disable */

/* Register: PWM_ENABLE */
/* Description: PWM module enable register */

/* Bit 0 : Enable or disable PWM module */
#define PWM_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define PWM_ENABLE_ENABLE_Msk         ( 0x1UL << PWM_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define PWM_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disabled */
#define PWM_ENABLE_ENABLE_Enabled     ( 1UL )                            /*!< Enable */

/* Register: PWM_MODE */
/* Description: Selects operating mode of the wave counter */

/* Bit 0 : Selects up mode or up-and-down mode for the counter */
#define PWM_MODE_UPDOWN_Pos          ( 0UL )                          /*!< Position of UPDOWN field. */
#define PWM_MODE_UPDOWN_Msk          ( 0x1UL << PWM_MODE_UPDOWN_Pos ) /*!< Bit mask of UPDOWN field. */
#define PWM_MODE_UPDOWN_Up           ( 0UL )                          /*!< Up counter, edge-aligned PWM duty cycle */
#define PWM_MODE_UPDOWN_UpAndDown    ( 1UL )                          /*!< Up and down counter, center-aligned PWM duty cycle */

/* Register: PWM_COUNTERTOP */
/* Description: Value up to which the pulse generator counter counts */

/* Bits 14..0 : Value up to which the pulse generator counter counts. This register is ignored when DECODER.MODE=WaveForm and only values from RAM are used. */
#define PWM_COUNTERTOP_COUNTERTOP_Pos    ( 0UL )                                       /*!< Position of COUNTERTOP field. */
#define PWM_COUNTERTOP_COUNTERTOP_Msk    ( 0x7FFFUL << PWM_COUNTERTOP_COUNTERTOP_Pos ) /*!< Bit mask of COUNTERTOP field. */

/* Register: PWM_PRESCALER */
/* Description: Configuration for PWM_CLK */

/* Bits 2..0 : Prescaler of PWM_CLK */
#define PWM_PRESCALER_PRESCALER_Pos        ( 0UL )                                  /*!< Position of PRESCALER field. */
#define PWM_PRESCALER_PRESCALER_Msk        ( 0x7UL << PWM_PRESCALER_PRESCALER_Pos ) /*!< Bit mask of PRESCALER field. */
#define PWM_PRESCALER_PRESCALER_DIV_1      ( 0UL )                                  /*!< Divide by 1 (16 MHz) */
#define PWM_PRESCALER_PRESCALER_DIV_2      ( 1UL )                                  /*!< Divide by 2 (8 MHz) */
#define PWM_PRESCALER_PRESCALER_DIV_4      ( 2UL )                                  /*!< Divide by 4 (4 MHz) */
#define PWM_PRESCALER_PRESCALER_DIV_8      ( 3UL )                                  /*!< Divide by 8 (2 MHz) */
#define PWM_PRESCALER_PRESCALER_DIV_16     ( 4UL )                                  /*!< Divide by 16 (1 MHz) */
#define PWM_PRESCALER_PRESCALER_DIV_32     ( 5UL )                                  /*!< Divide by 32 (500 kHz) */
#define PWM_PRESCALER_PRESCALER_DIV_64     ( 6UL )                                  /*!< Divide by 64 (250 kHz) */
#define PWM_PRESCALER_PRESCALER_DIV_128    ( 7UL )                                  /*!< Divide by 128 (125 kHz) */

/* Register: PWM_DECODER */
/* Description: Configuration of the decoder */

