FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 8 : Selects source for advancing the active sequence */
#define PWM_DECODER_MODE_Pos             ( 8UL )                           /*!< Position of MODE field. */
#define PWM_DECODER_MODE_Msk             ( 0x1UL << PWM_DECODER_MODE_Pos ) /*!< Bit mask of MODE field. */
#define PWM_DECODER_MODE_RefreshCount    ( 0UL )                           /*!< SEQ[n].REFRESH is used to determine loading internal compare registers */
#define PWM_DECODER_MODE_NextStep        ( 1UL )                           /*!< NEXTSTEP task causes a new value to be loaded to internal compare registers */

/* Bits 1..0 : How a sequence is read from RAM and spread to the compare register */
#define PWM_DECODER_LOAD_Pos             ( 0UL )                           /*!< Position of LOAD field. */
#define PWM_DECODER_LOAD_Msk             ( 0x3UL << PWM_DECODER_LOAD_Pos ) /*!< Bit mask of LOAD field. */
#define PWM_DECODER_LOAD_Common          ( 0UL )                           /*!< 1st half word (16-bit) used in all PWM channels 0..3 */
#define PWM_DECODER_LOAD_Grouped         ( 1UL )                           /*!< 1st half word (16-bit) used in channel 0..1; 2nd word in channel 2..3 */
#define PWM_DECODER_LOAD_Individual      ( 2UL )                           /*!< 1st half word (16-bit) in ch.0; 2nd in ch.1; ...; 4th in ch.3 */
#define PWM_DECODER_LOAD_WaveForm        ( 3UL )                           /*!< 1st half word (16-bit) in ch.0; 2nd in ch.1; ...; 4th in COUNTERTOP */

/* Register: PWM_LOOP */
/* Description: Number of playbacks of a loop */

/* Bits 15..0 : Number of playbacks of pattern cycles */
#define PWM_LOOP_CNT_Pos         ( 0UL )                          /*!< Position of CNT field. */
#define PWM_LOOP_CNT_Msk         ( 0xFFFFUL << PWM_LOOP_CNT_Pos ) /*!< Bit mask of CNT field. */
#define PWM_LOOP_CNT_Disabled    ( 0UL )                          /*!< Looping disabled (stop at the end of the sequence) */

/* Register: PWM_SEQ_PTR */
/* Description: Description cluster: Beginning address in RAM of this sequence */

/* Bits 31..0 : Beginning address in RAM of this sequence */
#define PWM_SEQ_PTR_PTR_Pos    ( 0UL )                                 /*!< Position of PTR field. */
#define PWM_SEQ_PTR_PTR_Msk    ( 0xFFFFFFFFUL << PWM_SEQ_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: PWM_SEQ_CNT */
/* Description: Description cluster: Number of values (duty cycles) in this sequence */

/* Bits 14..0 : Number of values (duty cycles) in this sequence */
#define PWM_SEQ_CNT_CNT_Pos         ( 0UL )                             /*!< Position of CNT field. */
#define PWM_SEQ_CNT_CNT_Msk         ( 0x7FFFUL << PWM_SEQ_CNT_CNT_Pos ) /*!< Bit mask of CNT field. */
#define PWM_SEQ_CNT_CNT_Disabled    ( 0UL )                             /*!< Sequence is disabled, and shall not be started as it is empty */

/* Register: PWM_SEQ_REFRESH */
/* Description: Description cluster: Number of additional PWM periods between samples loaded into compare register */

/* Bits 23..0 : Number of additional PWM periods between samples loaded into compare register (load every REFRESH.CNT+1 PWM periods) */
#define PWM_SEQ_REFRESH_CNT_Pos           ( 0UL )                                   /*!< Position of CNT field. */
#define PWM_SEQ_REFRESH_CNT_Msk           ( 0xFFFFFFUL << PWM_SEQ_REFRESH_CNT_Pos ) /*!< Bit mask of CNT field. */
#define PWM_SEQ_REFRESH_CNT_Continuous    ( 0UL )                                   /*!< Update every PWM period */

/* Register: PWM_SEQ_ENDDELAY */
/* Description: Description cluster: Time added after the sequence */

/* Bits 23..0 : Time added after the sequence in PWM periods */
#define PWM_SEQ_ENDDELAY_CNT_Pos    ( 0UL )                                    /*!< Position of CNT field. */
#define PWM_SEQ_ENDDELAY_CNT_Msk    ( 0xFFFFFFUL << PWM_SEQ_ENDDELAY_CNT_Pos ) /*!< Bit mask of CNT field. */

/* Register: PWM_PSEL_OUT */
/* Description: Description collection: Output pin select for PWM channel n */

/* Bit 31 : Connection */
#define PWM_PSEL_OUT_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define PWM_PSEL_OUT_CONNECT_Msk             ( 0x1UL << PWM_PSEL_OUT_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define PWM_PSEL_OUT_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define PWM_PSEL_OUT_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bit 5 : Port number */
#define PWM_PSEL_OUT_PORT_Pos                ( 5UL )                            /*!< Position of PORT field. */
#define PWM_PSEL_OUT_PORT_Msk                ( 0x1UL << PWM_PSEL_OUT_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define PWM_PSEL_OUT_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define PWM_PSEL_OUT_PIN_Msk                 ( 0x1FUL << PWM_PSEL_OUT_PIN_Pos ) /*!< Bit mask of PIN field. */


/* Peripheral: QDEC */
/* Description: Quadrature Decoder 0 */

/* Register: QDEC_TASKS_START */
/* Description: Task starting the quadrature decoder */

/* Bit 0 : Task starting the quadrature decoder */
#define QDEC_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define QDEC_TASKS_START_TASKS_START_Msk        ( 0x1UL << QDEC_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define QDEC_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: QDEC_TASKS_STOP */
/* Description: Task stopping the quadrature decoder */

/* Bit 0 : Task stopping the quadrature decoder */
#define QDEC_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define QDEC_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << QDEC_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define QDEC_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

