FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: QDEC_TASKS_READCLRACC */
/* Description: Read and clear ACC and ACCDBL */

/* Bit 0 : Read and clear ACC and ACCDBL */
#define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Pos        ( 0UL )                                                 /*!< Position of TASKS_READCLRACC field. */
#define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Msk        ( 0x1UL << QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Pos ) /*!< Bit mask of TASKS_READCLRACC field. */
#define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Trigger    ( 1UL )                                                 /*!< Trigger task */

/* Register: QDEC_TASKS_RDCLRACC */
/* Description: Read and clear ACC */

/* Bit 0 : Read and clear ACC */
#define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Pos        ( 0UL )                                             /*!< Position of TASKS_RDCLRACC field. */
#define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Msk        ( 0x1UL << QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Pos ) /*!< Bit mask of TASKS_RDCLRACC field. */
#define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Trigger    ( 1UL )                                             /*!< Trigger task */

/* Register: QDEC_TASKS_RDCLRDBL */
/* Description: Read and clear ACCDBL */

/* Bit 0 : Read and clear ACCDBL */
#define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Pos        ( 0UL )                                             /*!< Position of TASKS_RDCLRDBL field. */
#define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Msk        ( 0x1UL << QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Pos ) /*!< Bit mask of TASKS_RDCLRDBL field. */
#define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Trigger    ( 1UL )                                             /*!< Trigger task */

/* Register: QDEC_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define QDEC_SUBSCRIBE_START_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define QDEC_SUBSCRIBE_START_EN_Msk         ( 0x1UL << QDEC_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define QDEC_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define QDEC_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define QDEC_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << QDEC_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QDEC_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define QDEC_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define QDEC_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << QDEC_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define QDEC_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define QDEC_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define QDEC_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << QDEC_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QDEC_SUBSCRIBE_READCLRACC */
/* Description: Subscribe configuration for task READCLRACC */

/* Bit 31 :   */
#define QDEC_SUBSCRIBE_READCLRACC_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define QDEC_SUBSCRIBE_READCLRACC_EN_Msk         ( 0x1UL << QDEC_SUBSCRIBE_READCLRACC_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_SUBSCRIBE_READCLRACC_EN_Disabled    ( 0UL )                                       /*!< Disable subscription */
#define QDEC_SUBSCRIBE_READCLRACC_EN_Enabled     ( 1UL )                                       /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task READCLRACC will subscribe to */
#define QDEC_SUBSCRIBE_READCLRACC_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define QDEC_SUBSCRIBE_READCLRACC_CHIDX_Msk      ( 0xFFUL << QDEC_SUBSCRIBE_READCLRACC_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QDEC_SUBSCRIBE_RDCLRACC */
/* Description: Subscribe configuration for task RDCLRACC */

/* Bit 31 :   */
#define QDEC_SUBSCRIBE_RDCLRACC_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define QDEC_SUBSCRIBE_RDCLRACC_EN_Msk         ( 0x1UL << QDEC_SUBSCRIBE_RDCLRACC_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_SUBSCRIBE_RDCLRACC_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define QDEC_SUBSCRIBE_RDCLRACC_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RDCLRACC will subscribe to */
#define QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Msk      ( 0xFFUL << QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QDEC_SUBSCRIBE_RDCLRDBL */
/* Description: Subscribe configuration for task RDCLRDBL */

/* Bit 31 :   */
#define QDEC_SUBSCRIBE_RDCLRDBL_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define QDEC_SUBSCRIBE_RDCLRDBL_EN_Msk         ( 0x1UL << QDEC_SUBSCRIBE_RDCLRDBL_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_SUBSCRIBE_RDCLRDBL_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define QDEC_SUBSCRIBE_RDCLRDBL_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RDCLRDBL will subscribe to */
#define QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Msk      ( 0xFFUL << QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

