FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: QDEC_EVENTS_SAMPLERDY */
/* Description: Event being generated for every new sample value written to the SAMPLE register */

/* Bit 0 : Event being generated for every new sample value written to the SAMPLE register */
#define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Pos             ( 0UL )                                                 /*!< Position of EVENTS_SAMPLERDY field. */
#define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Msk             ( 0x1UL << QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Pos ) /*!< Bit mask of EVENTS_SAMPLERDY field. */
#define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: QDEC_EVENTS_REPORTRDY */
/* Description: Non-null report ready */

/* Bit 0 : Non-null report ready */
#define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Pos             ( 0UL )                                                 /*!< Position of EVENTS_REPORTRDY field. */
#define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Msk             ( 0x1UL << QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Pos ) /*!< Bit mask of EVENTS_REPORTRDY field. */
#define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: QDEC_EVENTS_ACCOF */
/* Description: ACC or ACCDBL register overflow */

/* Bit 0 : ACC or ACCDBL register overflow */
#define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Pos             ( 0UL )                                         /*!< Position of EVENTS_ACCOF field. */
#define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Msk             ( 0x1UL << QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Pos ) /*!< Bit mask of EVENTS_ACCOF field. */
#define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: QDEC_EVENTS_DBLRDY */
/* Description: Double displacement(s) detected */

/* Bit 0 : Double displacement(s) detected */
#define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Pos             ( 0UL )                                           /*!< Position of EVENTS_DBLRDY field. */
#define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Msk             ( 0x1UL << QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Pos ) /*!< Bit mask of EVENTS_DBLRDY field. */
#define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: QDEC_EVENTS_STOPPED */
/* Description: QDEC has been stopped */

/* Bit 0 : QDEC has been stopped */
#define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STOPPED field. */
#define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: QDEC_PUBLISH_SAMPLERDY */
/* Description: Publish configuration for event SAMPLERDY */

/* Bit 31 :   */
#define QDEC_PUBLISH_SAMPLERDY_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define QDEC_PUBLISH_SAMPLERDY_EN_Msk         ( 0x1UL << QDEC_PUBLISH_SAMPLERDY_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_PUBLISH_SAMPLERDY_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define QDEC_PUBLISH_SAMPLERDY_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SAMPLERDY will publish to. */
#define QDEC_PUBLISH_SAMPLERDY_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define QDEC_PUBLISH_SAMPLERDY_CHIDX_Msk      ( 0xFFUL << QDEC_PUBLISH_SAMPLERDY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QDEC_PUBLISH_REPORTRDY */
/* Description: Publish configuration for event REPORTRDY */

/* Bit 31 :   */
#define QDEC_PUBLISH_REPORTRDY_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define QDEC_PUBLISH_REPORTRDY_EN_Msk         ( 0x1UL << QDEC_PUBLISH_REPORTRDY_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_PUBLISH_REPORTRDY_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define QDEC_PUBLISH_REPORTRDY_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event REPORTRDY will publish to. */
#define QDEC_PUBLISH_REPORTRDY_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define QDEC_PUBLISH_REPORTRDY_CHIDX_Msk      ( 0xFFUL << QDEC_PUBLISH_REPORTRDY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QDEC_PUBLISH_ACCOF */
/* Description: Publish configuration for event ACCOF */

/* Bit 31 :   */
#define QDEC_PUBLISH_ACCOF_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define QDEC_PUBLISH_ACCOF_EN_Msk         ( 0x1UL << QDEC_PUBLISH_ACCOF_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_PUBLISH_ACCOF_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define QDEC_PUBLISH_ACCOF_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ACCOF will publish to. */
#define QDEC_PUBLISH_ACCOF_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define QDEC_PUBLISH_ACCOF_CHIDX_Msk      ( 0xFFUL << QDEC_PUBLISH_ACCOF_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QDEC_PUBLISH_DBLRDY */
/* Description: Publish configuration for event DBLRDY */

/* Bit 31 :   */
#define QDEC_PUBLISH_DBLRDY_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define QDEC_PUBLISH_DBLRDY_EN_Msk         ( 0x1UL << QDEC_PUBLISH_DBLRDY_EN_Pos ) /*!< Bit mask of EN field. */
#define QDEC_PUBLISH_DBLRDY_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define QDEC_PUBLISH_DBLRDY_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

