FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: QDEC_ACCREAD */
/* Description: Snapshot of the ACC register, updated by the READCLRACC or RDCLRACC task */

/* Bits 31..0 : Snapshot of the ACC register. */
#define QDEC_ACCREAD_ACCREAD_Pos    ( 0UL )                                      /*!< Position of ACCREAD field. */
#define QDEC_ACCREAD_ACCREAD_Msk    ( 0xFFFFFFFFUL << QDEC_ACCREAD_ACCREAD_Pos ) /*!< Bit mask of ACCREAD field. */

/* Register: QDEC_PSEL_LED */
/* Description: Pin select for LED signal */

/* Bit 31 : Connection */
#define QDEC_PSEL_LED_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define QDEC_PSEL_LED_CONNECT_Msk             ( 0x1UL << QDEC_PSEL_LED_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QDEC_PSEL_LED_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define QDEC_PSEL_LED_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define QDEC_PSEL_LED_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define QDEC_PSEL_LED_PORT_Msk                ( 0x1UL << QDEC_PSEL_LED_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QDEC_PSEL_LED_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define QDEC_PSEL_LED_PIN_Msk                 ( 0x1FUL << QDEC_PSEL_LED_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QDEC_PSEL_A */
/* Description: Pin select for A signal */

/* Bit 31 : Connection */
#define QDEC_PSEL_A_CONNECT_Pos             ( 31UL )                             /*!< Position of CONNECT field. */
#define QDEC_PSEL_A_CONNECT_Msk             ( 0x1UL << QDEC_PSEL_A_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QDEC_PSEL_A_CONNECT_Connected       ( 0UL )                              /*!< Connect */
#define QDEC_PSEL_A_CONNECT_Disconnected    ( 1UL )                              /*!< Disconnect */

/* Bit 5 : Port number */
#define QDEC_PSEL_A_PORT_Pos                ( 5UL )                           /*!< Position of PORT field. */
#define QDEC_PSEL_A_PORT_Msk                ( 0x1UL << QDEC_PSEL_A_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QDEC_PSEL_A_PIN_Pos                 ( 0UL )                           /*!< Position of PIN field. */
#define QDEC_PSEL_A_PIN_Msk                 ( 0x1FUL << QDEC_PSEL_A_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QDEC_PSEL_B */
/* Description: Pin select for B signal */

/* Bit 31 : Connection */
#define QDEC_PSEL_B_CONNECT_Pos             ( 31UL )                             /*!< Position of CONNECT field. */
#define QDEC_PSEL_B_CONNECT_Msk             ( 0x1UL << QDEC_PSEL_B_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QDEC_PSEL_B_CONNECT_Connected       ( 0UL )                              /*!< Connect */
#define QDEC_PSEL_B_CONNECT_Disconnected    ( 1UL )                              /*!< Disconnect */

/* Bit 5 : Port number */
#define QDEC_PSEL_B_PORT_Pos                ( 5UL )                           /*!< Position of PORT field. */
#define QDEC_PSEL_B_PORT_Msk                ( 0x1UL << QDEC_PSEL_B_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QDEC_PSEL_B_PIN_Pos                 ( 0UL )                           /*!< Position of PIN field. */
#define QDEC_PSEL_B_PIN_Msk                 ( 0x1FUL << QDEC_PSEL_B_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QDEC_DBFEN */
/* Description: Enable input debounce filters */

/* Bit 0 : Enable input debounce filters */
#define QDEC_DBFEN_DBFEN_Pos         ( 0UL )                           /*!< Position of DBFEN field. */
#define QDEC_DBFEN_DBFEN_Msk         ( 0x1UL << QDEC_DBFEN_DBFEN_Pos ) /*!< Bit mask of DBFEN field. */
#define QDEC_DBFEN_DBFEN_Disabled    ( 0UL )                           /*!< Debounce input filters disabled */
#define QDEC_DBFEN_DBFEN_Enabled     ( 1UL )                           /*!< Debounce input filters enabled */

/* Register: QDEC_LEDPRE */
/* Description: Time period the LED is switched ON prior to sampling */

/* Bits 8..0 : Period in us the LED is switched on prior to sampling */
#define QDEC_LEDPRE_LEDPRE_Pos    ( 0UL )                               /*!< Position of LEDPRE field. */
#define QDEC_LEDPRE_LEDPRE_Msk    ( 0x1FFUL << QDEC_LEDPRE_LEDPRE_Pos ) /*!< Bit mask of LEDPRE field. */

/* Register: QDEC_ACCDBL */
/* Description: Register accumulating the number of detected double transitions */

/* Bits 3..0 : Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ). */
#define QDEC_ACCDBL_ACCDBL_Pos    ( 0UL )                             /*!< Position of ACCDBL field. */
#define QDEC_ACCDBL_ACCDBL_Msk    ( 0xFUL << QDEC_ACCDBL_ACCDBL_Pos ) /*!< Bit mask of ACCDBL field. */

/* Register: QDEC_ACCDBLREAD */
/* Description: Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task */

/* Bits 3..0 : Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is triggered. */
#define QDEC_ACCDBLREAD_ACCDBLREAD_Pos    ( 0UL )                                     /*!< Position of ACCDBLREAD field. */
#define QDEC_ACCDBLREAD_ACCDBLREAD_Msk    ( 0xFUL << QDEC_ACCDBLREAD_ACCDBLREAD_Pos ) /*!< Bit mask of ACCDBLREAD field. */


/* Peripheral: QSPI */
/* Description: External flash interface 0 */

/* Register: QSPI_TASKS_ACTIVATE */
/* Description: Activate QSPI interface */

/* Bit 0 : Activate QSPI interface */
#define QSPI_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos        ( 0UL )                                             /*!< Position of TASKS_ACTIVATE field. */
#define QSPI_TASKS_ACTIVATE_TASKS_ACTIVATE_Msk        ( 0x1UL << QSPI_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos ) /*!< Bit mask of TASKS_ACTIVATE field. */
#define QSPI_TASKS_ACTIVATE_TASKS_ACTIVATE_Trigger    ( 1UL )                                             /*!< Trigger task */

/* Register: QSPI_TASKS_READSTART */
/* Description: Start transfer from external flash memory to internal RAM */

/* Bit 0 : Start transfer from external flash memory to internal RAM */
#define QSPI_TASKS_READSTART_TASKS_READSTART_Pos        ( 0UL )                                               /*!< Position of TASKS_READSTART field. */
#define QSPI_TASKS_READSTART_TASKS_READSTART_Msk        ( 0x1UL << QSPI_TASKS_READSTART_TASKS_READSTART_Pos ) /*!< Bit mask of TASKS_READSTART field. */
#define QSPI_TASKS_READSTART_TASKS_READSTART_Trigger    ( 1UL )                                               /*!< Trigger task */

/* Register: QSPI_TASKS_WRITESTART */
/* Description: Start transfer from internal RAM to external flash memory */

/* Bit 0 : Start transfer from internal RAM to external flash memory */
#define QSPI_TASKS_WRITESTART_TASKS_WRITESTART_Pos        ( 0UL )                                                 /*!< Position of TASKS_WRITESTART field. */
#define QSPI_TASKS_WRITESTART_TASKS_WRITESTART_Msk        ( 0x1UL << QSPI_TASKS_WRITESTART_TASKS_WRITESTART_Pos ) /*!< Bit mask of TASKS_WRITESTART field. */
#define QSPI_TASKS_WRITESTART_TASKS_WRITESTART_Trigger    ( 1UL )                                                 /*!< Trigger task */

/* Register: QSPI_TASKS_ERASESTART */
/* Description: Start external flash memory erase operation */

