FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : Start external flash memory erase operation */
#define QSPI_TASKS_ERASESTART_TASKS_ERASESTART_Pos        ( 0UL )                                                 /*!< Position of TASKS_ERASESTART field. */
#define QSPI_TASKS_ERASESTART_TASKS_ERASESTART_Msk        ( 0x1UL << QSPI_TASKS_ERASESTART_TASKS_ERASESTART_Pos ) /*!< Bit mask of TASKS_ERASESTART field. */
#define QSPI_TASKS_ERASESTART_TASKS_ERASESTART_Trigger    ( 1UL )                                                 /*!< Trigger task */

/* Register: QSPI_TASKS_DEACTIVATE */
/* Description: Deactivate QSPI interface */

/* Bit 0 : Deactivate QSPI interface */
#define QSPI_TASKS_DEACTIVATE_TASKS_DEACTIVATE_Pos        ( 0UL )                                                 /*!< Position of TASKS_DEACTIVATE field. */
#define QSPI_TASKS_DEACTIVATE_TASKS_DEACTIVATE_Msk        ( 0x1UL << QSPI_TASKS_DEACTIVATE_TASKS_DEACTIVATE_Pos ) /*!< Bit mask of TASKS_DEACTIVATE field. */
#define QSPI_TASKS_DEACTIVATE_TASKS_DEACTIVATE_Trigger    ( 1UL )                                                 /*!< Trigger task */

/* Register: QSPI_SUBSCRIBE_ACTIVATE */
/* Description: Subscribe configuration for task ACTIVATE */

/* Bit 31 :   */
#define QSPI_SUBSCRIBE_ACTIVATE_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define QSPI_SUBSCRIBE_ACTIVATE_EN_Msk         ( 0x1UL << QSPI_SUBSCRIBE_ACTIVATE_EN_Pos ) /*!< Bit mask of EN field. */
#define QSPI_SUBSCRIBE_ACTIVATE_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define QSPI_SUBSCRIBE_ACTIVATE_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task ACTIVATE will subscribe to */
#define QSPI_SUBSCRIBE_ACTIVATE_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define QSPI_SUBSCRIBE_ACTIVATE_CHIDX_Msk      ( 0xFFUL << QSPI_SUBSCRIBE_ACTIVATE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QSPI_SUBSCRIBE_READSTART */
/* Description: Subscribe configuration for task READSTART */

/* Bit 31 :   */
#define QSPI_SUBSCRIBE_READSTART_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define QSPI_SUBSCRIBE_READSTART_EN_Msk         ( 0x1UL << QSPI_SUBSCRIBE_READSTART_EN_Pos ) /*!< Bit mask of EN field. */
#define QSPI_SUBSCRIBE_READSTART_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define QSPI_SUBSCRIBE_READSTART_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task READSTART will subscribe to */
#define QSPI_SUBSCRIBE_READSTART_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define QSPI_SUBSCRIBE_READSTART_CHIDX_Msk      ( 0xFFUL << QSPI_SUBSCRIBE_READSTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QSPI_SUBSCRIBE_WRITESTART */
/* Description: Subscribe configuration for task WRITESTART */

/* Bit 31 :   */
#define QSPI_SUBSCRIBE_WRITESTART_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define QSPI_SUBSCRIBE_WRITESTART_EN_Msk         ( 0x1UL << QSPI_SUBSCRIBE_WRITESTART_EN_Pos ) /*!< Bit mask of EN field. */
#define QSPI_SUBSCRIBE_WRITESTART_EN_Disabled    ( 0UL )                                       /*!< Disable subscription */
#define QSPI_SUBSCRIBE_WRITESTART_EN_Enabled     ( 1UL )                                       /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task WRITESTART will subscribe to */
#define QSPI_SUBSCRIBE_WRITESTART_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define QSPI_SUBSCRIBE_WRITESTART_CHIDX_Msk      ( 0xFFUL << QSPI_SUBSCRIBE_WRITESTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QSPI_SUBSCRIBE_ERASESTART */
/* Description: Subscribe configuration for task ERASESTART */

/* Bit 31 :   */
#define QSPI_SUBSCRIBE_ERASESTART_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define QSPI_SUBSCRIBE_ERASESTART_EN_Msk         ( 0x1UL << QSPI_SUBSCRIBE_ERASESTART_EN_Pos ) /*!< Bit mask of EN field. */
#define QSPI_SUBSCRIBE_ERASESTART_EN_Disabled    ( 0UL )                                       /*!< Disable subscription */
#define QSPI_SUBSCRIBE_ERASESTART_EN_Enabled     ( 1UL )                                       /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task ERASESTART will subscribe to */
#define QSPI_SUBSCRIBE_ERASESTART_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define QSPI_SUBSCRIBE_ERASESTART_CHIDX_Msk      ( 0xFFUL << QSPI_SUBSCRIBE_ERASESTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QSPI_SUBSCRIBE_DEACTIVATE */
/* Description: Subscribe configuration for task DEACTIVATE */

/* Bit 31 :   */
#define QSPI_SUBSCRIBE_DEACTIVATE_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define QSPI_SUBSCRIBE_DEACTIVATE_EN_Msk         ( 0x1UL << QSPI_SUBSCRIBE_DEACTIVATE_EN_Pos ) /*!< Bit mask of EN field. */
#define QSPI_SUBSCRIBE_DEACTIVATE_EN_Disabled    ( 0UL )                                       /*!< Disable subscription */
#define QSPI_SUBSCRIBE_DEACTIVATE_EN_Enabled     ( 1UL )                                       /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DEACTIVATE will subscribe to */
#define QSPI_SUBSCRIBE_DEACTIVATE_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define QSPI_SUBSCRIBE_DEACTIVATE_CHIDX_Msk      ( 0xFFUL << QSPI_SUBSCRIBE_DEACTIVATE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QSPI_EVENTS_READY */
/* Description: QSPI peripheral is ready. This event will be generated as a response to all QSPI tasks except DEACTIVATE. */

/* Bit 0 : QSPI peripheral is ready. This event will be generated as a response to all QSPI tasks except DEACTIVATE. */
#define QSPI_EVENTS_READY_EVENTS_READY_Pos             ( 0UL )                                         /*!< Position of EVENTS_READY field. */
#define QSPI_EVENTS_READY_EVENTS_READY_Msk             ( 0x1UL << QSPI_EVENTS_READY_EVENTS_READY_Pos ) /*!< Bit mask of EVENTS_READY field. */
#define QSPI_EVENTS_READY_EVENTS_READY_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define QSPI_EVENTS_READY_EVENTS_READY_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: QSPI_PUBLISH_READY */
/* Description: Publish configuration for event READY */

/* Bit 31 :   */
#define QSPI_PUBLISH_READY_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define QSPI_PUBLISH_READY_EN_Msk         ( 0x1UL << QSPI_PUBLISH_READY_EN_Pos ) /*!< Bit mask of EN field. */
#define QSPI_PUBLISH_READY_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define QSPI_PUBLISH_READY_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event READY will publish to. */
#define QSPI_PUBLISH_READY_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define QSPI_PUBLISH_READY_CHIDX_Msk      ( 0xFFUL << QSPI_PUBLISH_READY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: QSPI_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 0 : Enable or disable interrupt for event READY */
#define QSPI_INTEN_READY_Pos         ( 0UL )                           /*!< Position of READY field. */
#define QSPI_INTEN_READY_Msk         ( 0x1UL << QSPI_INTEN_READY_Pos ) /*!< Bit mask of READY field. */
#define QSPI_INTEN_READY_Disabled    ( 0UL )                           /*!< Disable */
#define QSPI_INTEN_READY_Enabled     ( 1UL )                           /*!< Enable */

