FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: QSPI_INTENSET */
/* Description: Enable interrupt */

/* Bit 0 : Write '1' to enable interrupt for event READY */
#define QSPI_INTENSET_READY_Pos         ( 0UL )                              /*!< Position of READY field. */
#define QSPI_INTENSET_READY_Msk         ( 0x1UL << QSPI_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define QSPI_INTENSET_READY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define QSPI_INTENSET_READY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define QSPI_INTENSET_READY_Set         ( 1UL )                              /*!< Enable */

/* Register: QSPI_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event READY */
#define QSPI_INTENCLR_READY_Pos         ( 0UL )                              /*!< Position of READY field. */
#define QSPI_INTENCLR_READY_Msk         ( 0x1UL << QSPI_INTENCLR_READY_Pos ) /*!< Bit mask of READY field. */
#define QSPI_INTENCLR_READY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define QSPI_INTENCLR_READY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define QSPI_INTENCLR_READY_Clear       ( 1UL )                              /*!< Disable */

/* Register: QSPI_ENABLE */
/* Description: Enable QSPI peripheral and acquire the pins selected in PSELn registers */

/* Bit 0 : Enable or disable QSPI */
#define QSPI_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define QSPI_ENABLE_ENABLE_Msk         ( 0x1UL << QSPI_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define QSPI_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable QSPI */
#define QSPI_ENABLE_ENABLE_Enabled     ( 1UL )                             /*!< Enable QSPI */

/* Register: QSPI_READ_SRC */
/* Description: Flash memory source address */

/* Bits 31..0 : Word-aligned flash memory source address. */
#define QSPI_READ_SRC_SRC_Pos    ( 0UL )                                   /*!< Position of SRC field. */
#define QSPI_READ_SRC_SRC_Msk    ( 0xFFFFFFFFUL << QSPI_READ_SRC_SRC_Pos ) /*!< Bit mask of SRC field. */

/* Register: QSPI_READ_DST */
/* Description: RAM destination address */

/* Bits 31..0 : Word-aligned RAM destination address. */
#define QSPI_READ_DST_DST_Pos    ( 0UL )                                   /*!< Position of DST field. */
#define QSPI_READ_DST_DST_Msk    ( 0xFFFFFFFFUL << QSPI_READ_DST_DST_Pos ) /*!< Bit mask of DST field. */

/* Register: QSPI_READ_CNT */
/* Description: Read transfer length */

/* Bits 20..0 : Read transfer length in number of bytes. The length must be a multiple of 4 bytes. */
#define QSPI_READ_CNT_CNT_Pos    ( 0UL )                                 /*!< Position of CNT field. */
#define QSPI_READ_CNT_CNT_Msk    ( 0x1FFFFFUL << QSPI_READ_CNT_CNT_Pos ) /*!< Bit mask of CNT field. */

/* Register: QSPI_WRITE_DST */
/* Description: Flash destination address */

/* Bits 31..0 : Word-aligned flash destination address. */
#define QSPI_WRITE_DST_DST_Pos    ( 0UL )                                    /*!< Position of DST field. */
#define QSPI_WRITE_DST_DST_Msk    ( 0xFFFFFFFFUL << QSPI_WRITE_DST_DST_Pos ) /*!< Bit mask of DST field. */

/* Register: QSPI_WRITE_SRC */
/* Description: RAM source address */

/* Bits 31..0 : Word-aligned RAM source address. */
#define QSPI_WRITE_SRC_SRC_Pos    ( 0UL )                                    /*!< Position of SRC field. */
#define QSPI_WRITE_SRC_SRC_Msk    ( 0xFFFFFFFFUL << QSPI_WRITE_SRC_SRC_Pos ) /*!< Bit mask of SRC field. */

/* Register: QSPI_WRITE_CNT */
/* Description: Write transfer length */

/* Bits 20..0 : Write transfer length in number of bytes. The length must be a multiple of 4 bytes. */
#define QSPI_WRITE_CNT_CNT_Pos    ( 0UL )                                  /*!< Position of CNT field. */
#define QSPI_WRITE_CNT_CNT_Msk    ( 0x1FFFFFUL << QSPI_WRITE_CNT_CNT_Pos ) /*!< Bit mask of CNT field. */

/* Register: QSPI_ERASE_PTR */
/* Description: Start address of flash block to be erased */

/* Bits 31..0 : Word-aligned start address of block to be erased. */
#define QSPI_ERASE_PTR_PTR_Pos    ( 0UL )                                    /*!< Position of PTR field. */
#define QSPI_ERASE_PTR_PTR_Msk    ( 0xFFFFFFFFUL << QSPI_ERASE_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: QSPI_ERASE_LEN */
/* Description: Size of block to be erased. */

/* Bits 1..0 : LEN */
#define QSPI_ERASE_LEN_LEN_Pos     ( 0UL )                             /*!< Position of LEN field. */
#define QSPI_ERASE_LEN_LEN_Msk     ( 0x3UL << QSPI_ERASE_LEN_LEN_Pos ) /*!< Bit mask of LEN field. */
#define QSPI_ERASE_LEN_LEN_4KB     ( 0UL )                             /*!< Erase 4 kB block (flash command 0x20) */
#define QSPI_ERASE_LEN_LEN_64KB    ( 1UL )                             /*!< Erase 64 kB block (flash command 0xD8) */
#define QSPI_ERASE_LEN_LEN_All     ( 2UL )                             /*!< Erase all (flash command 0xC7) */

/* Register: QSPI_PSEL_SCK */
/* Description: Pin select for serial clock SCK */

/* Bit 31 : Connection */
#define QSPI_PSEL_SCK_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define QSPI_PSEL_SCK_CONNECT_Msk             ( 0x1UL << QSPI_PSEL_SCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QSPI_PSEL_SCK_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define QSPI_PSEL_SCK_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define QSPI_PSEL_SCK_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define QSPI_PSEL_SCK_PORT_Msk                ( 0x1UL << QSPI_PSEL_SCK_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QSPI_PSEL_SCK_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define QSPI_PSEL_SCK_PIN_Msk                 ( 0x1FUL << QSPI_PSEL_SCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QSPI_PSEL_CSN */
/* Description: Pin select for chip select signal CSN. */

/* Bit 31 : Connection */
#define QSPI_PSEL_CSN_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define QSPI_PSEL_CSN_CONNECT_Msk             ( 0x1UL << QSPI_PSEL_CSN_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QSPI_PSEL_CSN_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define QSPI_PSEL_CSN_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define QSPI_PSEL_CSN_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define QSPI_PSEL_CSN_PORT_Msk                ( 0x1UL << QSPI_PSEL_CSN_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QSPI_PSEL_CSN_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define QSPI_PSEL_CSN_PIN_Msk                 ( 0x1FUL << QSPI_PSEL_CSN_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QSPI_PSEL_IO0 */
/* Description: Pin select for serial data MOSI/IO0. */

/* Bit 31 : Connection */
#define QSPI_PSEL_IO0_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define QSPI_PSEL_IO0_CONNECT_Msk             ( 0x1UL << QSPI_PSEL_IO0_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QSPI_PSEL_IO0_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define QSPI_PSEL_IO0_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define QSPI_PSEL_IO0_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define QSPI_PSEL_IO0_PORT_Msk                ( 0x1UL << QSPI_PSEL_IO0_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QSPI_PSEL_IO0_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define QSPI_PSEL_IO0_PIN_Msk                 ( 0x1FUL << QSPI_PSEL_IO0_PIN_Pos ) /*!< Bit mask of PIN field. */

