FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: QSPI_PSEL_IO1 */
/* Description: Pin select for serial data MISO/IO1. */

/* Bit 31 : Connection */
#define QSPI_PSEL_IO1_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define QSPI_PSEL_IO1_CONNECT_Msk             ( 0x1UL << QSPI_PSEL_IO1_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QSPI_PSEL_IO1_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define QSPI_PSEL_IO1_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define QSPI_PSEL_IO1_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define QSPI_PSEL_IO1_PORT_Msk                ( 0x1UL << QSPI_PSEL_IO1_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QSPI_PSEL_IO1_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define QSPI_PSEL_IO1_PIN_Msk                 ( 0x1FUL << QSPI_PSEL_IO1_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QSPI_PSEL_IO2 */
/* Description: Pin select for serial data WP/IO2. */

/* Bit 31 : Connection */
#define QSPI_PSEL_IO2_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define QSPI_PSEL_IO2_CONNECT_Msk             ( 0x1UL << QSPI_PSEL_IO2_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QSPI_PSEL_IO2_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define QSPI_PSEL_IO2_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define QSPI_PSEL_IO2_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define QSPI_PSEL_IO2_PORT_Msk                ( 0x1UL << QSPI_PSEL_IO2_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QSPI_PSEL_IO2_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define QSPI_PSEL_IO2_PIN_Msk                 ( 0x1FUL << QSPI_PSEL_IO2_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QSPI_PSEL_IO3 */
/* Description: Pin select for serial data HOLD/IO3. */

/* Bit 31 : Connection */
#define QSPI_PSEL_IO3_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define QSPI_PSEL_IO3_CONNECT_Msk             ( 0x1UL << QSPI_PSEL_IO3_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define QSPI_PSEL_IO3_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define QSPI_PSEL_IO3_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define QSPI_PSEL_IO3_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define QSPI_PSEL_IO3_PORT_Msk                ( 0x1UL << QSPI_PSEL_IO3_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define QSPI_PSEL_IO3_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define QSPI_PSEL_IO3_PIN_Msk                 ( 0x1FUL << QSPI_PSEL_IO3_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: QSPI_XIPOFFSET */
/* Description: Address offset into the external memory for Execute in Place operation. */

/* Bits 31..0 : Address offset into the external memory for Execute in Place operation. Value must be a multiple of 4. */
#define QSPI_XIPOFFSET_XIPOFFSET_Pos    ( 0UL )                                          /*!< Position of XIPOFFSET field. */
#define QSPI_XIPOFFSET_XIPOFFSET_Msk    ( 0xFFFFFFFFUL << QSPI_XIPOFFSET_XIPOFFSET_Pos ) /*!< Bit mask of XIPOFFSET field. */

/* Register: QSPI_IFCONFIG0 */
/* Description: Interface configuration. */

/* Bit 12 : Page size for commands PP, PP2O, PP4O and PP4IO. */
#define QSPI_IFCONFIG0_PPSIZE_Pos           ( 12UL )                               /*!< Position of PPSIZE field. */
#define QSPI_IFCONFIG0_PPSIZE_Msk           ( 0x1UL << QSPI_IFCONFIG0_PPSIZE_Pos ) /*!< Bit mask of PPSIZE field. */
#define QSPI_IFCONFIG0_PPSIZE_256Bytes      ( 0UL )                                /*!< 256 bytes. */
#define QSPI_IFCONFIG0_PPSIZE_512Bytes      ( 1UL )                                /*!< 512 bytes. */

/* Bit 7 : Enable deep power-down mode (DPM) feature. */
#define QSPI_IFCONFIG0_DPMENABLE_Pos        ( 7UL )                                   /*!< Position of DPMENABLE field. */
#define QSPI_IFCONFIG0_DPMENABLE_Msk        ( 0x1UL << QSPI_IFCONFIG0_DPMENABLE_Pos ) /*!< Bit mask of DPMENABLE field. */
#define QSPI_IFCONFIG0_DPMENABLE_Disable    ( 0UL )                                   /*!< Disable DPM feature. */
#define QSPI_IFCONFIG0_DPMENABLE_Enable     ( 1UL )                                   /*!< Enable DPM feature. */

/* Bit 6 : Addressing mode. */
#define QSPI_IFCONFIG0_ADDRMODE_Pos         ( 6UL )                                  /*!< Position of ADDRMODE field. */
#define QSPI_IFCONFIG0_ADDRMODE_Msk         ( 0x1UL << QSPI_IFCONFIG0_ADDRMODE_Pos ) /*!< Bit mask of ADDRMODE field. */
#define QSPI_IFCONFIG0_ADDRMODE_24BIT       ( 0UL )                                  /*!< 24-bit addressing. */
#define QSPI_IFCONFIG0_ADDRMODE_32BIT       ( 1UL )                                  /*!< 32-bit addressing. */

/* Bits 5..3 : Configure number of data lines and opcode used for writing. */
#define QSPI_IFCONFIG0_WRITEOC_Pos          ( 3UL )                                 /*!< Position of WRITEOC field. */
#define QSPI_IFCONFIG0_WRITEOC_Msk          ( 0x7UL << QSPI_IFCONFIG0_WRITEOC_Pos ) /*!< Bit mask of WRITEOC field. */
#define QSPI_IFCONFIG0_WRITEOC_PP           ( 0UL )                                 /*!< Single data line SPI. PP (opcode 0x02). */
#define QSPI_IFCONFIG0_WRITEOC_PP2O         ( 1UL )                                 /*!< Dual data line SPI. PP2O (opcode 0xA2). */
#define QSPI_IFCONFIG0_WRITEOC_PP4O         ( 2UL )                                 /*!< Quad data line SPI. PP4O (opcode 0x32). */
#define QSPI_IFCONFIG0_WRITEOC_PP4IO        ( 3UL )                                 /*!< Quad data line SPI. PP4IO (opcode 0x38). */

/* Bits 2..0 : Configure number of data lines and opcode used for reading. */
#define QSPI_IFCONFIG0_READOC_Pos           ( 0UL )                                /*!< Position of READOC field. */
#define QSPI_IFCONFIG0_READOC_Msk           ( 0x7UL << QSPI_IFCONFIG0_READOC_Pos ) /*!< Bit mask of READOC field. */
#define QSPI_IFCONFIG0_READOC_FASTREAD      ( 0UL )                                /*!< Single data line SPI. FAST_READ (opcode 0x0B). */
#define QSPI_IFCONFIG0_READOC_READ2O        ( 1UL )                                /*!< Dual data line SPI. READ2O (opcode 0x3B). */
#define QSPI_IFCONFIG0_READOC_READ2IO       ( 2UL )                                /*!< Dual data line SPI. READ2IO (opcode 0xBB). */
#define QSPI_IFCONFIG0_READOC_READ4O        ( 3UL )                                /*!< Quad data line SPI. READ4O (opcode 0x6B). */
#define QSPI_IFCONFIG0_READOC_READ4IO       ( 4UL )                                /*!< Quad data line SPI. READ4IO (opcode 0xEB). */

/* Register: QSPI_XIPEN */
/* Description: Enable Execute in Place operation. */

