FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : Enable XIP AHB Slave interface and access to XIP memory range */
#define QSPI_XIPEN_XIPEN_Pos        ( 0UL )                           /*!< Position of XIPEN field. */
#define QSPI_XIPEN_XIPEN_Msk        ( 0x1UL << QSPI_XIPEN_XIPEN_Pos ) /*!< Bit mask of XIPEN field. */
#define QSPI_XIPEN_XIPEN_Disable    ( 0UL )                           /*!< Disable XIP interface */
#define QSPI_XIPEN_XIPEN_Enable     ( 1UL )                           /*!< Enable XIP interface */

/* Register: QSPI_XIP_ENC_KEY0 */
/* Description: Bits 31:0 of XIP AES KEY */

/* Bits 31..0 : Bits 31:0 of XIP AES KEY */
#define QSPI_XIP_ENC_KEY0_KEY0_Pos    ( 0UL )                                        /*!< Position of KEY0 field. */
#define QSPI_XIP_ENC_KEY0_KEY0_Msk    ( 0xFFFFFFFFUL << QSPI_XIP_ENC_KEY0_KEY0_Pos ) /*!< Bit mask of KEY0 field. */

/* Register: QSPI_XIP_ENC_KEY1 */
/* Description: Bits 63:32 of XIP AES KEY */

/* Bits 31..0 : Bits 63:32 of XIP AES KEY */
#define QSPI_XIP_ENC_KEY1_KEY1_Pos    ( 0UL )                                        /*!< Position of KEY1 field. */
#define QSPI_XIP_ENC_KEY1_KEY1_Msk    ( 0xFFFFFFFFUL << QSPI_XIP_ENC_KEY1_KEY1_Pos ) /*!< Bit mask of KEY1 field. */

/* Register: QSPI_XIP_ENC_KEY2 */
/* Description: Bits 95:64 of XIP AES KEY */

/* Bits 31..0 : Bits 95:64 of XIP AES KEY */
#define QSPI_XIP_ENC_KEY2_KEY2_Pos    ( 0UL )                                        /*!< Position of KEY2 field. */
#define QSPI_XIP_ENC_KEY2_KEY2_Msk    ( 0xFFFFFFFFUL << QSPI_XIP_ENC_KEY2_KEY2_Pos ) /*!< Bit mask of KEY2 field. */

/* Register: QSPI_XIP_ENC_KEY3 */
/* Description: Bits 127:96 of XIP AES KEY */

/* Bits 31..0 : Bits 127:96 of XIP AES KEY */
#define QSPI_XIP_ENC_KEY3_KEY3_Pos    ( 0UL )                                        /*!< Position of KEY3 field. */
#define QSPI_XIP_ENC_KEY3_KEY3_Msk    ( 0xFFFFFFFFUL << QSPI_XIP_ENC_KEY3_KEY3_Pos ) /*!< Bit mask of KEY3 field. */

/* Register: QSPI_XIP_ENC_NONCE0 */
/* Description: Bits 31:0 of XIP NONCE */

/* Bits 31..0 : Bits 31:0 of XIP NONCE */
#define QSPI_XIP_ENC_NONCE0_NONCE0_Pos    ( 0UL )                                            /*!< Position of NONCE0 field. */
#define QSPI_XIP_ENC_NONCE0_NONCE0_Msk    ( 0xFFFFFFFFUL << QSPI_XIP_ENC_NONCE0_NONCE0_Pos ) /*!< Bit mask of NONCE0 field. */

/* Register: QSPI_XIP_ENC_NONCE1 */
/* Description: Bits 63:32 of XIP NONCE */

/* Bits 31..0 : Bits 63:32 of XIP NONCE */
#define QSPI_XIP_ENC_NONCE1_NONCE1_Pos    ( 0UL )                                            /*!< Position of NONCE1 field. */
#define QSPI_XIP_ENC_NONCE1_NONCE1_Msk    ( 0xFFFFFFFFUL << QSPI_XIP_ENC_NONCE1_NONCE1_Pos ) /*!< Bit mask of NONCE1 field. */

/* Register: QSPI_XIP_ENC_NONCE2 */
/* Description: Bits 95:64 of XIP NONCE */

/* Bits 31..0 : Bits 95:64 of XIP NONCE */
#define QSPI_XIP_ENC_NONCE2_NONCE2_Pos    ( 0UL )                                            /*!< Position of NONCE2 field. */
#define QSPI_XIP_ENC_NONCE2_NONCE2_Msk    ( 0xFFFFFFFFUL << QSPI_XIP_ENC_NONCE2_NONCE2_Pos ) /*!< Bit mask of NONCE2 field. */

/* Register: QSPI_XIP_ENC_ENABLE */
/* Description: Enable stream cipher for XIP */

/* Bit 0 : Enable or disable stream cipher for XIP */
#define QSPI_XIP_ENC_ENABLE_ENABLE_Pos         ( 0UL )                                     /*!< Position of ENABLE field. */
#define QSPI_XIP_ENC_ENABLE_ENABLE_Msk         ( 0x1UL << QSPI_XIP_ENC_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define QSPI_XIP_ENC_ENABLE_ENABLE_Disabled    ( 0UL )                                     /*!< Disable stream cipher for QSPI XIP */
#define QSPI_XIP_ENC_ENABLE_ENABLE_Enabled     ( 1UL )                                     /*!< Enable stream cipher for QSPI XIP */

/* Register: QSPI_DMA_ENC_KEY0 */
/* Description: Bits 31:0 of DMA AES KEY */

/* Bits 31..0 : Bits 31:0 of DMA AES KEY */
#define QSPI_DMA_ENC_KEY0_KEY0_Pos    ( 0UL )                                        /*!< Position of KEY0 field. */
#define QSPI_DMA_ENC_KEY0_KEY0_Msk    ( 0xFFFFFFFFUL << QSPI_DMA_ENC_KEY0_KEY0_Pos ) /*!< Bit mask of KEY0 field. */

/* Register: QSPI_DMA_ENC_KEY1 */
/* Description: Bits 63:32 of DMA AES KEY */

/* Bits 31..0 : Bits 63:32 of DMA AES KEY */
#define QSPI_DMA_ENC_KEY1_KEY1_Pos    ( 0UL )                                        /*!< Position of KEY1 field. */
#define QSPI_DMA_ENC_KEY1_KEY1_Msk    ( 0xFFFFFFFFUL << QSPI_DMA_ENC_KEY1_KEY1_Pos ) /*!< Bit mask of KEY1 field. */

/* Register: QSPI_DMA_ENC_KEY2 */
/* Description: Bits 95:64 of DMA AES KEY */

/* Bits 31..0 : Bits 95:64 of DMA AES KEY */
#define QSPI_DMA_ENC_KEY2_KEY2_Pos    ( 0UL )                                        /*!< Position of KEY2 field. */
#define QSPI_DMA_ENC_KEY2_KEY2_Msk    ( 0xFFFFFFFFUL << QSPI_DMA_ENC_KEY2_KEY2_Pos ) /*!< Bit mask of KEY2 field. */

/* Register: QSPI_DMA_ENC_KEY3 */
/* Description: Bits 127:96 of DMA AES KEY */

/* Bits 31..0 : Bits 127:96 of DMA AES KEY */
#define QSPI_DMA_ENC_KEY3_KEY3_Pos    ( 0UL )                                        /*!< Position of KEY3 field. */
#define QSPI_DMA_ENC_KEY3_KEY3_Msk    ( 0xFFFFFFFFUL << QSPI_DMA_ENC_KEY3_KEY3_Pos ) /*!< Bit mask of KEY3 field. */

/* Register: QSPI_DMA_ENC_NONCE0 */
/* Description: Bits 31:0 of DMA NONCE */

/* Bits 31..0 : Bits 31:0 of DMA NONCE */
#define QSPI_DMA_ENC_NONCE0_NONCE0_Pos    ( 0UL )                                            /*!< Position of NONCE0 field. */
#define QSPI_DMA_ENC_NONCE0_NONCE0_Msk    ( 0xFFFFFFFFUL << QSPI_DMA_ENC_NONCE0_NONCE0_Pos ) /*!< Bit mask of NONCE0 field. */

/* Register: QSPI_DMA_ENC_NONCE1 */
/* Description: Bits 63:32 of DMA NONCE */

/* Bits 31..0 : Bits 63:32 of DMA NONCE */
#define QSPI_DMA_ENC_NONCE1_NONCE1_Pos    ( 0UL )                                            /*!< Position of NONCE1 field. */
#define QSPI_DMA_ENC_NONCE1_NONCE1_Msk    ( 0xFFFFFFFFUL << QSPI_DMA_ENC_NONCE1_NONCE1_Pos ) /*!< Bit mask of NONCE1 field. */

/* Register: QSPI_DMA_ENC_NONCE2 */
/* Description: Bits 95:64 of DMA NONCE */

/* Bits 31..0 : Bits 95:64 of DMA NONCE */
#define QSPI_DMA_ENC_NONCE2_NONCE2_Pos    ( 0UL )                                            /*!< Position of NONCE2 field. */
#define QSPI_DMA_ENC_NONCE2_NONCE2_Msk    ( 0xFFFFFFFFUL << QSPI_DMA_ENC_NONCE2_NONCE2_Pos ) /*!< Bit mask of NONCE2 field. */

/* Register: QSPI_DMA_ENC_ENABLE */
/* Description: Enable stream cipher for EasyDMA */

/* Bit 0 : Enable or disable stream cipher for EasyDMA */
#define QSPI_DMA_ENC_ENABLE_ENABLE_Pos         ( 0UL )                                     /*!< Position of ENABLE field. */
#define QSPI_DMA_ENC_ENABLE_ENABLE_Msk         ( 0x1UL << QSPI_DMA_ENC_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define QSPI_DMA_ENC_ENABLE_ENABLE_Disabled    ( 0UL )                                     /*!< Disable stream cipher for QSPI EasyDMA */
#define QSPI_DMA_ENC_ENABLE_ENABLE_Enabled     ( 1UL )                                     /*!< Enable stream cipher for QSPI EasyDMA */

/* Register: QSPI_IFCONFIG1 */
/* Description: Interface configuration. */

/* Bits 31..28 : SCK frequency is derived from PCLK192M with SCK frequency = PCLK192M / (2*(SCKFREQ + 1)). */
#define QSPI_IFCONFIG1_SCKFREQ_Pos      ( 28UL )                                /*!< Position of SCKFREQ field. */
#define QSPI_IFCONFIG1_SCKFREQ_Msk      ( 0xFUL << QSPI_IFCONFIG1_SCKFREQ_Pos ) /*!< Bit mask of SCKFREQ field. */

/* Bit 25 : Select SPI mode. */
#define QSPI_IFCONFIG1_SPIMODE_Pos      ( 25UL )                                /*!< Position of SPIMODE field. */
#define QSPI_IFCONFIG1_SPIMODE_Msk      ( 0x1UL << QSPI_IFCONFIG1_SPIMODE_Pos ) /*!< Bit mask of SPIMODE field. */
#define QSPI_IFCONFIG1_SPIMODE_MODE0    ( 0UL )                                 /*!< Mode 0: Data are captured on the clock rising edge and data is output on a falling edge. Base level of clock is 0 (CPOL=0, CPHA=0). */
#define QSPI_IFCONFIG1_SPIMODE_MODE3    ( 1UL )                                 /*!< Mode 3: Data are captured on the clock rising edge and data is output on a falling edge. Base level of clock is 1 (CPOL=1, CPHA=1). */

