FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 24 : Enter/exit deep power-down mode (DPM) for external flash memory. */
#define QSPI_IFCONFIG1_DPMEN_Pos        ( 24UL )                              /*!< Position of DPMEN field. */
#define QSPI_IFCONFIG1_DPMEN_Msk        ( 0x1UL << QSPI_IFCONFIG1_DPMEN_Pos ) /*!< Bit mask of DPMEN field. */
#define QSPI_IFCONFIG1_DPMEN_Exit       ( 0UL )                               /*!< Exit DPM. */
#define QSPI_IFCONFIG1_DPMEN_Enter      ( 1UL )                               /*!< Enter DPM. */

/* Bits 7..0 : Minimum amount of time that the CSN pin must stay high before it can go low again. Value is specified in number of 16 MHz periods (62.5 ns). */
#define QSPI_IFCONFIG1_SCKDELAY_Pos     ( 0UL )                                   /*!< Position of SCKDELAY field. */
#define QSPI_IFCONFIG1_SCKDELAY_Msk     ( 0xFFUL << QSPI_IFCONFIG1_SCKDELAY_Pos ) /*!< Bit mask of SCKDELAY field. */

/* Register: QSPI_STATUS */
/* Description: Status register. */

/* Bits 31..24 : Value of external flash device Status Register. When the external flash has two bytes status register this field includes the value of the low byte. */
#define QSPI_STATUS_SREG_Pos        ( 24UL )                           /*!< Position of SREG field. */
#define QSPI_STATUS_SREG_Msk        ( 0xFFUL << QSPI_STATUS_SREG_Pos ) /*!< Bit mask of SREG field. */

/* Bit 3 : Ready status. */
#define QSPI_STATUS_READY_Pos       ( 3UL )                            /*!< Position of READY field. */
#define QSPI_STATUS_READY_Msk       ( 0x1UL << QSPI_STATUS_READY_Pos ) /*!< Bit mask of READY field. */
#define QSPI_STATUS_READY_BUSY      ( 0UL )                            /*!< QSPI peripheral is busy. It is not allowed to trigger any new tasks, writing custom instructions or enter/exit DPM. */
#define QSPI_STATUS_READY_READY     ( 1UL )                            /*!< QSPI peripheral is ready. It is allowed to trigger new tasks, writing custom instructions or enter/exit DPM. */

/* Bit 2 : Deep power-down mode (DPM) status of external flash. */
#define QSPI_STATUS_DPM_Pos         ( 2UL )                          /*!< Position of DPM field. */
#define QSPI_STATUS_DPM_Msk         ( 0x1UL << QSPI_STATUS_DPM_Pos ) /*!< Bit mask of DPM field. */
#define QSPI_STATUS_DPM_Disabled    ( 0UL )                          /*!< External flash is not in DPM. */
#define QSPI_STATUS_DPM_Enabled     ( 1UL )                          /*!< External flash is in DPM. */

/* Register: QSPI_DPMDUR */
/* Description: Set the duration required to enter/exit deep power-down mode (DPM). */

/* Bits 31..16 : Duration needed by external flash to exit DPM. Duration is given as EXIT * 256 * 62.5 ns. */
#define QSPI_DPMDUR_EXIT_Pos     ( 16UL )                             /*!< Position of EXIT field. */
#define QSPI_DPMDUR_EXIT_Msk     ( 0xFFFFUL << QSPI_DPMDUR_EXIT_Pos ) /*!< Bit mask of EXIT field. */

/* Bits 15..0 : Duration needed by external flash to enter DPM. Duration is given as ENTER * 256 * 62.5 ns. */
#define QSPI_DPMDUR_ENTER_Pos    ( 0UL )                               /*!< Position of ENTER field. */
#define QSPI_DPMDUR_ENTER_Msk    ( 0xFFFFUL << QSPI_DPMDUR_ENTER_Pos ) /*!< Bit mask of ENTER field. */

/* Register: QSPI_ADDRCONF */
/* Description: Extended address configuration. */

/* Bit 27 : Send WREN (write enable opcode 0x06) before instruction. */
#define QSPI_ADDRCONF_WREN_Pos           ( 27UL )                            /*!< Position of WREN field. */
#define QSPI_ADDRCONF_WREN_Msk           ( 0x1UL << QSPI_ADDRCONF_WREN_Pos ) /*!< Bit mask of WREN field. */
#define QSPI_ADDRCONF_WREN_Disable       ( 0UL )                             /*!< Do not send WREN. */
#define QSPI_ADDRCONF_WREN_Enable        ( 1UL )                             /*!< Send WREN. */

/* Bit 26 : Wait for write complete before sending command. */
#define QSPI_ADDRCONF_WIPWAIT_Pos        ( 26UL )                               /*!< Position of WIPWAIT field. */
#define QSPI_ADDRCONF_WIPWAIT_Msk        ( 0x1UL << QSPI_ADDRCONF_WIPWAIT_Pos ) /*!< Bit mask of WIPWAIT field. */
#define QSPI_ADDRCONF_WIPWAIT_Disable    ( 0UL )                                /*!< No wait. */
#define QSPI_ADDRCONF_WIPWAIT_Enable     ( 1UL )                                /*!< Wait. */

/* Bits 25..24 : Extended addressing mode. */
#define QSPI_ADDRCONF_MODE_Pos           ( 24UL )                            /*!< Position of MODE field. */
#define QSPI_ADDRCONF_MODE_Msk           ( 0x3UL << QSPI_ADDRCONF_MODE_Pos ) /*!< Bit mask of MODE field. */
#define QSPI_ADDRCONF_MODE_NoInstr       ( 0UL )                             /*!< Do not send any instruction. */
#define QSPI_ADDRCONF_MODE_Opcode        ( 1UL )                             /*!< Send opcode. */
#define QSPI_ADDRCONF_MODE_OpByte0       ( 2UL )                             /*!< Send opcode, BYTE0. */
#define QSPI_ADDRCONF_MODE_All           ( 3UL )                             /*!< Send opcode, BYTE0, BYTE1. */

/* Bits 23..16 : Byte 1 following byte 0. */
#define QSPI_ADDRCONF_BYTE1_Pos          ( 16UL )                              /*!< Position of BYTE1 field. */
#define QSPI_ADDRCONF_BYTE1_Msk          ( 0xFFUL << QSPI_ADDRCONF_BYTE1_Pos ) /*!< Bit mask of BYTE1 field. */

/* Bits 15..8 : Byte 0 following opcode. */
#define QSPI_ADDRCONF_BYTE0_Pos          ( 8UL )                               /*!< Position of BYTE0 field. */
#define QSPI_ADDRCONF_BYTE0_Msk          ( 0xFFUL << QSPI_ADDRCONF_BYTE0_Pos ) /*!< Bit mask of BYTE0 field. */

/* Bits 7..0 : Opcode that enters the 32-bit addressing mode. */
#define QSPI_ADDRCONF_OPCODE_Pos         ( 0UL )                                /*!< Position of OPCODE field. */
#define QSPI_ADDRCONF_OPCODE_Msk         ( 0xFFUL << QSPI_ADDRCONF_OPCODE_Pos ) /*!< Bit mask of OPCODE field. */

/* Register: QSPI_CINSTRCONF */
/* Description: Custom instruction configuration register. */

/* Bit 17 : Stop (finalize) long frame transaction */
#define QSPI_CINSTRCONF_LFSTOP_Pos         ( 17UL )                                /*!< Position of LFSTOP field. */
#define QSPI_CINSTRCONF_LFSTOP_Msk         ( 0x1UL << QSPI_CINSTRCONF_LFSTOP_Pos ) /*!< Bit mask of LFSTOP field. */
#define QSPI_CINSTRCONF_LFSTOP_Stop        ( 1UL )                                 /*!< Stop */

/* Bit 16 : Enable Long frame mode. When enabled, a custom instruction transaction has to be ended by writing the LFSTOP field. */
#define QSPI_CINSTRCONF_LFEN_Pos           ( 16UL )                              /*!< Position of LFEN field. */
#define QSPI_CINSTRCONF_LFEN_Msk           ( 0x1UL << QSPI_CINSTRCONF_LFEN_Pos ) /*!< Bit mask of LFEN field. */
#define QSPI_CINSTRCONF_LFEN_Disable       ( 0UL )                               /*!< Long frame mode disabled */
#define QSPI_CINSTRCONF_LFEN_Enable        ( 1UL )                               /*!< Long frame mode enabled */

/* Bit 15 : Send WREN (write enable opcode 0x06) before instruction. */
#define QSPI_CINSTRCONF_WREN_Pos           ( 15UL )                              /*!< Position of WREN field. */
#define QSPI_CINSTRCONF_WREN_Msk           ( 0x1UL << QSPI_CINSTRCONF_WREN_Pos ) /*!< Bit mask of WREN field. */
#define QSPI_CINSTRCONF_WREN_Disable       ( 0UL )                               /*!< Do not send WREN. */
#define QSPI_CINSTRCONF_WREN_Enable        ( 1UL )                               /*!< Send WREN. */

/* Bit 14 : Wait for write complete before sending command. */
#define QSPI_CINSTRCONF_WIPWAIT_Pos        ( 14UL )                                 /*!< Position of WIPWAIT field. */
#define QSPI_CINSTRCONF_WIPWAIT_Msk        ( 0x1UL << QSPI_CINSTRCONF_WIPWAIT_Pos ) /*!< Bit mask of WIPWAIT field. */
#define QSPI_CINSTRCONF_WIPWAIT_Disable    ( 0UL )                                  /*!< No wait. */
#define QSPI_CINSTRCONF_WIPWAIT_Enable     ( 1UL )                                  /*!< Wait. */

/* Bit 13 : Level of the IO3 pin (if connected) during transmission of custom instruction. */
#define QSPI_CINSTRCONF_LIO3_Pos           ( 13UL )                              /*!< Position of LIO3 field. */
#define QSPI_CINSTRCONF_LIO3_Msk           ( 0x1UL << QSPI_CINSTRCONF_LIO3_Pos ) /*!< Bit mask of LIO3 field. */

/* Bit 12 : Level of the IO2 pin (if connected) during transmission of custom instruction. */
#define QSPI_CINSTRCONF_LIO2_Pos           ( 12UL )                              /*!< Position of LIO2 field. */
#define QSPI_CINSTRCONF_LIO2_Msk           ( 0x1UL << QSPI_CINSTRCONF_LIO2_Pos ) /*!< Bit mask of LIO2 field. */

/* Bits 11..8 : Length of custom instruction in number of bytes. */
#define QSPI_CINSTRCONF_LENGTH_Pos         ( 8UL )                                 /*!< Position of LENGTH field. */
#define QSPI_CINSTRCONF_LENGTH_Msk         ( 0xFUL << QSPI_CINSTRCONF_LENGTH_Pos ) /*!< Bit mask of LENGTH field. */
#define QSPI_CINSTRCONF_LENGTH_1B          ( 1UL )                                 /*!< Send opcode only. */
#define QSPI_CINSTRCONF_LENGTH_2B          ( 2UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0. */
#define QSPI_CINSTRCONF_LENGTH_3B          ( 3UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0 -&gt; CINSTRDAT0.BYTE1. */
#define QSPI_CINSTRCONF_LENGTH_4B          ( 4UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0 -&gt; CINSTRDAT0.BYTE2. */
#define QSPI_CINSTRCONF_LENGTH_5B          ( 5UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0 -&gt; CINSTRDAT0.BYTE3. */
#define QSPI_CINSTRCONF_LENGTH_6B          ( 6UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0 -&gt; CINSTRDAT1.BYTE4. */
#define QSPI_CINSTRCONF_LENGTH_7B          ( 7UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0 -&gt; CINSTRDAT1.BYTE5. */
#define QSPI_CINSTRCONF_LENGTH_8B          ( 8UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0 -&gt; CINSTRDAT1.BYTE6. */
#define QSPI_CINSTRCONF_LENGTH_9B          ( 9UL )                                 /*!< Send opcode, CINSTRDAT0.BYTE0 -&gt; CINSTRDAT1.BYTE7. */

/* Bits 7..0 : Opcode of Custom instruction. */
#define QSPI_CINSTRCONF_OPCODE_Pos         ( 0UL )                                  /*!< Position of OPCODE field. */
#define QSPI_CINSTRCONF_OPCODE_Msk         ( 0xFFUL << QSPI_CINSTRCONF_OPCODE_Pos ) /*!< Bit mask of OPCODE field. */

/* Register: QSPI_CINSTRDAT0 */
/* Description: Custom instruction data register 0. */

/* Bits 31..24 : Data byte 3 */
#define QSPI_CINSTRDAT0_BYTE3_Pos    ( 24UL )                                /*!< Position of BYTE3 field. */
#define QSPI_CINSTRDAT0_BYTE3_Msk    ( 0xFFUL << QSPI_CINSTRDAT0_BYTE3_Pos ) /*!< Bit mask of BYTE3 field. */

/* Bits 23..16 : Data byte 2 */
#define QSPI_CINSTRDAT0_BYTE2_Pos    ( 16UL )                                /*!< Position of BYTE2 field. */
#define QSPI_CINSTRDAT0_BYTE2_Msk    ( 0xFFUL << QSPI_CINSTRDAT0_BYTE2_Pos ) /*!< Bit mask of BYTE2 field. */

