FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 15..8 : Data byte 1 */
#define QSPI_CINSTRDAT0_BYTE1_Pos    ( 8UL )                                 /*!< Position of BYTE1 field. */
#define QSPI_CINSTRDAT0_BYTE1_Msk    ( 0xFFUL << QSPI_CINSTRDAT0_BYTE1_Pos ) /*!< Bit mask of BYTE1 field. */

/* Bits 7..0 : Data byte 0 */
#define QSPI_CINSTRDAT0_BYTE0_Pos    ( 0UL )                                 /*!< Position of BYTE0 field. */
#define QSPI_CINSTRDAT0_BYTE0_Msk    ( 0xFFUL << QSPI_CINSTRDAT0_BYTE0_Pos ) /*!< Bit mask of BYTE0 field. */

/* Register: QSPI_CINSTRDAT1 */
/* Description: Custom instruction data register 1. */

/* Bits 31..24 : Data byte 7 */
#define QSPI_CINSTRDAT1_BYTE7_Pos    ( 24UL )                                /*!< Position of BYTE7 field. */
#define QSPI_CINSTRDAT1_BYTE7_Msk    ( 0xFFUL << QSPI_CINSTRDAT1_BYTE7_Pos ) /*!< Bit mask of BYTE7 field. */

/* Bits 23..16 : Data byte 6 */
#define QSPI_CINSTRDAT1_BYTE6_Pos    ( 16UL )                                /*!< Position of BYTE6 field. */
#define QSPI_CINSTRDAT1_BYTE6_Msk    ( 0xFFUL << QSPI_CINSTRDAT1_BYTE6_Pos ) /*!< Bit mask of BYTE6 field. */

/* Bits 15..8 : Data byte 5 */
#define QSPI_CINSTRDAT1_BYTE5_Pos    ( 8UL )                                 /*!< Position of BYTE5 field. */
#define QSPI_CINSTRDAT1_BYTE5_Msk    ( 0xFFUL << QSPI_CINSTRDAT1_BYTE5_Pos ) /*!< Bit mask of BYTE5 field. */

/* Bits 7..0 : Data byte 4 */
#define QSPI_CINSTRDAT1_BYTE4_Pos    ( 0UL )                                 /*!< Position of BYTE4 field. */
#define QSPI_CINSTRDAT1_BYTE4_Msk    ( 0xFFUL << QSPI_CINSTRDAT1_BYTE4_Pos ) /*!< Bit mask of BYTE4 field. */

/* Register: QSPI_IFTIMING */
/* Description: SPI interface timing. */

/* Bits 10..8 : Timing related to sampling of the input serial data. The value of RXDELAY specifies the number of prescaled 192 MHz cycles delay from the the rising edge of the SPI Clock (SCK) until the input serial data is sampled. For example, if RXDELAY is set to 0, the input serial data is sampled on the rising edge of SCK. */
#define QSPI_IFTIMING_RXDELAY_Pos    ( 8UL )                                /*!< Position of RXDELAY field. */
#define QSPI_IFTIMING_RXDELAY_Msk    ( 0x7UL << QSPI_IFTIMING_RXDELAY_Pos ) /*!< Bit mask of RXDELAY field. */


/* Peripheral: REGULATORS */
/* Description: Voltage regulators 0 */

/* Register: REGULATORS_MAINREGSTATUS */
/* Description: Main supply status */

/* Bit 0 : VREGH status */
#define REGULATORS_MAINREGSTATUS_VREGH_Pos         ( 0UL )                                         /*!< Position of VREGH field. */
#define REGULATORS_MAINREGSTATUS_VREGH_Msk         ( 0x1UL << REGULATORS_MAINREGSTATUS_VREGH_Pos ) /*!< Bit mask of VREGH field. */
#define REGULATORS_MAINREGSTATUS_VREGH_Inactive    ( 0UL )                                         /*!< Normal voltage mode. Voltage supplied on VDD and VDDH. */
#define REGULATORS_MAINREGSTATUS_VREGH_Active      ( 1UL )                                         /*!< High voltage mode. Voltage supplied on VDDH. */

/* Register: REGULATORS_SYSTEMOFF */
/* Description: System OFF register */

/* Bit 0 : Enable System OFF mode */
#define REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos      ( 0UL )                                         /*!< Position of SYSTEMOFF field. */
#define REGULATORS_SYSTEMOFF_SYSTEMOFF_Msk      ( 0x1UL << REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos ) /*!< Bit mask of SYSTEMOFF field. */
#define REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter    ( 1UL )                                         /*!< Enable System OFF mode */

/* Register: REGULATORS_POFCON */
/* Description: Power-fail comparator configuration */

/* Bits 11..8 : Power-fail comparator threshold setting for voltage supply on VDDH */
#define REGULATORS_POFCON_THRESHOLDVDDH_Pos    ( 8UL )                                          /*!< Position of THRESHOLDVDDH field. */
#define REGULATORS_POFCON_THRESHOLDVDDH_Msk    ( 0xFUL << REGULATORS_POFCON_THRESHOLDVDDH_Pos ) /*!< Bit mask of THRESHOLDVDDH field. */
#define REGULATORS_POFCON_THRESHOLDVDDH_V27    ( 0UL )                                          /*!< Set threshold to 2.7 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V28    ( 1UL )                                          /*!< Set threshold to 2.8 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V29    ( 2UL )                                          /*!< Set threshold to 2.9 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V30    ( 3UL )                                          /*!< Set threshold to 3.0 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V31    ( 4UL )                                          /*!< Set threshold to 3.1 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V32    ( 5UL )                                          /*!< Set threshold to 3.2 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V33    ( 6UL )                                          /*!< Set threshold to 3.3 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V34    ( 7UL )                                          /*!< Set threshold to 3.4 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V35    ( 8UL )                                          /*!< Set threshold to 3.5 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V36    ( 9UL )                                          /*!< Set threshold to 3.6 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V37    ( 10UL )                                         /*!< Set threshold to 3.7 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V38    ( 11UL )                                         /*!< Set threshold to 3.8 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V39    ( 12UL )                                         /*!< Set threshold to 3.9 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V40    ( 13UL )                                         /*!< Set threshold to 4.0 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V41    ( 14UL )                                         /*!< Set threshold to 4.1 V */
#define REGULATORS_POFCON_THRESHOLDVDDH_V42    ( 15UL )                                         /*!< Set threshold to 4.2 V */

/* Bits 4..1 : Power-fail comparator threshold setting */
#define REGULATORS_POFCON_THRESHOLD_Pos        ( 1UL )                                      /*!< Position of THRESHOLD field. */
#define REGULATORS_POFCON_THRESHOLD_Msk        ( 0xFUL << REGULATORS_POFCON_THRESHOLD_Pos ) /*!< Bit mask of THRESHOLD field. */
#define REGULATORS_POFCON_THRESHOLD_V19        ( 6UL )                                      /*!< Set threshold to 1.9 V */
#define REGULATORS_POFCON_THRESHOLD_V20        ( 7UL )                                      /*!< Set threshold to 2.0 V */
#define REGULATORS_POFCON_THRESHOLD_V21        ( 8UL )                                      /*!< Set threshold to 2.1 V */
#define REGULATORS_POFCON_THRESHOLD_V22        ( 9UL )                                      /*!< Set threshold to 2.2 V */
#define REGULATORS_POFCON_THRESHOLD_V23        ( 10UL )                                     /*!< Set threshold to 2.3 V */
#define REGULATORS_POFCON_THRESHOLD_V24        ( 11UL )                                     /*!< Set threshold to 2.4 V */
#define REGULATORS_POFCON_THRESHOLD_V25        ( 12UL )                                     /*!< Set threshold to 2.5 V */
#define REGULATORS_POFCON_THRESHOLD_V26        ( 13UL )                                     /*!< Set threshold to 2.6 V */
#define REGULATORS_POFCON_THRESHOLD_V27        ( 14UL )                                     /*!< Set threshold to 2.7 V */
#define REGULATORS_POFCON_THRESHOLD_V28        ( 15UL )                                     /*!< Set threshold to 2.8 V */

/* Bit 0 : Enable or disable power-fail comparator */
#define REGULATORS_POFCON_POF_Pos              ( 0UL )                                /*!< Position of POF field. */
#define REGULATORS_POFCON_POF_Msk              ( 0x1UL << REGULATORS_POFCON_POF_Pos ) /*!< Bit mask of POF field. */
#define REGULATORS_POFCON_POF_Disabled         ( 0UL )                                /*!< Disable */
#define REGULATORS_POFCON_POF_Enabled          ( 1UL )                                /*!< Enable */

