FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: REGULATORS_VREGMAIN_DCDCEN */
/* Description: DC/DC enable register for VREGMAIN */

/* Bit 0 : Enable or disable DC/DC converter */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Pos         ( 0UL )                                            /*!< Position of DCDCEN field. */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Msk         ( 0x1UL << REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Pos ) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Disabled    ( 0UL )                                            /*!< Disable */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Enabled     ( 1UL )                                            /*!< Enable */

/* Register: REGULATORS_VREGRADIO_DCDCEN */
/* Description: DC/DC enable register for VREGRADIO */

/* Bit 0 : Enable or disable DC/DC converter */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Pos         ( 0UL )                                             /*!< Position of DCDCEN field. */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Msk         ( 0x1UL << REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Pos ) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Disabled    ( 0UL )                                             /*!< Disable */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Enabled     ( 1UL )                                             /*!< Enable */

/* Register: REGULATORS_VREGH_DCDCEN */
/* Description: DC/DC enable register for VREGH */

/* Bit 0 : Enable or disable DC/DC converter */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Pos         ( 0UL )                                         /*!< Position of DCDCEN field. */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Msk         ( 0x1UL << REGULATORS_VREGH_DCDCEN_DCDCEN_Pos ) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Disabled    ( 0UL )                                         /*!< Disable */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Enabled     ( 1UL )                                         /*!< Enable */


/* Peripheral: RESET */
/* Description: Reset control 0 */

/* Register: RESET_RESETREAS */
/* Description: Reset reason */

/* Bit 26 : Reset after wakeup from System OFF mode due to VBUS rising into valid range */
#define RESET_RESETREAS_VBUS_Pos                ( 26UL )                              /*!< Position of VBUS field. */
#define RESET_RESETREAS_VBUS_Msk                ( 0x1UL << RESET_RESETREAS_VBUS_Pos ) /*!< Bit mask of VBUS field. */
#define RESET_RESETREAS_VBUS_NotDetected        ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_VBUS_Detected           ( 1UL )                               /*!< Detected */

/* Bit 25 : Reset from application watchdog timer 1 detected */
#define RESET_RESETREAS_DOG1_Pos                ( 25UL )                              /*!< Position of DOG1 field. */
#define RESET_RESETREAS_DOG1_Msk                ( 0x1UL << RESET_RESETREAS_DOG1_Pos ) /*!< Bit mask of DOG1 field. */
#define RESET_RESETREAS_DOG1_NotDetected        ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_DOG1_Detected           ( 1UL )                               /*!< Detected */

/* Bit 24 : Reset after wakeup from System OFF mode due to NFC field being detected */
#define RESET_RESETREAS_NFC_Pos                 ( 24UL )                             /*!< Position of NFC field. */
#define RESET_RESETREAS_NFC_Msk                 ( 0x1UL << RESET_RESETREAS_NFC_Pos ) /*!< Bit mask of NFC field. */
#define RESET_RESETREAS_NFC_NotDetected         ( 0UL )                              /*!< Not detected */
#define RESET_RESETREAS_NFC_Detected            ( 1UL )                              /*!< Detected */

/* Bit 7 : Reset due to wakeup from System OFF mode when wakeup is triggered by entering the Debug Interface mode */
#define RESET_RESETREAS_DIF_Pos                 ( 7UL )                              /*!< Position of DIF field. */
#define RESET_RESETREAS_DIF_Msk                 ( 0x1UL << RESET_RESETREAS_DIF_Pos ) /*!< Bit mask of DIF field. */
#define RESET_RESETREAS_DIF_NotDetected         ( 0UL )                              /*!< Not detected */
#define RESET_RESETREAS_DIF_Detected            ( 1UL )                              /*!< Detected */

/* Bit 6 : Reset due to wakeup from System OFF mode when wakeup is triggered by ANADETECT signal from LPCOMP */
#define RESET_RESETREAS_LPCOMP_Pos              ( 6UL )                                 /*!< Position of LPCOMP field. */
#define RESET_RESETREAS_LPCOMP_Msk              ( 0x1UL << RESET_RESETREAS_LPCOMP_Pos ) /*!< Bit mask of LPCOMP field. */
#define RESET_RESETREAS_LPCOMP_NotDetected      ( 0UL )                                 /*!< Not detected */
#define RESET_RESETREAS_LPCOMP_Detected         ( 1UL )                                 /*!< Detected */

/* Bit 5 : Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO */
#define RESET_RESETREAS_OFF_Pos                 ( 5UL )                              /*!< Position of OFF field. */
#define RESET_RESETREAS_OFF_Msk                 ( 0x1UL << RESET_RESETREAS_OFF_Pos ) /*!< Bit mask of OFF field. */
#define RESET_RESETREAS_OFF_NotDetected         ( 0UL )                              /*!< Not detected */
#define RESET_RESETREAS_OFF_Detected            ( 1UL )                              /*!< Detected */

/* Bit 4 : Reset from application CPU lockup detected */
#define RESET_RESETREAS_LOCKUP_Pos              ( 4UL )                                 /*!< Position of LOCKUP field. */
#define RESET_RESETREAS_LOCKUP_Msk              ( 0x1UL << RESET_RESETREAS_LOCKUP_Pos ) /*!< Bit mask of LOCKUP field. */
#define RESET_RESETREAS_LOCKUP_NotDetected      ( 0UL )                                 /*!< Not detected */
#define RESET_RESETREAS_LOCKUP_Detected         ( 1UL )                                 /*!< Detected */

/* Bit 3 : Reset from application soft reset detected */
#define RESET_RESETREAS_SREQ_Pos                ( 3UL )                               /*!< Position of SREQ field. */
#define RESET_RESETREAS_SREQ_Msk                ( 0x1UL << RESET_RESETREAS_SREQ_Pos ) /*!< Bit mask of SREQ field. */
#define RESET_RESETREAS_SREQ_NotDetected        ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_SREQ_Detected           ( 1UL )                               /*!< Detected */

/* Bit 2 : Reset from application CTRL-AP detected */
#define RESET_RESETREAS_CTRLAP_Pos              ( 2UL )                                 /*!< Position of CTRLAP field. */
#define RESET_RESETREAS_CTRLAP_Msk              ( 0x1UL << RESET_RESETREAS_CTRLAP_Pos ) /*!< Bit mask of CTRLAP field. */
#define RESET_RESETREAS_CTRLAP_NotDetected      ( 0UL )                                 /*!< Not detected */
#define RESET_RESETREAS_CTRLAP_Detected         ( 1UL )                                 /*!< Detected */

/* Bit 1 : Reset from application watchdog timer 0 detected */
#define RESET_RESETREAS_DOG0_Pos                ( 1UL )                               /*!< Position of DOG0 field. */
#define RESET_RESETREAS_DOG0_Msk                ( 0x1UL << RESET_RESETREAS_DOG0_Pos ) /*!< Bit mask of DOG0 field. */
#define RESET_RESETREAS_DOG0_NotDetected        ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_DOG0_Detected           ( 1UL )                               /*!< Detected */

