FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : Reset from pin reset detected */
#define RESET_RESETREAS_RESETPIN_Pos            ( 0UL )                                   /*!< Position of RESETPIN field. */
#define RESET_RESETREAS_RESETPIN_Msk            ( 0x1UL << RESET_RESETREAS_RESETPIN_Pos ) /*!< Bit mask of RESETPIN field. */
#define RESET_RESETREAS_RESETPIN_NotDetected    ( 0UL )                                   /*!< Not detected */
#define RESET_RESETREAS_RESETPIN_Detected       ( 1UL )                                   /*!< Detected */

/* Register: RESET_NETWORK_FORCEOFF */
/* Description: Force network core off */

/* Bit 0 : Force network core off */
#define RESET_NETWORK_FORCEOFF_FORCEOFF_Pos        ( 0UL )                                          /*!< Position of FORCEOFF field. */
#define RESET_NETWORK_FORCEOFF_FORCEOFF_Msk        ( 0x1UL << RESET_NETWORK_FORCEOFF_FORCEOFF_Pos ) /*!< Bit mask of FORCEOFF field. */
#define RESET_NETWORK_FORCEOFF_FORCEOFF_Release    ( 0UL )                                          /*!< Release Force-OFF */
#define RESET_NETWORK_FORCEOFF_FORCEOFF_Hold       ( 1UL )                                          /*!< Hold Force-OFF */


/* Peripheral: RTC */
/* Description: Real-time counter 0 */

/* Register: RTC_TASKS_START */
/* Description: Start RTC counter */

/* Bit 0 : Start RTC counter */
#define RTC_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define RTC_TASKS_START_TASKS_START_Msk        ( 0x1UL << RTC_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define RTC_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: RTC_TASKS_STOP */
/* Description: Stop RTC counter */

/* Bit 0 : Stop RTC counter */
#define RTC_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define RTC_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << RTC_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define RTC_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: RTC_TASKS_CLEAR */
/* Description: Clear RTC counter */

/* Bit 0 : Clear RTC counter */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Pos        ( 0UL )                                      /*!< Position of TASKS_CLEAR field. */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Msk        ( 0x1UL << RTC_TASKS_CLEAR_TASKS_CLEAR_Pos ) /*!< Bit mask of TASKS_CLEAR field. */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: RTC_TASKS_TRIGOVRFLW */
/* Description: Set counter to 0xFFFFF0 */

/* Bit 0 : Set counter to 0xFFFFF0 */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos        ( 0UL )                                                /*!< Position of TASKS_TRIGOVRFLW field. */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Msk        ( 0x1UL << RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos ) /*!< Bit mask of TASKS_TRIGOVRFLW field. */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Trigger    ( 1UL )                                                /*!< Trigger task */

/* Register: RTC_TASKS_CAPTURE */
/* Description: Description collection: Capture RTC counter to CC[n] register */

/* Bit 0 : Capture RTC counter to CC[n] register */
#define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos        ( 0UL )                                          /*!< Position of TASKS_CAPTURE field. */
#define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Msk        ( 0x1UL << RTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos ) /*!< Bit mask of TASKS_CAPTURE field. */
#define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: RTC_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_START_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define RTC_SUBSCRIBE_START_EN_Msk         ( 0x1UL << RTC_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define RTC_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define RTC_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << RTC_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RTC_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define RTC_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << RTC_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define RTC_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define RTC_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << RTC_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RTC_SUBSCRIBE_CLEAR */
/* Description: Subscribe configuration for task CLEAR */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_CLEAR_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define RTC_SUBSCRIBE_CLEAR_EN_Msk         ( 0x1UL << RTC_SUBSCRIBE_CLEAR_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_CLEAR_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define RTC_SUBSCRIBE_CLEAR_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CLEAR will subscribe to */
#define RTC_SUBSCRIBE_CLEAR_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_CLEAR_CHIDX_Msk      ( 0xFFUL << RTC_SUBSCRIBE_CLEAR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RTC_SUBSCRIBE_TRIGOVRFLW */
/* Description: Subscribe configuration for task TRIGOVRFLW */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Msk         ( 0x1UL << RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task TRIGOVRFLW will subscribe to */
#define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Msk      ( 0xFFUL << RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

