FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
#define RTC_SHORTS_COMPARE2_CLEAR_Pos         ( 2UL )                                    /*!< Position of COMPARE2_CLEAR field. */
#define RTC_SHORTS_COMPARE2_CLEAR_Msk         ( 0x1UL << RTC_SHORTS_COMPARE2_CLEAR_Pos ) /*!< Bit mask of COMPARE2_CLEAR field. */
#define RTC_SHORTS_COMPARE2_CLEAR_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define RTC_SHORTS_COMPARE2_CLEAR_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
#define RTC_SHORTS_COMPARE1_CLEAR_Pos         ( 1UL )                                    /*!< Position of COMPARE1_CLEAR field. */
#define RTC_SHORTS_COMPARE1_CLEAR_Msk         ( 0x1UL << RTC_SHORTS_COMPARE1_CLEAR_Pos ) /*!< Bit mask of COMPARE1_CLEAR field. */
#define RTC_SHORTS_COMPARE1_CLEAR_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define RTC_SHORTS_COMPARE1_CLEAR_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
#define RTC_SHORTS_COMPARE0_CLEAR_Pos         ( 0UL )                                    /*!< Position of COMPARE0_CLEAR field. */
#define RTC_SHORTS_COMPARE0_CLEAR_Msk         ( 0x1UL << RTC_SHORTS_COMPARE0_CLEAR_Pos ) /*!< Bit mask of COMPARE0_CLEAR field. */
#define RTC_SHORTS_COMPARE0_CLEAR_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define RTC_SHORTS_COMPARE0_CLEAR_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Register: RTC_INTENSET */
/* Description: Enable interrupt */

/* Bit 19 : Write '1' to enable interrupt for event COMPARE[3] */
#define RTC_INTENSET_COMPARE3_Pos         ( 19UL )                               /*!< Position of COMPARE3 field. */
#define RTC_INTENSET_COMPARE3_Msk         ( 0x1UL << RTC_INTENSET_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_INTENSET_COMPARE3_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE3_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE3_Set         ( 1UL )                                /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event COMPARE[2] */
#define RTC_INTENSET_COMPARE2_Pos         ( 18UL )                               /*!< Position of COMPARE2 field. */
#define RTC_INTENSET_COMPARE2_Msk         ( 0x1UL << RTC_INTENSET_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define RTC_INTENSET_COMPARE2_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE2_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE2_Set         ( 1UL )                                /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event COMPARE[1] */
#define RTC_INTENSET_COMPARE1_Pos         ( 17UL )                               /*!< Position of COMPARE1 field. */
#define RTC_INTENSET_COMPARE1_Msk         ( 0x1UL << RTC_INTENSET_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define RTC_INTENSET_COMPARE1_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE1_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE1_Set         ( 1UL )                                /*!< Enable */

/* Bit 16 : Write '1' to enable interrupt for event COMPARE[0] */
#define RTC_INTENSET_COMPARE0_Pos         ( 16UL )                               /*!< Position of COMPARE0 field. */
#define RTC_INTENSET_COMPARE0_Msk         ( 0x1UL << RTC_INTENSET_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define RTC_INTENSET_COMPARE0_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE0_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE0_Set         ( 1UL )                                /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event OVRFLW */
#define RTC_INTENSET_OVRFLW_Pos           ( 1UL )                              /*!< Position of OVRFLW field. */
#define RTC_INTENSET_OVRFLW_Msk           ( 0x1UL << RTC_INTENSET_OVRFLW_Pos ) /*!< Bit mask of OVRFLW field. */
#define RTC_INTENSET_OVRFLW_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define RTC_INTENSET_OVRFLW_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define RTC_INTENSET_OVRFLW_Set           ( 1UL )                              /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event TICK */
#define RTC_INTENSET_TICK_Pos             ( 0UL )                            /*!< Position of TICK field. */
#define RTC_INTENSET_TICK_Msk             ( 0x1UL << RTC_INTENSET_TICK_Pos ) /*!< Bit mask of TICK field. */
#define RTC_INTENSET_TICK_Disabled        ( 0UL )                            /*!< Read: Disabled */
#define RTC_INTENSET_TICK_Enabled         ( 1UL )                            /*!< Read: Enabled */
#define RTC_INTENSET_TICK_Set             ( 1UL )                            /*!< Enable */

/* Register: RTC_INTENCLR */
/* Description: Disable interrupt */

/* Bit 19 : Write '1' to disable interrupt for event COMPARE[3] */
#define RTC_INTENCLR_COMPARE3_Pos         ( 19UL )                               /*!< Position of COMPARE3 field. */
#define RTC_INTENCLR_COMPARE3_Msk         ( 0x1UL << RTC_INTENCLR_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_INTENCLR_COMPARE3_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENCLR_COMPARE3_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENCLR_COMPARE3_Clear       ( 1UL )                                /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event COMPARE[2] */
#define RTC_INTENCLR_COMPARE2_Pos         ( 18UL )                               /*!< Position of COMPARE2 field. */
#define RTC_INTENCLR_COMPARE2_Msk         ( 0x1UL << RTC_INTENCLR_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define RTC_INTENCLR_COMPARE2_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENCLR_COMPARE2_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENCLR_COMPARE2_Clear       ( 1UL )                                /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event COMPARE[1] */
#define RTC_INTENCLR_COMPARE1_Pos         ( 17UL )                               /*!< Position of COMPARE1 field. */
#define RTC_INTENCLR_COMPARE1_Msk         ( 0x1UL << RTC_INTENCLR_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define RTC_INTENCLR_COMPARE1_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENCLR_COMPARE1_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENCLR_COMPARE1_Clear       ( 1UL )                                /*!< Disable */

