FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: SAADC_TASKS_CALIBRATEOFFSET */
/* Description: Starts offset auto-calibration */

/* Bit 0 : Starts offset auto-calibration */
#define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Pos        ( 0UL )                                                            /*!< Position of TASKS_CALIBRATEOFFSET field. */
#define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Msk        ( 0x1UL << SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Pos ) /*!< Bit mask of TASKS_CALIBRATEOFFSET field. */
#define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Trigger    ( 1UL )                                                            /*!< Trigger task */

/* Register: SAADC_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define SAADC_SUBSCRIBE_START_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define SAADC_SUBSCRIBE_START_EN_Msk         ( 0x1UL << SAADC_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define SAADC_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define SAADC_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define SAADC_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << SAADC_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_SUBSCRIBE_SAMPLE */
/* Description: Subscribe configuration for task SAMPLE */

/* Bit 31 :   */
#define SAADC_SUBSCRIBE_SAMPLE_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define SAADC_SUBSCRIBE_SAMPLE_EN_Msk         ( 0x1UL << SAADC_SUBSCRIBE_SAMPLE_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_SUBSCRIBE_SAMPLE_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define SAADC_SUBSCRIBE_SAMPLE_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SAMPLE will subscribe to */
#define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Msk      ( 0xFFUL << SAADC_SUBSCRIBE_SAMPLE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define SAADC_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define SAADC_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << SAADC_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define SAADC_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define SAADC_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define SAADC_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << SAADC_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_SUBSCRIBE_CALIBRATEOFFSET */
/* Description: Subscribe configuration for task CALIBRATEOFFSET */

/* Bit 31 :   */
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Pos         ( 31UL )                                            /*!< Position of EN field. */
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Msk         ( 0x1UL << SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Disabled    ( 0UL )                                             /*!< Disable subscription */
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Enabled     ( 1UL )                                             /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CALIBRATEOFFSET will subscribe to */
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Pos      ( 0UL )                                                 /*!< Position of CHIDX field. */
#define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Msk      ( 0xFFUL << SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_EVENTS_STARTED */
/* Description: The ADC has started */

/* Bit 0 : The ADC has started */
#define SAADC_EVENTS_STARTED_EVENTS_STARTED_Pos             ( 0UL )                                              /*!< Position of EVENTS_STARTED field. */
#define SAADC_EVENTS_STARTED_EVENTS_STARTED_Msk             ( 0x1UL << SAADC_EVENTS_STARTED_EVENTS_STARTED_Pos ) /*!< Bit mask of EVENTS_STARTED field. */
#define SAADC_EVENTS_STARTED_EVENTS_STARTED_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define SAADC_EVENTS_STARTED_EVENTS_STARTED_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: SAADC_EVENTS_END */
/* Description: The ADC has filled up the Result buffer */

/* Bit 0 : The ADC has filled up the Result buffer */
#define SAADC_EVENTS_END_EVENTS_END_Pos             ( 0UL )                                      /*!< Position of EVENTS_END field. */
#define SAADC_EVENTS_END_EVENTS_END_Msk             ( 0x1UL << SAADC_EVENTS_END_EVENTS_END_Pos ) /*!< Bit mask of EVENTS_END field. */
#define SAADC_EVENTS_END_EVENTS_END_NotGenerated    ( 0UL )                                      /*!< Event not generated */
#define SAADC_EVENTS_END_EVENTS_END_Generated       ( 1UL )                                      /*!< Event generated */

/* Register: SAADC_EVENTS_DONE */
/* Description: A conversion task has been completed. Depending on the mode, multiple conversions might be needed for a result to be transferred to RAM. */

/* Bit 0 : A conversion task has been completed. Depending on the mode, multiple conversions might be needed for a result to be transferred to RAM. */
#define SAADC_EVENTS_DONE_EVENTS_DONE_Pos             ( 0UL )                                        /*!< Position of EVENTS_DONE field. */
#define SAADC_EVENTS_DONE_EVENTS_DONE_Msk             ( 0x1UL << SAADC_EVENTS_DONE_EVENTS_DONE_Pos ) /*!< Bit mask of EVENTS_DONE field. */
#define SAADC_EVENTS_DONE_EVENTS_DONE_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define SAADC_EVENTS_DONE_EVENTS_DONE_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: SAADC_EVENTS_RESULTDONE */
/* Description: A result is ready to get transferred to RAM */

