FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : A result is ready to get transferred to RAM */
#define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Pos             ( 0UL )                                                    /*!< Position of EVENTS_RESULTDONE field. */
#define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Msk             ( 0x1UL << SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Pos ) /*!< Bit mask of EVENTS_RESULTDONE field. */
#define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_NotGenerated    ( 0UL )                                                    /*!< Event not generated */
#define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Generated       ( 1UL )                                                    /*!< Event generated */

/* Register: SAADC_EVENTS_CALIBRATEDONE */
/* Description: Calibration is complete */

/* Bit 0 : Calibration is complete */
#define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Pos             ( 0UL )                                                          /*!< Position of EVENTS_CALIBRATEDONE field. */
#define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Msk             ( 0x1UL << SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Pos ) /*!< Bit mask of EVENTS_CALIBRATEDONE field. */
#define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_NotGenerated    ( 0UL )                                                          /*!< Event not generated */
#define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Generated       ( 1UL )                                                          /*!< Event generated */

/* Register: SAADC_EVENTS_STOPPED */
/* Description: The ADC has stopped */

/* Bit 0 : The ADC has stopped */
#define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                              /*!< Position of EVENTS_STOPPED field. */
#define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: SAADC_EVENTS_CH_LIMITH */
/* Description: Description cluster: Last results is equal or above CH[n].LIMIT.HIGH */

/* Bit 0 : Last results is equal or above CH[n].LIMIT.HIGH */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_Pos             ( 0UL )                                        /*!< Position of LIMITH field. */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_Msk             ( 0x1UL << SAADC_EVENTS_CH_LIMITH_LIMITH_Pos ) /*!< Bit mask of LIMITH field. */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: SAADC_EVENTS_CH_LIMITL */
/* Description: Description cluster: Last results is equal or below CH[n].LIMIT.LOW */

/* Bit 0 : Last results is equal or below CH[n].LIMIT.LOW */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_Pos             ( 0UL )                                        /*!< Position of LIMITL field. */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_Msk             ( 0x1UL << SAADC_EVENTS_CH_LIMITL_LIMITL_Pos ) /*!< Bit mask of LIMITL field. */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: SAADC_PUBLISH_STARTED */
/* Description: Publish configuration for event STARTED */

/* Bit 31 :   */
#define SAADC_PUBLISH_STARTED_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define SAADC_PUBLISH_STARTED_EN_Msk         ( 0x1UL << SAADC_PUBLISH_STARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_STARTED_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define SAADC_PUBLISH_STARTED_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STARTED will publish to. */
#define SAADC_PUBLISH_STARTED_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_STARTED_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_STARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_PUBLISH_END */
/* Description: Publish configuration for event END */

/* Bit 31 :   */
#define SAADC_PUBLISH_END_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define SAADC_PUBLISH_END_EN_Msk         ( 0x1UL << SAADC_PUBLISH_END_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_END_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define SAADC_PUBLISH_END_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event END will publish to. */
#define SAADC_PUBLISH_END_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_END_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_END_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_PUBLISH_DONE */
/* Description: Publish configuration for event DONE */

/* Bit 31 :   */
#define SAADC_PUBLISH_DONE_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define SAADC_PUBLISH_DONE_EN_Msk         ( 0x1UL << SAADC_PUBLISH_DONE_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_DONE_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define SAADC_PUBLISH_DONE_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event DONE will publish to. */
#define SAADC_PUBLISH_DONE_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_DONE_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_DONE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_PUBLISH_RESULTDONE */
/* Description: Publish configuration for event RESULTDONE */

/* Bit 31 :   */
#define SAADC_PUBLISH_RESULTDONE_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define SAADC_PUBLISH_RESULTDONE_EN_Msk         ( 0x1UL << SAADC_PUBLISH_RESULTDONE_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_RESULTDONE_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define SAADC_PUBLISH_RESULTDONE_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RESULTDONE will publish to. */
#define SAADC_PUBLISH_RESULTDONE_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_RESULTDONE_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_RESULTDONE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

