FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: SAADC_PUBLISH_CALIBRATEDONE */
/* Description: Publish configuration for event CALIBRATEDONE */

/* Bit 31 :   */
#define SAADC_PUBLISH_CALIBRATEDONE_EN_Pos         ( 31UL )                                        /*!< Position of EN field. */
#define SAADC_PUBLISH_CALIBRATEDONE_EN_Msk         ( 0x1UL << SAADC_PUBLISH_CALIBRATEDONE_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_CALIBRATEDONE_EN_Disabled    ( 0UL )                                         /*!< Disable publishing */
#define SAADC_PUBLISH_CALIBRATEDONE_EN_Enabled     ( 1UL )                                         /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CALIBRATEDONE will publish to. */
#define SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Pos      ( 0UL )                                             /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define SAADC_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define SAADC_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << SAADC_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define SAADC_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define SAADC_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_PUBLISH_CH_LIMITH */
/* Description: Description cluster: Publish configuration for event CH[n].LIMITH */

/* Bit 31 :   */
#define SAADC_PUBLISH_CH_LIMITH_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define SAADC_PUBLISH_CH_LIMITH_EN_Msk         ( 0x1UL << SAADC_PUBLISH_CH_LIMITH_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_CH_LIMITH_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define SAADC_PUBLISH_CH_LIMITH_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CH[n].LIMITH will publish to. */
#define SAADC_PUBLISH_CH_LIMITH_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_CH_LIMITH_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_CH_LIMITH_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_PUBLISH_CH_LIMITL */
/* Description: Description cluster: Publish configuration for event CH[n].LIMITL */

/* Bit 31 :   */
#define SAADC_PUBLISH_CH_LIMITL_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define SAADC_PUBLISH_CH_LIMITL_EN_Msk         ( 0x1UL << SAADC_PUBLISH_CH_LIMITL_EN_Pos ) /*!< Bit mask of EN field. */
#define SAADC_PUBLISH_CH_LIMITL_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define SAADC_PUBLISH_CH_LIMITL_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CH[n].LIMITL will publish to. */
#define SAADC_PUBLISH_CH_LIMITL_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define SAADC_PUBLISH_CH_LIMITL_CHIDX_Msk      ( 0xFFUL << SAADC_PUBLISH_CH_LIMITL_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SAADC_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 21 : Enable or disable interrupt for event CH7LIMITL */
#define SAADC_INTEN_CH7LIMITL_Pos             ( 21UL )                               /*!< Position of CH7LIMITL field. */
#define SAADC_INTEN_CH7LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH7LIMITL_Pos ) /*!< Bit mask of CH7LIMITL field. */
#define SAADC_INTEN_CH7LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH7LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event CH7LIMITH */
#define SAADC_INTEN_CH7LIMITH_Pos             ( 20UL )                               /*!< Position of CH7LIMITH field. */
#define SAADC_INTEN_CH7LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH7LIMITH_Pos ) /*!< Bit mask of CH7LIMITH field. */
#define SAADC_INTEN_CH7LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH7LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event CH6LIMITL */
#define SAADC_INTEN_CH6LIMITL_Pos             ( 19UL )                               /*!< Position of CH6LIMITL field. */
#define SAADC_INTEN_CH6LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH6LIMITL_Pos ) /*!< Bit mask of CH6LIMITL field. */
#define SAADC_INTEN_CH6LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH6LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 18 : Enable or disable interrupt for event CH6LIMITH */
#define SAADC_INTEN_CH6LIMITH_Pos             ( 18UL )                               /*!< Position of CH6LIMITH field. */
#define SAADC_INTEN_CH6LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH6LIMITH_Pos ) /*!< Bit mask of CH6LIMITH field. */
#define SAADC_INTEN_CH6LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH6LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 17 : Enable or disable interrupt for event CH5LIMITL */
#define SAADC_INTEN_CH5LIMITL_Pos             ( 17UL )                               /*!< Position of CH5LIMITL field. */
#define SAADC_INTEN_CH5LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH5LIMITL_Pos ) /*!< Bit mask of CH5LIMITL field. */
#define SAADC_INTEN_CH5LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH5LIMITL_Enabled         ( 1UL )                                /*!< Enable */

