FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 16 : Enable or disable interrupt for event CH5LIMITH */
#define SAADC_INTEN_CH5LIMITH_Pos             ( 16UL )                               /*!< Position of CH5LIMITH field. */
#define SAADC_INTEN_CH5LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH5LIMITH_Pos ) /*!< Bit mask of CH5LIMITH field. */
#define SAADC_INTEN_CH5LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH5LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 15 : Enable or disable interrupt for event CH4LIMITL */
#define SAADC_INTEN_CH4LIMITL_Pos             ( 15UL )                               /*!< Position of CH4LIMITL field. */
#define SAADC_INTEN_CH4LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH4LIMITL_Pos ) /*!< Bit mask of CH4LIMITL field. */
#define SAADC_INTEN_CH4LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH4LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event CH4LIMITH */
#define SAADC_INTEN_CH4LIMITH_Pos             ( 14UL )                               /*!< Position of CH4LIMITH field. */
#define SAADC_INTEN_CH4LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH4LIMITH_Pos ) /*!< Bit mask of CH4LIMITH field. */
#define SAADC_INTEN_CH4LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH4LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event CH3LIMITL */
#define SAADC_INTEN_CH3LIMITL_Pos             ( 13UL )                               /*!< Position of CH3LIMITL field. */
#define SAADC_INTEN_CH3LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH3LIMITL_Pos ) /*!< Bit mask of CH3LIMITL field. */
#define SAADC_INTEN_CH3LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH3LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event CH3LIMITH */
#define SAADC_INTEN_CH3LIMITH_Pos             ( 12UL )                               /*!< Position of CH3LIMITH field. */
#define SAADC_INTEN_CH3LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH3LIMITH_Pos ) /*!< Bit mask of CH3LIMITH field. */
#define SAADC_INTEN_CH3LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH3LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 11 : Enable or disable interrupt for event CH2LIMITL */
#define SAADC_INTEN_CH2LIMITL_Pos             ( 11UL )                               /*!< Position of CH2LIMITL field. */
#define SAADC_INTEN_CH2LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH2LIMITL_Pos ) /*!< Bit mask of CH2LIMITL field. */
#define SAADC_INTEN_CH2LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH2LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event CH2LIMITH */
#define SAADC_INTEN_CH2LIMITH_Pos             ( 10UL )                               /*!< Position of CH2LIMITH field. */
#define SAADC_INTEN_CH2LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH2LIMITH_Pos ) /*!< Bit mask of CH2LIMITH field. */
#define SAADC_INTEN_CH2LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH2LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event CH1LIMITL */
#define SAADC_INTEN_CH1LIMITL_Pos             ( 9UL )                                /*!< Position of CH1LIMITL field. */
#define SAADC_INTEN_CH1LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH1LIMITL_Pos ) /*!< Bit mask of CH1LIMITL field. */
#define SAADC_INTEN_CH1LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH1LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event CH1LIMITH */
#define SAADC_INTEN_CH1LIMITH_Pos             ( 8UL )                                /*!< Position of CH1LIMITH field. */
#define SAADC_INTEN_CH1LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH1LIMITH_Pos ) /*!< Bit mask of CH1LIMITH field. */
#define SAADC_INTEN_CH1LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH1LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event CH0LIMITL */
#define SAADC_INTEN_CH0LIMITL_Pos             ( 7UL )                                /*!< Position of CH0LIMITL field. */
#define SAADC_INTEN_CH0LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH0LIMITL_Pos ) /*!< Bit mask of CH0LIMITL field. */
#define SAADC_INTEN_CH0LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH0LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event CH0LIMITH */
#define SAADC_INTEN_CH0LIMITH_Pos             ( 6UL )                                /*!< Position of CH0LIMITH field. */
#define SAADC_INTEN_CH0LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH0LIMITH_Pos ) /*!< Bit mask of CH0LIMITH field. */
#define SAADC_INTEN_CH0LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH0LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event STOPPED */
#define SAADC_INTEN_STOPPED_Pos               ( 5UL )                              /*!< Position of STOPPED field. */
#define SAADC_INTEN_STOPPED_Msk               ( 0x1UL << SAADC_INTEN_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define SAADC_INTEN_STOPPED_Disabled          ( 0UL )                              /*!< Disable */
#define SAADC_INTEN_STOPPED_Enabled           ( 1UL )                              /*!< Enable */

