FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 4 : Enable or disable interrupt for event CALIBRATEDONE */
#define SAADC_INTEN_CALIBRATEDONE_Pos         ( 4UL )                                    /*!< Position of CALIBRATEDONE field. */
#define SAADC_INTEN_CALIBRATEDONE_Msk         ( 0x1UL << SAADC_INTEN_CALIBRATEDONE_Pos ) /*!< Bit mask of CALIBRATEDONE field. */
#define SAADC_INTEN_CALIBRATEDONE_Disabled    ( 0UL )                                    /*!< Disable */
#define SAADC_INTEN_CALIBRATEDONE_Enabled     ( 1UL )                                    /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event RESULTDONE */
#define SAADC_INTEN_RESULTDONE_Pos            ( 3UL )                                 /*!< Position of RESULTDONE field. */
#define SAADC_INTEN_RESULTDONE_Msk            ( 0x1UL << SAADC_INTEN_RESULTDONE_Pos ) /*!< Bit mask of RESULTDONE field. */
#define SAADC_INTEN_RESULTDONE_Disabled       ( 0UL )                                 /*!< Disable */
#define SAADC_INTEN_RESULTDONE_Enabled        ( 1UL )                                 /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event DONE */
#define SAADC_INTEN_DONE_Pos                  ( 2UL )                           /*!< Position of DONE field. */
#define SAADC_INTEN_DONE_Msk                  ( 0x1UL << SAADC_INTEN_DONE_Pos ) /*!< Bit mask of DONE field. */
#define SAADC_INTEN_DONE_Disabled             ( 0UL )                           /*!< Disable */
#define SAADC_INTEN_DONE_Enabled              ( 1UL )                           /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event END */
#define SAADC_INTEN_END_Pos                   ( 1UL )                          /*!< Position of END field. */
#define SAADC_INTEN_END_Msk                   ( 0x1UL << SAADC_INTEN_END_Pos ) /*!< Bit mask of END field. */
#define SAADC_INTEN_END_Disabled              ( 0UL )                          /*!< Disable */
#define SAADC_INTEN_END_Enabled               ( 1UL )                          /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event STARTED */
#define SAADC_INTEN_STARTED_Pos               ( 0UL )                              /*!< Position of STARTED field. */
#define SAADC_INTEN_STARTED_Msk               ( 0x1UL << SAADC_INTEN_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define SAADC_INTEN_STARTED_Disabled          ( 0UL )                              /*!< Disable */
#define SAADC_INTEN_STARTED_Enabled           ( 1UL )                              /*!< Enable */

/* Register: SAADC_INTENSET */
/* Description: Enable interrupt */

/* Bit 21 : Write '1' to enable interrupt for event CH7LIMITL */
#define SAADC_INTENSET_CH7LIMITL_Pos             ( 21UL )                                  /*!< Position of CH7LIMITL field. */
#define SAADC_INTENSET_CH7LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH7LIMITL_Pos ) /*!< Bit mask of CH7LIMITL field. */
#define SAADC_INTENSET_CH7LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH7LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH7LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event CH7LIMITH */
#define SAADC_INTENSET_CH7LIMITH_Pos             ( 20UL )                                  /*!< Position of CH7LIMITH field. */
#define SAADC_INTENSET_CH7LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH7LIMITH_Pos ) /*!< Bit mask of CH7LIMITH field. */
#define SAADC_INTENSET_CH7LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH7LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH7LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event CH6LIMITL */
#define SAADC_INTENSET_CH6LIMITL_Pos             ( 19UL )                                  /*!< Position of CH6LIMITL field. */
#define SAADC_INTENSET_CH6LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH6LIMITL_Pos ) /*!< Bit mask of CH6LIMITL field. */
#define SAADC_INTENSET_CH6LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH6LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH6LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event CH6LIMITH */
#define SAADC_INTENSET_CH6LIMITH_Pos             ( 18UL )                                  /*!< Position of CH6LIMITH field. */
#define SAADC_INTENSET_CH6LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH6LIMITH_Pos ) /*!< Bit mask of CH6LIMITH field. */
#define SAADC_INTENSET_CH6LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH6LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH6LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event CH5LIMITL */
#define SAADC_INTENSET_CH5LIMITL_Pos             ( 17UL )                                  /*!< Position of CH5LIMITL field. */
#define SAADC_INTENSET_CH5LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH5LIMITL_Pos ) /*!< Bit mask of CH5LIMITL field. */
#define SAADC_INTENSET_CH5LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH5LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH5LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 16 : Write '1' to enable interrupt for event CH5LIMITH */
#define SAADC_INTENSET_CH5LIMITH_Pos             ( 16UL )                                  /*!< Position of CH5LIMITH field. */
#define SAADC_INTENSET_CH5LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH5LIMITH_Pos ) /*!< Bit mask of CH5LIMITH field. */
#define SAADC_INTENSET_CH5LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH5LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH5LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 15 : Write '1' to enable interrupt for event CH4LIMITL */
#define SAADC_INTENSET_CH4LIMITL_Pos             ( 15UL )                                  /*!< Position of CH4LIMITL field. */
#define SAADC_INTENSET_CH4LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH4LIMITL_Pos ) /*!< Bit mask of CH4LIMITL field. */
#define SAADC_INTENSET_CH4LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH4LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH4LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event CH4LIMITH */
#define SAADC_INTENSET_CH4LIMITH_Pos             ( 14UL )                                  /*!< Position of CH4LIMITH field. */
#define SAADC_INTENSET_CH4LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH4LIMITH_Pos ) /*!< Bit mask of CH4LIMITH field. */
#define SAADC_INTENSET_CH4LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH4LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH4LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event CH3LIMITL */
#define SAADC_INTENSET_CH3LIMITL_Pos             ( 13UL )                                  /*!< Position of CH3LIMITL field. */
#define SAADC_INTENSET_CH3LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH3LIMITL_Pos ) /*!< Bit mask of CH3LIMITL field. */
#define SAADC_INTENSET_CH3LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH3LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH3LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event CH3LIMITH */
#define SAADC_INTENSET_CH3LIMITH_Pos             ( 12UL )                                  /*!< Position of CH3LIMITH field. */
#define SAADC_INTENSET_CH3LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH3LIMITH_Pos ) /*!< Bit mask of CH3LIMITH field. */
#define SAADC_INTENSET_CH3LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH3LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH3LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 11 : Write '1' to enable interrupt for event CH2LIMITL */
#define SAADC_INTENSET_CH2LIMITL_Pos             ( 11UL )                                  /*!< Position of CH2LIMITL field. */
#define SAADC_INTENSET_CH2LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH2LIMITL_Pos ) /*!< Bit mask of CH2LIMITL field. */
#define SAADC_INTENSET_CH2LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH2LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH2LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event CH2LIMITH */
#define SAADC_INTENSET_CH2LIMITH_Pos             ( 10UL )                                  /*!< Position of CH2LIMITH field. */
#define SAADC_INTENSET_CH2LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH2LIMITH_Pos ) /*!< Bit mask of CH2LIMITH field. */
#define SAADC_INTENSET_CH2LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH2LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH2LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event CH1LIMITL */
#define SAADC_INTENSET_CH1LIMITL_Pos             ( 9UL )                                   /*!< Position of CH1LIMITL field. */
#define SAADC_INTENSET_CH1LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH1LIMITL_Pos ) /*!< Bit mask of CH1LIMITL field. */
#define SAADC_INTENSET_CH1LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH1LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH1LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event CH1LIMITH */
#define SAADC_INTENSET_CH1LIMITH_Pos             ( 8UL )                                   /*!< Position of CH1LIMITH field. */
#define SAADC_INTENSET_CH1LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH1LIMITH_Pos ) /*!< Bit mask of CH1LIMITH field. */
#define SAADC_INTENSET_CH1LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH1LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH1LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event CH0LIMITL */
#define SAADC_INTENSET_CH0LIMITL_Pos             ( 7UL )                                   /*!< Position of CH0LIMITL field. */
#define SAADC_INTENSET_CH0LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH0LIMITL_Pos ) /*!< Bit mask of CH0LIMITL field. */
#define SAADC_INTENSET_CH0LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH0LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH0LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event CH0LIMITH */
#define SAADC_INTENSET_CH0LIMITH_Pos             ( 6UL )                                   /*!< Position of CH0LIMITH field. */
#define SAADC_INTENSET_CH0LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH0LIMITH_Pos ) /*!< Bit mask of CH0LIMITH field. */
#define SAADC_INTENSET_CH0LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH0LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH0LIMITH_Set             ( 1UL )                                   /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event STOPPED */
#define SAADC_INTENSET_STOPPED_Pos               ( 5UL )                                 /*!< Position of STOPPED field. */
#define SAADC_INTENSET_STOPPED_Msk               ( 0x1UL << SAADC_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define SAADC_INTENSET_STOPPED_Disabled          ( 0UL )                                 /*!< Read: Disabled */
#define SAADC_INTENSET_STOPPED_Enabled           ( 1UL )                                 /*!< Read: Enabled */
#define SAADC_INTENSET_STOPPED_Set               ( 1UL )                                 /*!< Enable */

