FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 4 : Write '1' to enable interrupt for event CALIBRATEDONE */
#define SAADC_INTENSET_CALIBRATEDONE_Pos         ( 4UL )                                       /*!< Position of CALIBRATEDONE field. */
#define SAADC_INTENSET_CALIBRATEDONE_Msk         ( 0x1UL << SAADC_INTENSET_CALIBRATEDONE_Pos ) /*!< Bit mask of CALIBRATEDONE field. */
#define SAADC_INTENSET_CALIBRATEDONE_Disabled    ( 0UL )                                       /*!< Read: Disabled */
#define SAADC_INTENSET_CALIBRATEDONE_Enabled     ( 1UL )                                       /*!< Read: Enabled */
#define SAADC_INTENSET_CALIBRATEDONE_Set         ( 1UL )                                       /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event RESULTDONE */
#define SAADC_INTENSET_RESULTDONE_Pos            ( 3UL )                                    /*!< Position of RESULTDONE field. */
#define SAADC_INTENSET_RESULTDONE_Msk            ( 0x1UL << SAADC_INTENSET_RESULTDONE_Pos ) /*!< Bit mask of RESULTDONE field. */
#define SAADC_INTENSET_RESULTDONE_Disabled       ( 0UL )                                    /*!< Read: Disabled */
#define SAADC_INTENSET_RESULTDONE_Enabled        ( 1UL )                                    /*!< Read: Enabled */
#define SAADC_INTENSET_RESULTDONE_Set            ( 1UL )                                    /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event DONE */
#define SAADC_INTENSET_DONE_Pos                  ( 2UL )                              /*!< Position of DONE field. */
#define SAADC_INTENSET_DONE_Msk                  ( 0x1UL << SAADC_INTENSET_DONE_Pos ) /*!< Bit mask of DONE field. */
#define SAADC_INTENSET_DONE_Disabled             ( 0UL )                              /*!< Read: Disabled */
#define SAADC_INTENSET_DONE_Enabled              ( 1UL )                              /*!< Read: Enabled */
#define SAADC_INTENSET_DONE_Set                  ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event END */
#define SAADC_INTENSET_END_Pos                   ( 1UL )                             /*!< Position of END field. */
#define SAADC_INTENSET_END_Msk                   ( 0x1UL << SAADC_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define SAADC_INTENSET_END_Disabled              ( 0UL )                             /*!< Read: Disabled */
#define SAADC_INTENSET_END_Enabled               ( 1UL )                             /*!< Read: Enabled */
#define SAADC_INTENSET_END_Set                   ( 1UL )                             /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event STARTED */
#define SAADC_INTENSET_STARTED_Pos               ( 0UL )                                 /*!< Position of STARTED field. */
#define SAADC_INTENSET_STARTED_Msk               ( 0x1UL << SAADC_INTENSET_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define SAADC_INTENSET_STARTED_Disabled          ( 0UL )                                 /*!< Read: Disabled */
#define SAADC_INTENSET_STARTED_Enabled           ( 1UL )                                 /*!< Read: Enabled */
#define SAADC_INTENSET_STARTED_Set               ( 1UL )                                 /*!< Enable */

/* Register: SAADC_INTENCLR */
/* Description: Disable interrupt */

/* Bit 21 : Write '1' to disable interrupt for event CH7LIMITL */
#define SAADC_INTENCLR_CH7LIMITL_Pos             ( 21UL )                                  /*!< Position of CH7LIMITL field. */
#define SAADC_INTENCLR_CH7LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH7LIMITL_Pos ) /*!< Bit mask of CH7LIMITL field. */
#define SAADC_INTENCLR_CH7LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH7LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH7LIMITL_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 20 : Write '1' to disable interrupt for event CH7LIMITH */
#define SAADC_INTENCLR_CH7LIMITH_Pos             ( 20UL )                                  /*!< Position of CH7LIMITH field. */
#define SAADC_INTENCLR_CH7LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH7LIMITH_Pos ) /*!< Bit mask of CH7LIMITH field. */
#define SAADC_INTENCLR_CH7LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH7LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH7LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event CH6LIMITL */
#define SAADC_INTENCLR_CH6LIMITL_Pos             ( 19UL )                                  /*!< Position of CH6LIMITL field. */
#define SAADC_INTENCLR_CH6LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH6LIMITL_Pos ) /*!< Bit mask of CH6LIMITL field. */
#define SAADC_INTENCLR_CH6LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH6LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH6LIMITL_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event CH6LIMITH */
#define SAADC_INTENCLR_CH6LIMITH_Pos             ( 18UL )                                  /*!< Position of CH6LIMITH field. */
#define SAADC_INTENCLR_CH6LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH6LIMITH_Pos ) /*!< Bit mask of CH6LIMITH field. */
#define SAADC_INTENCLR_CH6LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH6LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH6LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event CH5LIMITL */
#define SAADC_INTENCLR_CH5LIMITL_Pos             ( 17UL )                                  /*!< Position of CH5LIMITL field. */
#define SAADC_INTENCLR_CH5LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH5LIMITL_Pos ) /*!< Bit mask of CH5LIMITL field. */
#define SAADC_INTENCLR_CH5LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH5LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH5LIMITL_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 16 : Write '1' to disable interrupt for event CH5LIMITH */
#define SAADC_INTENCLR_CH5LIMITH_Pos             ( 16UL )                                  /*!< Position of CH5LIMITH field. */
#define SAADC_INTENCLR_CH5LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH5LIMITH_Pos ) /*!< Bit mask of CH5LIMITH field. */
#define SAADC_INTENCLR_CH5LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH5LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH5LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 15 : Write '1' to disable interrupt for event CH4LIMITL */
#define SAADC_INTENCLR_CH4LIMITL_Pos             ( 15UL )                                  /*!< Position of CH4LIMITL field. */
#define SAADC_INTENCLR_CH4LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH4LIMITL_Pos ) /*!< Bit mask of CH4LIMITL field. */
#define SAADC_INTENCLR_CH4LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH4LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH4LIMITL_Clear           ( 1UL )                                   /*!< Disable */

