FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 14 : Write '1' to disable interrupt for event CH4LIMITH */
#define SAADC_INTENCLR_CH4LIMITH_Pos             ( 14UL )                                  /*!< Position of CH4LIMITH field. */
#define SAADC_INTENCLR_CH4LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH4LIMITH_Pos ) /*!< Bit mask of CH4LIMITH field. */
#define SAADC_INTENCLR_CH4LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH4LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH4LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 13 : Write '1' to disable interrupt for event CH3LIMITL */
#define SAADC_INTENCLR_CH3LIMITL_Pos             ( 13UL )                                  /*!< Position of CH3LIMITL field. */
#define SAADC_INTENCLR_CH3LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH3LIMITL_Pos ) /*!< Bit mask of CH3LIMITL field. */
#define SAADC_INTENCLR_CH3LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH3LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH3LIMITL_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event CH3LIMITH */
#define SAADC_INTENCLR_CH3LIMITH_Pos             ( 12UL )                                  /*!< Position of CH3LIMITH field. */
#define SAADC_INTENCLR_CH3LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH3LIMITH_Pos ) /*!< Bit mask of CH3LIMITH field. */
#define SAADC_INTENCLR_CH3LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH3LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH3LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 11 : Write '1' to disable interrupt for event CH2LIMITL */
#define SAADC_INTENCLR_CH2LIMITL_Pos             ( 11UL )                                  /*!< Position of CH2LIMITL field. */
#define SAADC_INTENCLR_CH2LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH2LIMITL_Pos ) /*!< Bit mask of CH2LIMITL field. */
#define SAADC_INTENCLR_CH2LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH2LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH2LIMITL_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event CH2LIMITH */
#define SAADC_INTENCLR_CH2LIMITH_Pos             ( 10UL )                                  /*!< Position of CH2LIMITH field. */
#define SAADC_INTENCLR_CH2LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH2LIMITH_Pos ) /*!< Bit mask of CH2LIMITH field. */
#define SAADC_INTENCLR_CH2LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH2LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH2LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event CH1LIMITL */
#define SAADC_INTENCLR_CH1LIMITL_Pos             ( 9UL )                                   /*!< Position of CH1LIMITL field. */
#define SAADC_INTENCLR_CH1LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH1LIMITL_Pos ) /*!< Bit mask of CH1LIMITL field. */
#define SAADC_INTENCLR_CH1LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH1LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH1LIMITL_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event CH1LIMITH */
#define SAADC_INTENCLR_CH1LIMITH_Pos             ( 8UL )                                   /*!< Position of CH1LIMITH field. */
#define SAADC_INTENCLR_CH1LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH1LIMITH_Pos ) /*!< Bit mask of CH1LIMITH field. */
#define SAADC_INTENCLR_CH1LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH1LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH1LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event CH0LIMITL */
#define SAADC_INTENCLR_CH0LIMITL_Pos             ( 7UL )                                   /*!< Position of CH0LIMITL field. */
#define SAADC_INTENCLR_CH0LIMITL_Msk             ( 0x1UL << SAADC_INTENCLR_CH0LIMITL_Pos ) /*!< Bit mask of CH0LIMITL field. */
#define SAADC_INTENCLR_CH0LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH0LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH0LIMITL_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event CH0LIMITH */
#define SAADC_INTENCLR_CH0LIMITH_Pos             ( 6UL )                                   /*!< Position of CH0LIMITH field. */
#define SAADC_INTENCLR_CH0LIMITH_Msk             ( 0x1UL << SAADC_INTENCLR_CH0LIMITH_Pos ) /*!< Bit mask of CH0LIMITH field. */
#define SAADC_INTENCLR_CH0LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENCLR_CH0LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENCLR_CH0LIMITH_Clear           ( 1UL )                                   /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event STOPPED */
#define SAADC_INTENCLR_STOPPED_Pos               ( 5UL )                                 /*!< Position of STOPPED field. */
#define SAADC_INTENCLR_STOPPED_Msk               ( 0x1UL << SAADC_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define SAADC_INTENCLR_STOPPED_Disabled          ( 0UL )                                 /*!< Read: Disabled */
#define SAADC_INTENCLR_STOPPED_Enabled           ( 1UL )                                 /*!< Read: Enabled */
#define SAADC_INTENCLR_STOPPED_Clear             ( 1UL )                                 /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event CALIBRATEDONE */
#define SAADC_INTENCLR_CALIBRATEDONE_Pos         ( 4UL )                                       /*!< Position of CALIBRATEDONE field. */
#define SAADC_INTENCLR_CALIBRATEDONE_Msk         ( 0x1UL << SAADC_INTENCLR_CALIBRATEDONE_Pos ) /*!< Bit mask of CALIBRATEDONE field. */
#define SAADC_INTENCLR_CALIBRATEDONE_Disabled    ( 0UL )                                       /*!< Read: Disabled */
#define SAADC_INTENCLR_CALIBRATEDONE_Enabled     ( 1UL )                                       /*!< Read: Enabled */
#define SAADC_INTENCLR_CALIBRATEDONE_Clear       ( 1UL )                                       /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event RESULTDONE */
#define SAADC_INTENCLR_RESULTDONE_Pos            ( 3UL )                                    /*!< Position of RESULTDONE field. */
#define SAADC_INTENCLR_RESULTDONE_Msk            ( 0x1UL << SAADC_INTENCLR_RESULTDONE_Pos ) /*!< Bit mask of RESULTDONE field. */
#define SAADC_INTENCLR_RESULTDONE_Disabled       ( 0UL )                                    /*!< Read: Disabled */
#define SAADC_INTENCLR_RESULTDONE_Enabled        ( 1UL )                                    /*!< Read: Enabled */
#define SAADC_INTENCLR_RESULTDONE_Clear          ( 1UL )                                    /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event DONE */
#define SAADC_INTENCLR_DONE_Pos                  ( 2UL )                              /*!< Position of DONE field. */
#define SAADC_INTENCLR_DONE_Msk                  ( 0x1UL << SAADC_INTENCLR_DONE_Pos ) /*!< Bit mask of DONE field. */
#define SAADC_INTENCLR_DONE_Disabled             ( 0UL )                              /*!< Read: Disabled */
#define SAADC_INTENCLR_DONE_Enabled              ( 1UL )                              /*!< Read: Enabled */
#define SAADC_INTENCLR_DONE_Clear                ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event END */
#define SAADC_INTENCLR_END_Pos                   ( 1UL )                             /*!< Position of END field. */
#define SAADC_INTENCLR_END_Msk                   ( 0x1UL << SAADC_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define SAADC_INTENCLR_END_Disabled              ( 0UL )                             /*!< Read: Disabled */
#define SAADC_INTENCLR_END_Enabled               ( 1UL )                             /*!< Read: Enabled */
#define SAADC_INTENCLR_END_Clear                 ( 1UL )                             /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event STARTED */
#define SAADC_INTENCLR_STARTED_Pos               ( 0UL )                                 /*!< Position of STARTED field. */
#define SAADC_INTENCLR_STARTED_Msk               ( 0x1UL << SAADC_INTENCLR_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define SAADC_INTENCLR_STARTED_Disabled          ( 0UL )                                 /*!< Read: Disabled */
#define SAADC_INTENCLR_STARTED_Enabled           ( 1UL )                                 /*!< Read: Enabled */
#define SAADC_INTENCLR_STARTED_Clear             ( 1UL )                                 /*!< Disable */

