FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 5..4 : Negative channel resistor control */
#define SAADC_CH_CONFIG_RESN_Pos           ( 4UL )                               /*!< Position of RESN field. */
#define SAADC_CH_CONFIG_RESN_Msk           ( 0x3UL << SAADC_CH_CONFIG_RESN_Pos ) /*!< Bit mask of RESN field. */
#define SAADC_CH_CONFIG_RESN_Bypass        ( 0UL )                               /*!< Bypass resistor ladder */
#define SAADC_CH_CONFIG_RESN_Pulldown      ( 1UL )                               /*!< Pull-down to GND */
#define SAADC_CH_CONFIG_RESN_Pullup        ( 2UL )                               /*!< Pull-up to VDD */
#define SAADC_CH_CONFIG_RESN_VDD1_2        ( 3UL )                               /*!< Set input at VDD/2 */

/* Bits 1..0 : Positive channel resistor control */
#define SAADC_CH_CONFIG_RESP_Pos           ( 0UL )                               /*!< Position of RESP field. */
#define SAADC_CH_CONFIG_RESP_Msk           ( 0x3UL << SAADC_CH_CONFIG_RESP_Pos ) /*!< Bit mask of RESP field. */
#define SAADC_CH_CONFIG_RESP_Bypass        ( 0UL )                               /*!< Bypass resistor ladder */
#define SAADC_CH_CONFIG_RESP_Pulldown      ( 1UL )                               /*!< Pull-down to GND */
#define SAADC_CH_CONFIG_RESP_Pullup        ( 2UL )                               /*!< Pull-up to VDD */
#define SAADC_CH_CONFIG_RESP_VDD1_2        ( 3UL )                               /*!< Set input at VDD/2 */

/* Register: SAADC_CH_LIMIT */
/* Description: Description cluster: High/low limits for event monitoring a channel */

/* Bits 31..16 : High level limit */
#define SAADC_CH_LIMIT_HIGH_Pos    ( 16UL )                                /*!< Position of HIGH field. */
#define SAADC_CH_LIMIT_HIGH_Msk    ( 0xFFFFUL << SAADC_CH_LIMIT_HIGH_Pos ) /*!< Bit mask of HIGH field. */

/* Bits 15..0 : Low level limit */
#define SAADC_CH_LIMIT_LOW_Pos     ( 0UL )                                /*!< Position of LOW field. */
#define SAADC_CH_LIMIT_LOW_Msk     ( 0xFFFFUL << SAADC_CH_LIMIT_LOW_Pos ) /*!< Bit mask of LOW field. */

/* Register: SAADC_RESOLUTION */
/* Description: Resolution configuration */

/* Bits 2..0 : Set the resolution */
#define SAADC_RESOLUTION_VAL_Pos      ( 0UL )                               /*!< Position of VAL field. */
#define SAADC_RESOLUTION_VAL_Msk      ( 0x7UL << SAADC_RESOLUTION_VAL_Pos ) /*!< Bit mask of VAL field. */
#define SAADC_RESOLUTION_VAL_8bit     ( 0UL )                               /*!< 8 bit */
#define SAADC_RESOLUTION_VAL_10bit    ( 1UL )                               /*!< 10 bit */
#define SAADC_RESOLUTION_VAL_12bit    ( 2UL )                               /*!< 12 bit */
#define SAADC_RESOLUTION_VAL_14bit    ( 3UL )                               /*!< 14 bit */

/* Register: SAADC_OVERSAMPLE */
/* Description: Oversampling configuration. OVERSAMPLE should not be combined with SCAN. The RESOLUTION is applied before averaging, thus for high OVERSAMPLE a higher RESOLUTION should be used. */

/* Bits 3..0 : Oversample control */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Pos         ( 0UL )                                      /*!< Position of OVERSAMPLE field. */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Msk         ( 0xFUL << SAADC_OVERSAMPLE_OVERSAMPLE_Pos ) /*!< Bit mask of OVERSAMPLE field. */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Bypass      ( 0UL )                                      /*!< Bypass oversampling */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over2x      ( 1UL )                                      /*!< Oversample 2x */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over4x      ( 2UL )                                      /*!< Oversample 4x */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over8x      ( 3UL )                                      /*!< Oversample 8x */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over16x     ( 4UL )                                      /*!< Oversample 16x */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over32x     ( 5UL )                                      /*!< Oversample 32x */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over64x     ( 6UL )                                      /*!< Oversample 64x */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over128x    ( 7UL )                                      /*!< Oversample 128x */
#define SAADC_OVERSAMPLE_OVERSAMPLE_Over256x    ( 8UL )                                      /*!< Oversample 256x */

/* Register: SAADC_SAMPLERATE */
/* Description: Controls normal or continuous sample rate */

/* Bit 12 : Select mode for sample rate control */
#define SAADC_SAMPLERATE_MODE_Pos       ( 12UL )                               /*!< Position of MODE field. */
#define SAADC_SAMPLERATE_MODE_Msk       ( 0x1UL << SAADC_SAMPLERATE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define SAADC_SAMPLERATE_MODE_Task      ( 0UL )                                /*!< Rate is controlled from SAMPLE task */
#define SAADC_SAMPLERATE_MODE_Timers    ( 1UL )                                /*!< Rate is controlled from local timer (use CC to control the rate) */

/* Bits 10..0 : Capture and compare value; sample rate is 16 MHz/CC */
#define SAADC_SAMPLERATE_CC_Pos         ( 0UL )                                /*!< Position of CC field. */
#define SAADC_SAMPLERATE_CC_Msk         ( 0x7FFUL << SAADC_SAMPLERATE_CC_Pos ) /*!< Bit mask of CC field. */

/* Register: SAADC_RESULT_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define SAADC_RESULT_PTR_PTR_Pos    ( 0UL )                                      /*!< Position of PTR field. */
#define SAADC_RESULT_PTR_PTR_Msk    ( 0xFFFFFFFFUL << SAADC_RESULT_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: SAADC_RESULT_MAXCNT */
/* Description: Maximum number of buffer words to transfer */

/* Bits 14..0 : Maximum number of buffer words to transfer */
#define SAADC_RESULT_MAXCNT_MAXCNT_Pos    ( 0UL )                                        /*!< Position of MAXCNT field. */
#define SAADC_RESULT_MAXCNT_MAXCNT_Msk    ( 0x7FFFUL << SAADC_RESULT_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: SAADC_RESULT_AMOUNT */
/* Description: Number of buffer words transferred since last START */

/* Bits 14..0 : Number of buffer words transferred since last START. This register can be read after an END or STOPPED event. */
#define SAADC_RESULT_AMOUNT_AMOUNT_Pos    ( 0UL )                                        /*!< Position of AMOUNT field. */
#define SAADC_RESULT_AMOUNT_AMOUNT_Msk    ( 0x7FFFUL << SAADC_RESULT_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */


/* Peripheral: SPIM */
/* Description: Serial Peripheral Interface Master with EasyDMA 0 */

/* Register: SPIM_TASKS_START */
/* Description: Start SPI transaction */

/* Bit 0 : Start SPI transaction */
#define SPIM_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define SPIM_TASKS_START_TASKS_START_Msk        ( 0x1UL << SPIM_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define SPIM_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: SPIM_TASKS_STOP */
/* Description: Stop SPI transaction */

/* Bit 0 : Stop SPI transaction */
#define SPIM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define SPIM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << SPIM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define SPIM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: SPIM_TASKS_SUSPEND */
/* Description: Suspend SPI transaction */

/* Bit 0 : Suspend SPI transaction */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos        ( 0UL )                                           /*!< Position of TASKS_SUSPEND field. */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk        ( 0x1UL << SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos ) /*!< Bit mask of TASKS_SUSPEND field. */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: SPIM_TASKS_RESUME */
/* Description: Resume SPI transaction */

/* Bit 0 : Resume SPI transaction */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Pos        ( 0UL )                                         /*!< Position of TASKS_RESUME field. */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Msk        ( 0x1UL << SPIM_TASKS_RESUME_TASKS_RESUME_Pos ) /*!< Bit mask of TASKS_RESUME field. */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: SPIM_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define SPIM_SUBSCRIBE_START_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define SPIM_SUBSCRIBE_START_EN_Msk         ( 0x1UL << SPIM_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define SPIM_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define SPIM_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define SPIM_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << SPIM_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define SPIM_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define SPIM_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << SPIM_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define SPIM_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define SPIM_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define SPIM_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << SPIM_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_SUBSCRIBE_SUSPEND */
/* Description: Subscribe configuration for task SUSPEND */

/* Bit 31 :   */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Msk         ( 0x1UL << SPIM_SUBSCRIBE_SUSPEND_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SUSPEND will subscribe to */
#define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Msk      ( 0xFFUL << SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

