FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: SPIM_PUBLISH_END */
/* Description: Publish configuration for event END */

/* Bit 31 :   */
#define SPIM_PUBLISH_END_EN_Pos         ( 31UL )                             /*!< Position of EN field. */
#define SPIM_PUBLISH_END_EN_Msk         ( 0x1UL << SPIM_PUBLISH_END_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_PUBLISH_END_EN_Disabled    ( 0UL )                              /*!< Disable publishing */
#define SPIM_PUBLISH_END_EN_Enabled     ( 1UL )                              /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event END will publish to. */
#define SPIM_PUBLISH_END_CHIDX_Pos      ( 0UL )                                  /*!< Position of CHIDX field. */
#define SPIM_PUBLISH_END_CHIDX_Msk      ( 0xFFUL << SPIM_PUBLISH_END_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_PUBLISH_ENDTX */
/* Description: Publish configuration for event ENDTX */

/* Bit 31 :   */
#define SPIM_PUBLISH_ENDTX_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define SPIM_PUBLISH_ENDTX_EN_Msk         ( 0x1UL << SPIM_PUBLISH_ENDTX_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_PUBLISH_ENDTX_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define SPIM_PUBLISH_ENDTX_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDTX will publish to. */
#define SPIM_PUBLISH_ENDTX_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define SPIM_PUBLISH_ENDTX_CHIDX_Msk      ( 0xFFUL << SPIM_PUBLISH_ENDTX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_PUBLISH_STARTED */
/* Description: Publish configuration for event STARTED */

/* Bit 31 :   */
#define SPIM_PUBLISH_STARTED_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define SPIM_PUBLISH_STARTED_EN_Msk         ( 0x1UL << SPIM_PUBLISH_STARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_PUBLISH_STARTED_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define SPIM_PUBLISH_STARTED_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STARTED will publish to. */
#define SPIM_PUBLISH_STARTED_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define SPIM_PUBLISH_STARTED_CHIDX_Msk      ( 0xFFUL << SPIM_PUBLISH_STARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 17 : Shortcut between event END and task START */
#define SPIM_SHORTS_END_START_Pos         ( 17UL )                               /*!< Position of END_START field. */
#define SPIM_SHORTS_END_START_Msk         ( 0x1UL << SPIM_SHORTS_END_START_Pos ) /*!< Bit mask of END_START field. */
#define SPIM_SHORTS_END_START_Disabled    ( 0UL )                                /*!< Disable shortcut */
#define SPIM_SHORTS_END_START_Enabled     ( 1UL )                                /*!< Enable shortcut */

/* Register: SPIM_INTENSET */
/* Description: Enable interrupt */

/* Bit 19 : Write '1' to enable interrupt for event STARTED */
#define SPIM_INTENSET_STARTED_Pos         ( 19UL )                               /*!< Position of STARTED field. */
#define SPIM_INTENSET_STARTED_Msk         ( 0x1UL << SPIM_INTENSET_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define SPIM_INTENSET_STARTED_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define SPIM_INTENSET_STARTED_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define SPIM_INTENSET_STARTED_Set         ( 1UL )                                /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event ENDTX */
#define SPIM_INTENSET_ENDTX_Pos           ( 8UL )                              /*!< Position of ENDTX field. */
#define SPIM_INTENSET_ENDTX_Msk           ( 0x1UL << SPIM_INTENSET_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define SPIM_INTENSET_ENDTX_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define SPIM_INTENSET_ENDTX_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define SPIM_INTENSET_ENDTX_Set           ( 1UL )                              /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event END */
#define SPIM_INTENSET_END_Pos             ( 6UL )                            /*!< Position of END field. */
#define SPIM_INTENSET_END_Msk             ( 0x1UL << SPIM_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define SPIM_INTENSET_END_Disabled        ( 0UL )                            /*!< Read: Disabled */
#define SPIM_INTENSET_END_Enabled         ( 1UL )                            /*!< Read: Enabled */
#define SPIM_INTENSET_END_Set             ( 1UL )                            /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event ENDRX */
#define SPIM_INTENSET_ENDRX_Pos           ( 4UL )                              /*!< Position of ENDRX field. */
#define SPIM_INTENSET_ENDRX_Msk           ( 0x1UL << SPIM_INTENSET_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define SPIM_INTENSET_ENDRX_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define SPIM_INTENSET_ENDRX_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define SPIM_INTENSET_ENDRX_Set           ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define SPIM_INTENSET_STOPPED_Pos         ( 1UL )                                /*!< Position of STOPPED field. */
#define SPIM_INTENSET_STOPPED_Msk         ( 0x1UL << SPIM_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define SPIM_INTENSET_STOPPED_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define SPIM_INTENSET_STOPPED_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define SPIM_INTENSET_STOPPED_Set         ( 1UL )                                /*!< Enable */

/* Register: SPIM_INTENCLR */
/* Description: Disable interrupt */

/* Bit 19 : Write '1' to disable interrupt for event STARTED */
#define SPIM_INTENCLR_STARTED_Pos         ( 19UL )                               /*!< Position of STARTED field. */
#define SPIM_INTENCLR_STARTED_Msk         ( 0x1UL << SPIM_INTENCLR_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define SPIM_INTENCLR_STARTED_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define SPIM_INTENCLR_STARTED_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define SPIM_INTENCLR_STARTED_Clear       ( 1UL )                                /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event ENDTX */
#define SPIM_INTENCLR_ENDTX_Pos           ( 8UL )                              /*!< Position of ENDTX field. */
#define SPIM_INTENCLR_ENDTX_Msk           ( 0x1UL << SPIM_INTENCLR_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define SPIM_INTENCLR_ENDTX_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define SPIM_INTENCLR_ENDTX_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define SPIM_INTENCLR_ENDTX_Clear         ( 1UL )                              /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event END */
#define SPIM_INTENCLR_END_Pos             ( 6UL )                            /*!< Position of END field. */
#define SPIM_INTENCLR_END_Msk             ( 0x1UL << SPIM_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define SPIM_INTENCLR_END_Disabled        ( 0UL )                            /*!< Read: Disabled */
#define SPIM_INTENCLR_END_Enabled         ( 1UL )                            /*!< Read: Enabled */
#define SPIM_INTENCLR_END_Clear           ( 1UL )                            /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event ENDRX */
#define SPIM_INTENCLR_ENDRX_Pos           ( 4UL )                              /*!< Position of ENDRX field. */
#define SPIM_INTENCLR_ENDRX_Msk           ( 0x1UL << SPIM_INTENCLR_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define SPIM_INTENCLR_ENDRX_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define SPIM_INTENCLR_ENDRX_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define SPIM_INTENCLR_ENDRX_Clear         ( 1UL )                              /*!< Disable */

