FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define SPIM_INTENCLR_STOPPED_Pos         ( 1UL )                                /*!< Position of STOPPED field. */
#define SPIM_INTENCLR_STOPPED_Msk         ( 0x1UL << SPIM_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define SPIM_INTENCLR_STOPPED_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define SPIM_INTENCLR_STOPPED_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define SPIM_INTENCLR_STOPPED_Clear       ( 1UL )                                /*!< Disable */

/* Register: SPIM_STALLSTAT */
/* Description: Stall status for EasyDMA RAM accesses. The fields in this register are set to STALL by hardware whenever a stall occurres and can be cleared (set to NOSTALL) by the CPU. */

/* Bit 1 : Stall status for EasyDMA RAM writes */
#define SPIM_STALLSTAT_RX_Pos        ( 1UL )                            /*!< Position of RX field. */
#define SPIM_STALLSTAT_RX_Msk        ( 0x1UL << SPIM_STALLSTAT_RX_Pos ) /*!< Bit mask of RX field. */
#define SPIM_STALLSTAT_RX_NOSTALL    ( 0UL )                            /*!< No stall */
#define SPIM_STALLSTAT_RX_STALL      ( 1UL )                            /*!< A stall has occurred */

/* Bit 0 : Stall status for EasyDMA RAM reads */
#define SPIM_STALLSTAT_TX_Pos        ( 0UL )                            /*!< Position of TX field. */
#define SPIM_STALLSTAT_TX_Msk        ( 0x1UL << SPIM_STALLSTAT_TX_Pos ) /*!< Bit mask of TX field. */
#define SPIM_STALLSTAT_TX_NOSTALL    ( 0UL )                            /*!< No stall */
#define SPIM_STALLSTAT_TX_STALL      ( 1UL )                            /*!< A stall has occurred */

/* Register: SPIM_ENABLE */
/* Description: Enable SPIM */

/* Bits 3..0 : Enable or disable SPIM */
#define SPIM_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define SPIM_ENABLE_ENABLE_Msk         ( 0xFUL << SPIM_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define SPIM_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable SPIM */
#define SPIM_ENABLE_ENABLE_Enabled     ( 7UL )                             /*!< Enable SPIM */

/* Register: SPIM_PSEL_SCK */
/* Description: Pin select for SCK */

/* Bit 31 : Connection */
#define SPIM_PSEL_SCK_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPIM_PSEL_SCK_CONNECT_Msk             ( 0x1UL << SPIM_PSEL_SCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIM_PSEL_SCK_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPIM_PSEL_SCK_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define SPIM_PSEL_SCK_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define SPIM_PSEL_SCK_PORT_Msk                ( 0x1UL << SPIM_PSEL_SCK_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define SPIM_PSEL_SCK_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPIM_PSEL_SCK_PIN_Msk                 ( 0x1FUL << SPIM_PSEL_SCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIM_PSEL_MOSI */
/* Description: Pin select for MOSI signal */

/* Bit 31 : Connection */
#define SPIM_PSEL_MOSI_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIM_PSEL_MOSI_CONNECT_Msk             ( 0x1UL << SPIM_PSEL_MOSI_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIM_PSEL_MOSI_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIM_PSEL_MOSI_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bit 5 : Port number */
#define SPIM_PSEL_MOSI_PORT_Pos                ( 5UL )                              /*!< Position of PORT field. */
#define SPIM_PSEL_MOSI_PORT_Msk                ( 0x1UL << SPIM_PSEL_MOSI_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define SPIM_PSEL_MOSI_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIM_PSEL_MOSI_PIN_Msk                 ( 0x1FUL << SPIM_PSEL_MOSI_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIM_PSEL_MISO */
/* Description: Pin select for MISO signal */

/* Bit 31 : Connection */
#define SPIM_PSEL_MISO_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIM_PSEL_MISO_CONNECT_Msk             ( 0x1UL << SPIM_PSEL_MISO_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIM_PSEL_MISO_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIM_PSEL_MISO_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bit 5 : Port number */
#define SPIM_PSEL_MISO_PORT_Pos                ( 5UL )                              /*!< Position of PORT field. */
#define SPIM_PSEL_MISO_PORT_Msk                ( 0x1UL << SPIM_PSEL_MISO_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define SPIM_PSEL_MISO_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIM_PSEL_MISO_PIN_Msk                 ( 0x1FUL << SPIM_PSEL_MISO_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIM_PSEL_CSN */
/* Description: Pin select for CSN */

/* Bit 31 : Connection */
#define SPIM_PSEL_CSN_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPIM_PSEL_CSN_CONNECT_Msk             ( 0x1UL << SPIM_PSEL_CSN_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIM_PSEL_CSN_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPIM_PSEL_CSN_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bit 5 : Port number */
#define SPIM_PSEL_CSN_PORT_Pos                ( 5UL )                             /*!< Position of PORT field. */
#define SPIM_PSEL_CSN_PORT_Msk                ( 0x1UL << SPIM_PSEL_CSN_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define SPIM_PSEL_CSN_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPIM_PSEL_CSN_PIN_Msk                 ( 0x1FUL << SPIM_PSEL_CSN_PIN_Pos ) /*!< Bit mask of PIN field. */

