FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: SPIM_ORC */
/* Description: Byte transmitted after TXD.MAXCNT bytes have been transmitted in the case when RXD.MAXCNT is greater than TXD.MAXCNT */

/* Bits 7..0 : Byte transmitted after TXD.MAXCNT bytes have been transmitted in the case when RXD.MAXCNT is greater than TXD.MAXCNT. */
#define SPIM_ORC_ORC_Pos    ( 0UL )                        /*!< Position of ORC field. */
#define SPIM_ORC_ORC_Msk    ( 0xFFUL << SPIM_ORC_ORC_Pos ) /*!< Bit mask of ORC field. */


/* Peripheral: SPIS */
/* Description: SPI Slave 0 */

/* Register: SPIS_TASKS_ACQUIRE */
/* Description: Acquire SPI semaphore */

/* Bit 0 : Acquire SPI semaphore */
#define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos        ( 0UL )                                           /*!< Position of TASKS_ACQUIRE field. */
#define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Msk        ( 0x1UL << SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos ) /*!< Bit mask of TASKS_ACQUIRE field. */
#define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: SPIS_TASKS_RELEASE */
/* Description: Release SPI semaphore, enabling the SPI slave to acquire it */

/* Bit 0 : Release SPI semaphore, enabling the SPI slave to acquire it */
#define SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos        ( 0UL )                                           /*!< Position of TASKS_RELEASE field. */
#define SPIS_TASKS_RELEASE_TASKS_RELEASE_Msk        ( 0x1UL << SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos ) /*!< Bit mask of TASKS_RELEASE field. */
#define SPIS_TASKS_RELEASE_TASKS_RELEASE_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: SPIS_SUBSCRIBE_ACQUIRE */
/* Description: Subscribe configuration for task ACQUIRE */

/* Bit 31 :   */
#define SPIS_SUBSCRIBE_ACQUIRE_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define SPIS_SUBSCRIBE_ACQUIRE_EN_Msk         ( 0x1UL << SPIS_SUBSCRIBE_ACQUIRE_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIS_SUBSCRIBE_ACQUIRE_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define SPIS_SUBSCRIBE_ACQUIRE_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task ACQUIRE will subscribe to */
#define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Msk      ( 0xFFUL << SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIS_SUBSCRIBE_RELEASE */
/* Description: Subscribe configuration for task RELEASE */

/* Bit 31 :   */
#define SPIS_SUBSCRIBE_RELEASE_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define SPIS_SUBSCRIBE_RELEASE_EN_Msk         ( 0x1UL << SPIS_SUBSCRIBE_RELEASE_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIS_SUBSCRIBE_RELEASE_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define SPIS_SUBSCRIBE_RELEASE_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RELEASE will subscribe to */
#define SPIS_SUBSCRIBE_RELEASE_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define SPIS_SUBSCRIBE_RELEASE_CHIDX_Msk      ( 0xFFUL << SPIS_SUBSCRIBE_RELEASE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIS_EVENTS_END */
/* Description: Granted transaction completed */

/* Bit 0 : Granted transaction completed */
#define SPIS_EVENTS_END_EVENTS_END_Pos             ( 0UL )                                     /*!< Position of EVENTS_END field. */
#define SPIS_EVENTS_END_EVENTS_END_Msk             ( 0x1UL << SPIS_EVENTS_END_EVENTS_END_Pos ) /*!< Bit mask of EVENTS_END field. */
#define SPIS_EVENTS_END_EVENTS_END_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define SPIS_EVENTS_END_EVENTS_END_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: SPIS_EVENTS_ENDRX */
/* Description: End of RXD buffer reached */

/* Bit 0 : End of RXD buffer reached */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Pos             ( 0UL )                                         /*!< Position of EVENTS_ENDRX field. */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Msk             ( 0x1UL << SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Pos ) /*!< Bit mask of EVENTS_ENDRX field. */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: SPIS_EVENTS_ACQUIRED */
/* Description: Semaphore acquired */

/* Bit 0 : Semaphore acquired */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos             ( 0UL )                                               /*!< Position of EVENTS_ACQUIRED field. */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Msk             ( 0x1UL << SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos ) /*!< Bit mask of EVENTS_ACQUIRED field. */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_NotGenerated    ( 0UL )                                               /*!< Event not generated */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Generated       ( 1UL )                                               /*!< Event generated */

/* Register: SPIS_PUBLISH_END */
/* Description: Publish configuration for event END */

/* Bit 31 :   */
#define SPIS_PUBLISH_END_EN_Pos         ( 31UL )                             /*!< Position of EN field. */
#define SPIS_PUBLISH_END_EN_Msk         ( 0x1UL << SPIS_PUBLISH_END_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIS_PUBLISH_END_EN_Disabled    ( 0UL )                              /*!< Disable publishing */
#define SPIS_PUBLISH_END_EN_Enabled     ( 1UL )                              /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event END will publish to. */
#define SPIS_PUBLISH_END_CHIDX_Pos      ( 0UL )                                  /*!< Position of CHIDX field. */
#define SPIS_PUBLISH_END_CHIDX_Msk      ( 0xFFUL << SPIS_PUBLISH_END_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIS_PUBLISH_ENDRX */
/* Description: Publish configuration for event ENDRX */

/* Bit 31 :   */
#define SPIS_PUBLISH_ENDRX_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define SPIS_PUBLISH_ENDRX_EN_Msk         ( 0x1UL << SPIS_PUBLISH_ENDRX_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIS_PUBLISH_ENDRX_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define SPIS_PUBLISH_ENDRX_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDRX will publish to. */
#define SPIS_PUBLISH_ENDRX_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define SPIS_PUBLISH_ENDRX_CHIDX_Msk      ( 0xFFUL << SPIS_PUBLISH_ENDRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

