FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: SPIS_PUBLISH_ACQUIRED */
/* Description: Publish configuration for event ACQUIRED */

/* Bit 31 :   */
#define SPIS_PUBLISH_ACQUIRED_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define SPIS_PUBLISH_ACQUIRED_EN_Msk         ( 0x1UL << SPIS_PUBLISH_ACQUIRED_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIS_PUBLISH_ACQUIRED_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define SPIS_PUBLISH_ACQUIRED_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ACQUIRED will publish to. */
#define SPIS_PUBLISH_ACQUIRED_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define SPIS_PUBLISH_ACQUIRED_CHIDX_Msk      ( 0xFFUL << SPIS_PUBLISH_ACQUIRED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIS_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 2 : Shortcut between event END and task ACQUIRE */
#define SPIS_SHORTS_END_ACQUIRE_Pos         ( 2UL )                                  /*!< Position of END_ACQUIRE field. */
#define SPIS_SHORTS_END_ACQUIRE_Msk         ( 0x1UL << SPIS_SHORTS_END_ACQUIRE_Pos ) /*!< Bit mask of END_ACQUIRE field. */
#define SPIS_SHORTS_END_ACQUIRE_Disabled    ( 0UL )                                  /*!< Disable shortcut */
#define SPIS_SHORTS_END_ACQUIRE_Enabled     ( 1UL )                                  /*!< Enable shortcut */

/* Register: SPIS_INTENSET */
/* Description: Enable interrupt */

/* Bit 10 : Write '1' to enable interrupt for event ACQUIRED */
#define SPIS_INTENSET_ACQUIRED_Pos         ( 10UL )                                /*!< Position of ACQUIRED field. */
#define SPIS_INTENSET_ACQUIRED_Msk         ( 0x1UL << SPIS_INTENSET_ACQUIRED_Pos ) /*!< Bit mask of ACQUIRED field. */
#define SPIS_INTENSET_ACQUIRED_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define SPIS_INTENSET_ACQUIRED_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define SPIS_INTENSET_ACQUIRED_Set         ( 1UL )                                 /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event ENDRX */
#define SPIS_INTENSET_ENDRX_Pos            ( 4UL )                              /*!< Position of ENDRX field. */
#define SPIS_INTENSET_ENDRX_Msk            ( 0x1UL << SPIS_INTENSET_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define SPIS_INTENSET_ENDRX_Disabled       ( 0UL )                              /*!< Read: Disabled */
#define SPIS_INTENSET_ENDRX_Enabled        ( 1UL )                              /*!< Read: Enabled */
#define SPIS_INTENSET_ENDRX_Set            ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event END */
#define SPIS_INTENSET_END_Pos              ( 1UL )                            /*!< Position of END field. */
#define SPIS_INTENSET_END_Msk              ( 0x1UL << SPIS_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define SPIS_INTENSET_END_Disabled         ( 0UL )                            /*!< Read: Disabled */
#define SPIS_INTENSET_END_Enabled          ( 1UL )                            /*!< Read: Enabled */
#define SPIS_INTENSET_END_Set              ( 1UL )                            /*!< Enable */

/* Register: SPIS_INTENCLR */
/* Description: Disable interrupt */

/* Bit 10 : Write '1' to disable interrupt for event ACQUIRED */
#define SPIS_INTENCLR_ACQUIRED_Pos         ( 10UL )                                /*!< Position of ACQUIRED field. */
#define SPIS_INTENCLR_ACQUIRED_Msk         ( 0x1UL << SPIS_INTENCLR_ACQUIRED_Pos ) /*!< Bit mask of ACQUIRED field. */
#define SPIS_INTENCLR_ACQUIRED_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define SPIS_INTENCLR_ACQUIRED_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define SPIS_INTENCLR_ACQUIRED_Clear       ( 1UL )                                 /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event ENDRX */
#define SPIS_INTENCLR_ENDRX_Pos            ( 4UL )                              /*!< Position of ENDRX field. */
#define SPIS_INTENCLR_ENDRX_Msk            ( 0x1UL << SPIS_INTENCLR_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define SPIS_INTENCLR_ENDRX_Disabled       ( 0UL )                              /*!< Read: Disabled */
#define SPIS_INTENCLR_ENDRX_Enabled        ( 1UL )                              /*!< Read: Enabled */
#define SPIS_INTENCLR_ENDRX_Clear          ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event END */
#define SPIS_INTENCLR_END_Pos              ( 1UL )                            /*!< Position of END field. */
#define SPIS_INTENCLR_END_Msk              ( 0x1UL << SPIS_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define SPIS_INTENCLR_END_Disabled         ( 0UL )                            /*!< Read: Disabled */
#define SPIS_INTENCLR_END_Enabled          ( 1UL )                            /*!< Read: Enabled */
#define SPIS_INTENCLR_END_Clear            ( 1UL )                            /*!< Disable */

/* Register: SPIS_SEMSTAT */
/* Description: Semaphore status register */

/* Bits 1..0 : Semaphore status */
#define SPIS_SEMSTAT_SEMSTAT_Pos           ( 0UL )                               /*!< Position of SEMSTAT field. */
#define SPIS_SEMSTAT_SEMSTAT_Msk           ( 0x3UL << SPIS_SEMSTAT_SEMSTAT_Pos ) /*!< Bit mask of SEMSTAT field. */
#define SPIS_SEMSTAT_SEMSTAT_Free          ( 0UL )                               /*!< Semaphore is free */
#define SPIS_SEMSTAT_SEMSTAT_CPU           ( 1UL )                               /*!< Semaphore is assigned to CPU */
#define SPIS_SEMSTAT_SEMSTAT_SPIS          ( 2UL )                               /*!< Semaphore is assigned to SPI slave */
#define SPIS_SEMSTAT_SEMSTAT_CPUPending    ( 3UL )                               /*!< Semaphore is assigned to SPI but a handover to the CPU is pending */

/* Register: SPIS_STATUS */
/* Description: Status from last transaction */

