FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 7..0 : DPPI channel that event RAMACCERR will publish to. */
#define SPU_PUBLISH_RAMACCERR_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define SPU_PUBLISH_RAMACCERR_CHIDX_Msk      ( 0xFFUL << SPU_PUBLISH_RAMACCERR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPU_PUBLISH_FLASHACCERR */
/* Description: Publish configuration for event FLASHACCERR */

/* Bit 31 :   */
#define SPU_PUBLISH_FLASHACCERR_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define SPU_PUBLISH_FLASHACCERR_EN_Msk         ( 0x1UL << SPU_PUBLISH_FLASHACCERR_EN_Pos ) /*!< Bit mask of EN field. */
#define SPU_PUBLISH_FLASHACCERR_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define SPU_PUBLISH_FLASHACCERR_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event FLASHACCERR will publish to. */
#define SPU_PUBLISH_FLASHACCERR_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define SPU_PUBLISH_FLASHACCERR_CHIDX_Msk      ( 0xFFUL << SPU_PUBLISH_FLASHACCERR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPU_PUBLISH_PERIPHACCERR */
/* Description: Publish configuration for event PERIPHACCERR */

/* Bit 31 :   */
#define SPU_PUBLISH_PERIPHACCERR_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define SPU_PUBLISH_PERIPHACCERR_EN_Msk         ( 0x1UL << SPU_PUBLISH_PERIPHACCERR_EN_Pos ) /*!< Bit mask of EN field. */
#define SPU_PUBLISH_PERIPHACCERR_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define SPU_PUBLISH_PERIPHACCERR_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event PERIPHACCERR will publish to. */
#define SPU_PUBLISH_PERIPHACCERR_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define SPU_PUBLISH_PERIPHACCERR_CHIDX_Msk      ( 0xFFUL << SPU_PUBLISH_PERIPHACCERR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPU_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 2 : Enable or disable interrupt for event PERIPHACCERR */
#define SPU_INTEN_PERIPHACCERR_Pos         ( 2UL )                                 /*!< Position of PERIPHACCERR field. */
#define SPU_INTEN_PERIPHACCERR_Msk         ( 0x1UL << SPU_INTEN_PERIPHACCERR_Pos ) /*!< Bit mask of PERIPHACCERR field. */
#define SPU_INTEN_PERIPHACCERR_Disabled    ( 0UL )                                 /*!< Disable */
#define SPU_INTEN_PERIPHACCERR_Enabled     ( 1UL )                                 /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event FLASHACCERR */
#define SPU_INTEN_FLASHACCERR_Pos          ( 1UL )                                /*!< Position of FLASHACCERR field. */
#define SPU_INTEN_FLASHACCERR_Msk          ( 0x1UL << SPU_INTEN_FLASHACCERR_Pos ) /*!< Bit mask of FLASHACCERR field. */
#define SPU_INTEN_FLASHACCERR_Disabled     ( 0UL )                                /*!< Disable */
#define SPU_INTEN_FLASHACCERR_Enabled      ( 1UL )                                /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event RAMACCERR */
#define SPU_INTEN_RAMACCERR_Pos            ( 0UL )                              /*!< Position of RAMACCERR field. */
#define SPU_INTEN_RAMACCERR_Msk            ( 0x1UL << SPU_INTEN_RAMACCERR_Pos ) /*!< Bit mask of RAMACCERR field. */
#define SPU_INTEN_RAMACCERR_Disabled       ( 0UL )                              /*!< Disable */
#define SPU_INTEN_RAMACCERR_Enabled        ( 1UL )                              /*!< Enable */

/* Register: SPU_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event PERIPHACCERR */
#define SPU_INTENSET_PERIPHACCERR_Pos         ( 2UL )                                    /*!< Position of PERIPHACCERR field. */
#define SPU_INTENSET_PERIPHACCERR_Msk         ( 0x1UL << SPU_INTENSET_PERIPHACCERR_Pos ) /*!< Bit mask of PERIPHACCERR field. */
#define SPU_INTENSET_PERIPHACCERR_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define SPU_INTENSET_PERIPHACCERR_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define SPU_INTENSET_PERIPHACCERR_Set         ( 1UL )                                    /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event FLASHACCERR */
#define SPU_INTENSET_FLASHACCERR_Pos          ( 1UL )                                   /*!< Position of FLASHACCERR field. */
#define SPU_INTENSET_FLASHACCERR_Msk          ( 0x1UL << SPU_INTENSET_FLASHACCERR_Pos ) /*!< Bit mask of FLASHACCERR field. */
#define SPU_INTENSET_FLASHACCERR_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define SPU_INTENSET_FLASHACCERR_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define SPU_INTENSET_FLASHACCERR_Set          ( 1UL )                                   /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event RAMACCERR */
#define SPU_INTENSET_RAMACCERR_Pos            ( 0UL )                                 /*!< Position of RAMACCERR field. */
#define SPU_INTENSET_RAMACCERR_Msk            ( 0x1UL << SPU_INTENSET_RAMACCERR_Pos ) /*!< Bit mask of RAMACCERR field. */
#define SPU_INTENSET_RAMACCERR_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define SPU_INTENSET_RAMACCERR_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define SPU_INTENSET_RAMACCERR_Set            ( 1UL )                                 /*!< Enable */

/* Register: SPU_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event PERIPHACCERR */
#define SPU_INTENCLR_PERIPHACCERR_Pos         ( 2UL )                                    /*!< Position of PERIPHACCERR field. */
#define SPU_INTENCLR_PERIPHACCERR_Msk         ( 0x1UL << SPU_INTENCLR_PERIPHACCERR_Pos ) /*!< Bit mask of PERIPHACCERR field. */
#define SPU_INTENCLR_PERIPHACCERR_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define SPU_INTENCLR_PERIPHACCERR_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define SPU_INTENCLR_PERIPHACCERR_Clear       ( 1UL )                                    /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event FLASHACCERR */
#define SPU_INTENCLR_FLASHACCERR_Pos          ( 1UL )                                   /*!< Position of FLASHACCERR field. */
#define SPU_INTENCLR_FLASHACCERR_Msk          ( 0x1UL << SPU_INTENCLR_FLASHACCERR_Pos ) /*!< Bit mask of FLASHACCERR field. */
#define SPU_INTENCLR_FLASHACCERR_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define SPU_INTENCLR_FLASHACCERR_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define SPU_INTENCLR_FLASHACCERR_Clear        ( 1UL )                                   /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event RAMACCERR */
#define SPU_INTENCLR_RAMACCERR_Pos            ( 0UL )                                 /*!< Position of RAMACCERR field. */
#define SPU_INTENCLR_RAMACCERR_Msk            ( 0x1UL << SPU_INTENCLR_RAMACCERR_Pos ) /*!< Bit mask of RAMACCERR field. */
#define SPU_INTENCLR_RAMACCERR_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define SPU_INTENCLR_RAMACCERR_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define SPU_INTENCLR_RAMACCERR_Clear          ( 1UL )                                 /*!< Disable */

/* Register: SPU_CAP */
/* Description: Show implemented features for the current device */

