FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 0 : Show Arm TrustZone status */
#define SPU_CAP_TZM_Pos             ( 0UL )                      /*!< Position of TZM field. */
#define SPU_CAP_TZM_Msk             ( 0x1UL << SPU_CAP_TZM_Pos ) /*!< Bit mask of TZM field. */
#define SPU_CAP_TZM_NotAvailable    ( 0UL )                      /*!< Arm TrustZone support not available */
#define SPU_CAP_TZM_Enabled         ( 1UL )                      /*!< Arm TrustZone support is available */

/* Register: SPU_CPULOCK */
/* Description: Configure bits to lock down CPU features at runtime */

/* Bit 4 : Write '1' to prevent updating the secure SAU regions until the next reset */
#define SPU_CPULOCK_LOCKSAU_Pos              ( 4UL )                              /*!< Position of LOCKSAU field. */
#define SPU_CPULOCK_LOCKSAU_Msk              ( 0x1UL << SPU_CPULOCK_LOCKSAU_Pos ) /*!< Bit mask of LOCKSAU field. */
#define SPU_CPULOCK_LOCKSAU_Unlocked         ( 0UL )                              /*!< These registers can be updated */
#define SPU_CPULOCK_LOCKSAU_Locked           ( 1UL )                              /*!< Disables writes to the SAU_CTRL, SAU_RNR, SAU_RBAR and SAU_RLAR registers from software or from a debug agent connected to the processor */

/* Bit 3 : Write '1' to prevent updating the Non-secure MPU regions until the next reset */
#define SPU_CPULOCK_LOCKNSMPU_Pos            ( 3UL )                                /*!< Position of LOCKNSMPU field. */
#define SPU_CPULOCK_LOCKNSMPU_Msk            ( 0x1UL << SPU_CPULOCK_LOCKNSMPU_Pos ) /*!< Bit mask of LOCKNSMPU field. */
#define SPU_CPULOCK_LOCKNSMPU_Unlocked       ( 0UL )                                /*!< These registers can be updated */
#define SPU_CPULOCK_LOCKNSMPU_Locked         ( 1UL )                                /*!< Disables writes to the MPU_CTRL_NS, MPU_RNR_NS, MPU_RBAR_NS, MPU_RLAR_NS, MPU_RBAR_A_NSn and MPU_RLAR_A_NSn from software or from a debug agent connected to the processor */

/* Bit 2 : Write '1' to prevent updating the secure MPU regions until the next reset */
#define SPU_CPULOCK_LOCKSMPU_Pos             ( 2UL )                               /*!< Position of LOCKSMPU field. */
#define SPU_CPULOCK_LOCKSMPU_Msk             ( 0x1UL << SPU_CPULOCK_LOCKSMPU_Pos ) /*!< Bit mask of LOCKSMPU field. */
#define SPU_CPULOCK_LOCKSMPU_Unlocked        ( 0UL )                               /*!< These registers can be updated */
#define SPU_CPULOCK_LOCKSMPU_Locked          ( 1UL )                               /*!< Disables writes to the MPU_CTRL, MPU_RNR, MPU_RBAR, MPU_RLAR, MPU_RBAR_An and MPU_RLAR_An from software or from a debug agent connected to the processor in Secure state */

/* Bit 1 : Write '1' to prevent updating the non-secure vector table base address until the next reset */
#define SPU_CPULOCK_LOCKNSVTOR_Pos           ( 1UL )                                 /*!< Position of LOCKNSVTOR field. */
#define SPU_CPULOCK_LOCKNSVTOR_Msk           ( 0x1UL << SPU_CPULOCK_LOCKNSVTOR_Pos ) /*!< Bit mask of LOCKNSVTOR field. */
#define SPU_CPULOCK_LOCKNSVTOR_Unlocked      ( 0UL )                                 /*!< The address of the non-secure vector table can be updated */
#define SPU_CPULOCK_LOCKNSVTOR_Locked        ( 1UL )                                 /*!< The address of the non-secure vector table is locked */

/* Bit 0 : Write '1' to prevent updating the secure interrupt configuration until the next reset */
#define SPU_CPULOCK_LOCKSVTAIRCR_Pos         ( 0UL )                                   /*!< Position of LOCKSVTAIRCR field. */
#define SPU_CPULOCK_LOCKSVTAIRCR_Msk         ( 0x1UL << SPU_CPULOCK_LOCKSVTAIRCR_Pos ) /*!< Bit mask of LOCKSVTAIRCR field. */
#define SPU_CPULOCK_LOCKSVTAIRCR_Unlocked    ( 0UL )                                   /*!< These registers can be updated */
#define SPU_CPULOCK_LOCKSVTAIRCR_Locked      ( 1UL )                                   /*!< Disables writes to the VTOR_S, AIRCR.PRIS, and AIRCR.BFHFNMINS registers */

/* Register: SPU_EXTDOMAIN_PERM */
/* Description: Description cluster: Access  for bus access generated from the external domain n List capabilities of the external domain  n */

/* Bit 8 :   */
#define SPU_EXTDOMAIN_PERM_LOCK_Pos                        ( 8UL )                                  /*!< Position of LOCK field. */
#define SPU_EXTDOMAIN_PERM_LOCK_Msk                        ( 0x1UL << SPU_EXTDOMAIN_PERM_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_EXTDOMAIN_PERM_LOCK_Unlocked                   ( 0UL )                                  /*!< This register can be updated */
#define SPU_EXTDOMAIN_PERM_LOCK_Locked                     ( 1UL )                                  /*!< The content of this register can't be changed until the next reset */

/* Bit 4 : Peripheral security mapping */
#define SPU_EXTDOMAIN_PERM_SECATTR_Pos                     ( 4UL )                                     /*!< Position of SECATTR field. */
#define SPU_EXTDOMAIN_PERM_SECATTR_Msk                     ( 0x1UL << SPU_EXTDOMAIN_PERM_SECATTR_Pos ) /*!< Bit mask of SECATTR field. */
#define SPU_EXTDOMAIN_PERM_SECATTR_NonSecure               ( 0UL )                                     /*!< Bus accesses from this domain have the non-secure attribute set */
#define SPU_EXTDOMAIN_PERM_SECATTR_Secure                  ( 1UL )                                     /*!< Bus accesses from this domain have secure attribute set */

/* Bits 1..0 : Define configuration capabilities for TrustZone Cortex-M secure attribute */
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_Pos               ( 0UL )                                           /*!< Position of SECUREMAPPING field. */
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_Msk               ( 0x3UL << SPU_EXTDOMAIN_PERM_SECUREMAPPING_Pos ) /*!< Bit mask of SECUREMAPPING field. */
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_NonSecure         ( 0UL )                                           /*!< The bus access from this external domain always have the non-secure attribute set */
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_Secure            ( 1UL )                                           /*!< The bus access from this external domain always have the secure attribute set */
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_UserSelectable    ( 2UL )                                           /*!< Non-secure or secure attribute for bus access from this domain is defined by the EXTDOMAIN[n].PERM register */

