FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: SPU_DPPI_PERM */
/* Description: Description cluster: Select between secure and non-secure attribute  for the DPPI channels */

/* Bit 31 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL31_Pos          ( 31UL )                                 /*!< Position of CHANNEL31 field. */
#define SPU_DPPI_PERM_CHANNEL31_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL31_Pos ) /*!< Bit mask of CHANNEL31 field. */
#define SPU_DPPI_PERM_CHANNEL31_NonSecure    ( 0UL )                                  /*!< Channel 31 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL31_Secure       ( 1UL )                                  /*!< Channel 31 has its secure attribute set */

/* Bit 30 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL30_Pos          ( 30UL )                                 /*!< Position of CHANNEL30 field. */
#define SPU_DPPI_PERM_CHANNEL30_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL30_Pos ) /*!< Bit mask of CHANNEL30 field. */
#define SPU_DPPI_PERM_CHANNEL30_NonSecure    ( 0UL )                                  /*!< Channel 30 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL30_Secure       ( 1UL )                                  /*!< Channel 30 has its secure attribute set */

/* Bit 29 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL29_Pos          ( 29UL )                                 /*!< Position of CHANNEL29 field. */
#define SPU_DPPI_PERM_CHANNEL29_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL29_Pos ) /*!< Bit mask of CHANNEL29 field. */
#define SPU_DPPI_PERM_CHANNEL29_NonSecure    ( 0UL )                                  /*!< Channel 29 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL29_Secure       ( 1UL )                                  /*!< Channel 29 has its secure attribute set */

/* Bit 28 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL28_Pos          ( 28UL )                                 /*!< Position of CHANNEL28 field. */
#define SPU_DPPI_PERM_CHANNEL28_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL28_Pos ) /*!< Bit mask of CHANNEL28 field. */
#define SPU_DPPI_PERM_CHANNEL28_NonSecure    ( 0UL )                                  /*!< Channel 28 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL28_Secure       ( 1UL )                                  /*!< Channel 28 has its secure attribute set */

/* Bit 27 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL27_Pos          ( 27UL )                                 /*!< Position of CHANNEL27 field. */
#define SPU_DPPI_PERM_CHANNEL27_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL27_Pos ) /*!< Bit mask of CHANNEL27 field. */
#define SPU_DPPI_PERM_CHANNEL27_NonSecure    ( 0UL )                                  /*!< Channel 27 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL27_Secure       ( 1UL )                                  /*!< Channel 27 has its secure attribute set */

/* Bit 26 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL26_Pos          ( 26UL )                                 /*!< Position of CHANNEL26 field. */
#define SPU_DPPI_PERM_CHANNEL26_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL26_Pos ) /*!< Bit mask of CHANNEL26 field. */
#define SPU_DPPI_PERM_CHANNEL26_NonSecure    ( 0UL )                                  /*!< Channel 26 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL26_Secure       ( 1UL )                                  /*!< Channel 26 has its secure attribute set */

/* Bit 25 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL25_Pos          ( 25UL )                                 /*!< Position of CHANNEL25 field. */
#define SPU_DPPI_PERM_CHANNEL25_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL25_Pos ) /*!< Bit mask of CHANNEL25 field. */
#define SPU_DPPI_PERM_CHANNEL25_NonSecure    ( 0UL )                                  /*!< Channel 25 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL25_Secure       ( 1UL )                                  /*!< Channel 25 has its secure attribute set */

/* Bit 24 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL24_Pos          ( 24UL )                                 /*!< Position of CHANNEL24 field. */
#define SPU_DPPI_PERM_CHANNEL24_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL24_Pos ) /*!< Bit mask of CHANNEL24 field. */
#define SPU_DPPI_PERM_CHANNEL24_NonSecure    ( 0UL )                                  /*!< Channel 24 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL24_Secure       ( 1UL )                                  /*!< Channel 24 has its secure attribute set */

/* Bit 23 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL23_Pos          ( 23UL )                                 /*!< Position of CHANNEL23 field. */
#define SPU_DPPI_PERM_CHANNEL23_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL23_Pos ) /*!< Bit mask of CHANNEL23 field. */
#define SPU_DPPI_PERM_CHANNEL23_NonSecure    ( 0UL )                                  /*!< Channel 23 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL23_Secure       ( 1UL )                                  /*!< Channel 23 has its secure attribute set */

/* Bit 22 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL22_Pos          ( 22UL )                                 /*!< Position of CHANNEL22 field. */
#define SPU_DPPI_PERM_CHANNEL22_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL22_Pos ) /*!< Bit mask of CHANNEL22 field. */
#define SPU_DPPI_PERM_CHANNEL22_NonSecure    ( 0UL )                                  /*!< Channel 22 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL22_Secure       ( 1UL )                                  /*!< Channel 22 has its secure attribute set */

/* Bit 21 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL21_Pos          ( 21UL )                                 /*!< Position of CHANNEL21 field. */
#define SPU_DPPI_PERM_CHANNEL21_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL21_Pos ) /*!< Bit mask of CHANNEL21 field. */
#define SPU_DPPI_PERM_CHANNEL21_NonSecure    ( 0UL )                                  /*!< Channel 21 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL21_Secure       ( 1UL )                                  /*!< Channel 21 has its secure attribute set */

