FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 20 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL20_Pos          ( 20UL )                                 /*!< Position of CHANNEL20 field. */
#define SPU_DPPI_PERM_CHANNEL20_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL20_Pos ) /*!< Bit mask of CHANNEL20 field. */
#define SPU_DPPI_PERM_CHANNEL20_NonSecure    ( 0UL )                                  /*!< Channel 20 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL20_Secure       ( 1UL )                                  /*!< Channel 20 has its secure attribute set */

/* Bit 19 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL19_Pos          ( 19UL )                                 /*!< Position of CHANNEL19 field. */
#define SPU_DPPI_PERM_CHANNEL19_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL19_Pos ) /*!< Bit mask of CHANNEL19 field. */
#define SPU_DPPI_PERM_CHANNEL19_NonSecure    ( 0UL )                                  /*!< Channel 19 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL19_Secure       ( 1UL )                                  /*!< Channel 19 has its secure attribute set */

/* Bit 18 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL18_Pos          ( 18UL )                                 /*!< Position of CHANNEL18 field. */
#define SPU_DPPI_PERM_CHANNEL18_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL18_Pos ) /*!< Bit mask of CHANNEL18 field. */
#define SPU_DPPI_PERM_CHANNEL18_NonSecure    ( 0UL )                                  /*!< Channel 18 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL18_Secure       ( 1UL )                                  /*!< Channel 18 has its secure attribute set */

/* Bit 17 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL17_Pos          ( 17UL )                                 /*!< Position of CHANNEL17 field. */
#define SPU_DPPI_PERM_CHANNEL17_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL17_Pos ) /*!< Bit mask of CHANNEL17 field. */
#define SPU_DPPI_PERM_CHANNEL17_NonSecure    ( 0UL )                                  /*!< Channel 17 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL17_Secure       ( 1UL )                                  /*!< Channel 17 has its secure attribute set */

/* Bit 16 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL16_Pos          ( 16UL )                                 /*!< Position of CHANNEL16 field. */
#define SPU_DPPI_PERM_CHANNEL16_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL16_Pos ) /*!< Bit mask of CHANNEL16 field. */
#define SPU_DPPI_PERM_CHANNEL16_NonSecure    ( 0UL )                                  /*!< Channel 16 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL16_Secure       ( 1UL )                                  /*!< Channel 16 has its secure attribute set */

/* Bit 15 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL15_Pos          ( 15UL )                                 /*!< Position of CHANNEL15 field. */
#define SPU_DPPI_PERM_CHANNEL15_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL15_Pos ) /*!< Bit mask of CHANNEL15 field. */
#define SPU_DPPI_PERM_CHANNEL15_NonSecure    ( 0UL )                                  /*!< Channel 15 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL15_Secure       ( 1UL )                                  /*!< Channel 15 has its secure attribute set */

/* Bit 14 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL14_Pos          ( 14UL )                                 /*!< Position of CHANNEL14 field. */
#define SPU_DPPI_PERM_CHANNEL14_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL14_Pos ) /*!< Bit mask of CHANNEL14 field. */
#define SPU_DPPI_PERM_CHANNEL14_NonSecure    ( 0UL )                                  /*!< Channel 14 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL14_Secure       ( 1UL )                                  /*!< Channel 14 has its secure attribute set */

/* Bit 13 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL13_Pos          ( 13UL )                                 /*!< Position of CHANNEL13 field. */
#define SPU_DPPI_PERM_CHANNEL13_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL13_Pos ) /*!< Bit mask of CHANNEL13 field. */
#define SPU_DPPI_PERM_CHANNEL13_NonSecure    ( 0UL )                                  /*!< Channel 13 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL13_Secure       ( 1UL )                                  /*!< Channel 13 has its secure attribute set */

/* Bit 12 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL12_Pos          ( 12UL )                                 /*!< Position of CHANNEL12 field. */
#define SPU_DPPI_PERM_CHANNEL12_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL12_Pos ) /*!< Bit mask of CHANNEL12 field. */
#define SPU_DPPI_PERM_CHANNEL12_NonSecure    ( 0UL )                                  /*!< Channel 12 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL12_Secure       ( 1UL )                                  /*!< Channel 12 has its secure attribute set */

/* Bit 11 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL11_Pos          ( 11UL )                                 /*!< Position of CHANNEL11 field. */
#define SPU_DPPI_PERM_CHANNEL11_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL11_Pos ) /*!< Bit mask of CHANNEL11 field. */
#define SPU_DPPI_PERM_CHANNEL11_NonSecure    ( 0UL )                                  /*!< Channel 11 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL11_Secure       ( 1UL )                                  /*!< Channel 11 has its secure attribute set */

/* Bit 10 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL10_Pos          ( 10UL )                                 /*!< Position of CHANNEL10 field. */
#define SPU_DPPI_PERM_CHANNEL10_Msk          ( 0x1UL << SPU_DPPI_PERM_CHANNEL10_Pos ) /*!< Bit mask of CHANNEL10 field. */
#define SPU_DPPI_PERM_CHANNEL10_NonSecure    ( 0UL )                                  /*!< Channel 10 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL10_Secure       ( 1UL )                                  /*!< Channel 10 has its secure attribute set */

