FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 9 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL9_Pos           ( 9UL )                                 /*!< Position of CHANNEL9 field. */
#define SPU_DPPI_PERM_CHANNEL9_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL9_Pos ) /*!< Bit mask of CHANNEL9 field. */
#define SPU_DPPI_PERM_CHANNEL9_NonSecure     ( 0UL )                                 /*!< Channel 9 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL9_Secure        ( 1UL )                                 /*!< Channel 9 has its secure attribute set */

/* Bit 8 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL8_Pos           ( 8UL )                                 /*!< Position of CHANNEL8 field. */
#define SPU_DPPI_PERM_CHANNEL8_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL8_Pos ) /*!< Bit mask of CHANNEL8 field. */
#define SPU_DPPI_PERM_CHANNEL8_NonSecure     ( 0UL )                                 /*!< Channel 8 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL8_Secure        ( 1UL )                                 /*!< Channel 8 has its secure attribute set */

/* Bit 7 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL7_Pos           ( 7UL )                                 /*!< Position of CHANNEL7 field. */
#define SPU_DPPI_PERM_CHANNEL7_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL7_Pos ) /*!< Bit mask of CHANNEL7 field. */
#define SPU_DPPI_PERM_CHANNEL7_NonSecure     ( 0UL )                                 /*!< Channel 7 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL7_Secure        ( 1UL )                                 /*!< Channel 7 has its secure attribute set */

/* Bit 6 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL6_Pos           ( 6UL )                                 /*!< Position of CHANNEL6 field. */
#define SPU_DPPI_PERM_CHANNEL6_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL6_Pos ) /*!< Bit mask of CHANNEL6 field. */
#define SPU_DPPI_PERM_CHANNEL6_NonSecure     ( 0UL )                                 /*!< Channel 6 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL6_Secure        ( 1UL )                                 /*!< Channel 6 has its secure attribute set */

/* Bit 5 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL5_Pos           ( 5UL )                                 /*!< Position of CHANNEL5 field. */
#define SPU_DPPI_PERM_CHANNEL5_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL5_Pos ) /*!< Bit mask of CHANNEL5 field. */
#define SPU_DPPI_PERM_CHANNEL5_NonSecure     ( 0UL )                                 /*!< Channel 5 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL5_Secure        ( 1UL )                                 /*!< Channel 5 has its secure attribute set */

/* Bit 4 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL4_Pos           ( 4UL )                                 /*!< Position of CHANNEL4 field. */
#define SPU_DPPI_PERM_CHANNEL4_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL4_Pos ) /*!< Bit mask of CHANNEL4 field. */
#define SPU_DPPI_PERM_CHANNEL4_NonSecure     ( 0UL )                                 /*!< Channel 4 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL4_Secure        ( 1UL )                                 /*!< Channel 4 has its secure attribute set */

/* Bit 3 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL3_Pos           ( 3UL )                                 /*!< Position of CHANNEL3 field. */
#define SPU_DPPI_PERM_CHANNEL3_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL3_Pos ) /*!< Bit mask of CHANNEL3 field. */
#define SPU_DPPI_PERM_CHANNEL3_NonSecure     ( 0UL )                                 /*!< Channel 3 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL3_Secure        ( 1UL )                                 /*!< Channel 3 has its secure attribute set */

/* Bit 2 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL2_Pos           ( 2UL )                                 /*!< Position of CHANNEL2 field. */
#define SPU_DPPI_PERM_CHANNEL2_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL2_Pos ) /*!< Bit mask of CHANNEL2 field. */
#define SPU_DPPI_PERM_CHANNEL2_NonSecure     ( 0UL )                                 /*!< Channel 2 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL2_Secure        ( 1UL )                                 /*!< Channel 2 has its secure attribute set */

/* Bit 1 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL1_Pos           ( 1UL )                                 /*!< Position of CHANNEL1 field. */
#define SPU_DPPI_PERM_CHANNEL1_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL1_Pos ) /*!< Bit mask of CHANNEL1 field. */
#define SPU_DPPI_PERM_CHANNEL1_NonSecure     ( 0UL )                                 /*!< Channel 1 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL1_Secure        ( 1UL )                                 /*!< Channel 1 has its secure attribute set */

/* Bit 0 : Select secure attribute */
#define SPU_DPPI_PERM_CHANNEL0_Pos           ( 0UL )                                 /*!< Position of CHANNEL0 field. */
#define SPU_DPPI_PERM_CHANNEL0_Msk           ( 0x1UL << SPU_DPPI_PERM_CHANNEL0_Pos ) /*!< Bit mask of CHANNEL0 field. */
#define SPU_DPPI_PERM_CHANNEL0_NonSecure     ( 0UL )                                 /*!< Channel 0 has its non-secure attribute set */
#define SPU_DPPI_PERM_CHANNEL0_Secure        ( 1UL )                                 /*!< Channel 0 has its secure attribute set */

/* Register: SPU_DPPI_LOCK */
/* Description: Description cluster: Prevent further modification of the corresponding PERM register */

/* Bit 0 :   */
#define SPU_DPPI_LOCK_LOCK_Pos         ( 0UL )                             /*!< Position of LOCK field. */
#define SPU_DPPI_LOCK_LOCK_Msk         ( 0x1UL << SPU_DPPI_LOCK_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_DPPI_LOCK_LOCK_Unlocked    ( 0UL )                             /*!< DPPI[n].PERM register content can be changed */
#define SPU_DPPI_LOCK_LOCK_Locked      ( 1UL )                             /*!< DPPI[n].PERM register can't be changed until next reset */

/* Register: SPU_GPIOPORT_PERM */
/* Description: Description cluster: Select between secure and non-secure attribute  for pins 0 to 31  of port n */

