FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 31 : Select secure attribute attribute for PIN 31. */
#define SPU_GPIOPORT_PERM_PIN31_Pos          ( 31UL )                                 /*!< Position of PIN31 field. */
#define SPU_GPIOPORT_PERM_PIN31_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define SPU_GPIOPORT_PERM_PIN31_NonSecure    ( 0UL )                                  /*!< Pin 31 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN31_Secure       ( 1UL )                                  /*!< Pin 31 has its secure attribute set */

/* Bit 30 : Select secure attribute attribute for PIN 30. */
#define SPU_GPIOPORT_PERM_PIN30_Pos          ( 30UL )                                 /*!< Position of PIN30 field. */
#define SPU_GPIOPORT_PERM_PIN30_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define SPU_GPIOPORT_PERM_PIN30_NonSecure    ( 0UL )                                  /*!< Pin 30 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN30_Secure       ( 1UL )                                  /*!< Pin 30 has its secure attribute set */

/* Bit 29 : Select secure attribute attribute for PIN 29. */
#define SPU_GPIOPORT_PERM_PIN29_Pos          ( 29UL )                                 /*!< Position of PIN29 field. */
#define SPU_GPIOPORT_PERM_PIN29_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define SPU_GPIOPORT_PERM_PIN29_NonSecure    ( 0UL )                                  /*!< Pin 29 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN29_Secure       ( 1UL )                                  /*!< Pin 29 has its secure attribute set */

/* Bit 28 : Select secure attribute attribute for PIN 28. */
#define SPU_GPIOPORT_PERM_PIN28_Pos          ( 28UL )                                 /*!< Position of PIN28 field. */
#define SPU_GPIOPORT_PERM_PIN28_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define SPU_GPIOPORT_PERM_PIN28_NonSecure    ( 0UL )                                  /*!< Pin 28 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN28_Secure       ( 1UL )                                  /*!< Pin 28 has its secure attribute set */

/* Bit 27 : Select secure attribute attribute for PIN 27. */
#define SPU_GPIOPORT_PERM_PIN27_Pos          ( 27UL )                                 /*!< Position of PIN27 field. */
#define SPU_GPIOPORT_PERM_PIN27_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define SPU_GPIOPORT_PERM_PIN27_NonSecure    ( 0UL )                                  /*!< Pin 27 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN27_Secure       ( 1UL )                                  /*!< Pin 27 has its secure attribute set */

/* Bit 26 : Select secure attribute attribute for PIN 26. */
#define SPU_GPIOPORT_PERM_PIN26_Pos          ( 26UL )                                 /*!< Position of PIN26 field. */
#define SPU_GPIOPORT_PERM_PIN26_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define SPU_GPIOPORT_PERM_PIN26_NonSecure    ( 0UL )                                  /*!< Pin 26 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN26_Secure       ( 1UL )                                  /*!< Pin 26 has its secure attribute set */

/* Bit 25 : Select secure attribute attribute for PIN 25. */
#define SPU_GPIOPORT_PERM_PIN25_Pos          ( 25UL )                                 /*!< Position of PIN25 field. */
#define SPU_GPIOPORT_PERM_PIN25_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define SPU_GPIOPORT_PERM_PIN25_NonSecure    ( 0UL )                                  /*!< Pin 25 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN25_Secure       ( 1UL )                                  /*!< Pin 25 has its secure attribute set */

/* Bit 24 : Select secure attribute attribute for PIN 24. */
#define SPU_GPIOPORT_PERM_PIN24_Pos          ( 24UL )                                 /*!< Position of PIN24 field. */
#define SPU_GPIOPORT_PERM_PIN24_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define SPU_GPIOPORT_PERM_PIN24_NonSecure    ( 0UL )                                  /*!< Pin 24 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN24_Secure       ( 1UL )                                  /*!< Pin 24 has its secure attribute set */

/* Bit 23 : Select secure attribute attribute for PIN 23. */
#define SPU_GPIOPORT_PERM_PIN23_Pos          ( 23UL )                                 /*!< Position of PIN23 field. */
#define SPU_GPIOPORT_PERM_PIN23_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define SPU_GPIOPORT_PERM_PIN23_NonSecure    ( 0UL )                                  /*!< Pin 23 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN23_Secure       ( 1UL )                                  /*!< Pin 23 has its secure attribute set */

/* Bit 22 : Select secure attribute attribute for PIN 22. */
#define SPU_GPIOPORT_PERM_PIN22_Pos          ( 22UL )                                 /*!< Position of PIN22 field. */
#define SPU_GPIOPORT_PERM_PIN22_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define SPU_GPIOPORT_PERM_PIN22_NonSecure    ( 0UL )                                  /*!< Pin 22 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN22_Secure       ( 1UL )                                  /*!< Pin 22 has its secure attribute set */

/* Bit 21 : Select secure attribute attribute for PIN 21. */
#define SPU_GPIOPORT_PERM_PIN21_Pos          ( 21UL )                                 /*!< Position of PIN21 field. */
#define SPU_GPIOPORT_PERM_PIN21_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define SPU_GPIOPORT_PERM_PIN21_NonSecure    ( 0UL )                                  /*!< Pin 21 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN21_Secure       ( 1UL )                                  /*!< Pin 21 has its secure attribute set */

/* Bit 20 : Select secure attribute attribute for PIN 20. */
#define SPU_GPIOPORT_PERM_PIN20_Pos          ( 20UL )                                 /*!< Position of PIN20 field. */
#define SPU_GPIOPORT_PERM_PIN20_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define SPU_GPIOPORT_PERM_PIN20_NonSecure    ( 0UL )                                  /*!< Pin 20 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN20_Secure       ( 1UL )                                  /*!< Pin 20 has its secure attribute set */

/* Bit 19 : Select secure attribute attribute for PIN 19. */
#define SPU_GPIOPORT_PERM_PIN19_Pos          ( 19UL )                                 /*!< Position of PIN19 field. */
#define SPU_GPIOPORT_PERM_PIN19_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define SPU_GPIOPORT_PERM_PIN19_NonSecure    ( 0UL )                                  /*!< Pin 19 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN19_Secure       ( 1UL )                                  /*!< Pin 19 has its secure attribute set */

/* Bit 18 : Select secure attribute attribute for PIN 18. */
#define SPU_GPIOPORT_PERM_PIN18_Pos          ( 18UL )                                 /*!< Position of PIN18 field. */
#define SPU_GPIOPORT_PERM_PIN18_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define SPU_GPIOPORT_PERM_PIN18_NonSecure    ( 0UL )                                  /*!< Pin 18 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN18_Secure       ( 1UL )                                  /*!< Pin 18 has its secure attribute set */

/* Bit 17 : Select secure attribute attribute for PIN 17. */
#define SPU_GPIOPORT_PERM_PIN17_Pos          ( 17UL )                                 /*!< Position of PIN17 field. */
#define SPU_GPIOPORT_PERM_PIN17_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define SPU_GPIOPORT_PERM_PIN17_NonSecure    ( 0UL )                                  /*!< Pin 17 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN17_Secure       ( 1UL )                                  /*!< Pin 17 has its secure attribute set */

/* Bit 16 : Select secure attribute attribute for PIN 16. */
#define SPU_GPIOPORT_PERM_PIN16_Pos          ( 16UL )                                 /*!< Position of PIN16 field. */
#define SPU_GPIOPORT_PERM_PIN16_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define SPU_GPIOPORT_PERM_PIN16_NonSecure    ( 0UL )                                  /*!< Pin 16 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN16_Secure       ( 1UL )                                  /*!< Pin 16 has its secure attribute set */

