FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 15 : Select secure attribute attribute for PIN 15. */
#define SPU_GPIOPORT_PERM_PIN15_Pos          ( 15UL )                                 /*!< Position of PIN15 field. */
#define SPU_GPIOPORT_PERM_PIN15_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define SPU_GPIOPORT_PERM_PIN15_NonSecure    ( 0UL )                                  /*!< Pin 15 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN15_Secure       ( 1UL )                                  /*!< Pin 15 has its secure attribute set */

/* Bit 14 : Select secure attribute attribute for PIN 14. */
#define SPU_GPIOPORT_PERM_PIN14_Pos          ( 14UL )                                 /*!< Position of PIN14 field. */
#define SPU_GPIOPORT_PERM_PIN14_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define SPU_GPIOPORT_PERM_PIN14_NonSecure    ( 0UL )                                  /*!< Pin 14 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN14_Secure       ( 1UL )                                  /*!< Pin 14 has its secure attribute set */

/* Bit 13 : Select secure attribute attribute for PIN 13. */
#define SPU_GPIOPORT_PERM_PIN13_Pos          ( 13UL )                                 /*!< Position of PIN13 field. */
#define SPU_GPIOPORT_PERM_PIN13_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define SPU_GPIOPORT_PERM_PIN13_NonSecure    ( 0UL )                                  /*!< Pin 13 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN13_Secure       ( 1UL )                                  /*!< Pin 13 has its secure attribute set */

/* Bit 12 : Select secure attribute attribute for PIN 12. */
#define SPU_GPIOPORT_PERM_PIN12_Pos          ( 12UL )                                 /*!< Position of PIN12 field. */
#define SPU_GPIOPORT_PERM_PIN12_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define SPU_GPIOPORT_PERM_PIN12_NonSecure    ( 0UL )                                  /*!< Pin 12 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN12_Secure       ( 1UL )                                  /*!< Pin 12 has its secure attribute set */

/* Bit 11 : Select secure attribute attribute for PIN 11. */
#define SPU_GPIOPORT_PERM_PIN11_Pos          ( 11UL )                                 /*!< Position of PIN11 field. */
#define SPU_GPIOPORT_PERM_PIN11_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define SPU_GPIOPORT_PERM_PIN11_NonSecure    ( 0UL )                                  /*!< Pin 11 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN11_Secure       ( 1UL )                                  /*!< Pin 11 has its secure attribute set */

/* Bit 10 : Select secure attribute attribute for PIN 10. */
#define SPU_GPIOPORT_PERM_PIN10_Pos          ( 10UL )                                 /*!< Position of PIN10 field. */
#define SPU_GPIOPORT_PERM_PIN10_Msk          ( 0x1UL << SPU_GPIOPORT_PERM_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define SPU_GPIOPORT_PERM_PIN10_NonSecure    ( 0UL )                                  /*!< Pin 10 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN10_Secure       ( 1UL )                                  /*!< Pin 10 has its secure attribute set */

/* Bit 9 : Select secure attribute attribute for PIN 9. */
#define SPU_GPIOPORT_PERM_PIN9_Pos           ( 9UL )                                 /*!< Position of PIN9 field. */
#define SPU_GPIOPORT_PERM_PIN9_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define SPU_GPIOPORT_PERM_PIN9_NonSecure     ( 0UL )                                 /*!< Pin 9 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN9_Secure        ( 1UL )                                 /*!< Pin 9 has its secure attribute set */

/* Bit 8 : Select secure attribute attribute for PIN 8. */
#define SPU_GPIOPORT_PERM_PIN8_Pos           ( 8UL )                                 /*!< Position of PIN8 field. */
#define SPU_GPIOPORT_PERM_PIN8_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define SPU_GPIOPORT_PERM_PIN8_NonSecure     ( 0UL )                                 /*!< Pin 8 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN8_Secure        ( 1UL )                                 /*!< Pin 8 has its secure attribute set */

/* Bit 7 : Select secure attribute attribute for PIN 7. */
#define SPU_GPIOPORT_PERM_PIN7_Pos           ( 7UL )                                 /*!< Position of PIN7 field. */
#define SPU_GPIOPORT_PERM_PIN7_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define SPU_GPIOPORT_PERM_PIN7_NonSecure     ( 0UL )                                 /*!< Pin 7 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN7_Secure        ( 1UL )                                 /*!< Pin 7 has its secure attribute set */

/* Bit 6 : Select secure attribute attribute for PIN 6. */
#define SPU_GPIOPORT_PERM_PIN6_Pos           ( 6UL )                                 /*!< Position of PIN6 field. */
#define SPU_GPIOPORT_PERM_PIN6_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define SPU_GPIOPORT_PERM_PIN6_NonSecure     ( 0UL )                                 /*!< Pin 6 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN6_Secure        ( 1UL )                                 /*!< Pin 6 has its secure attribute set */

/* Bit 5 : Select secure attribute attribute for PIN 5. */
#define SPU_GPIOPORT_PERM_PIN5_Pos           ( 5UL )                                 /*!< Position of PIN5 field. */
#define SPU_GPIOPORT_PERM_PIN5_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define SPU_GPIOPORT_PERM_PIN5_NonSecure     ( 0UL )                                 /*!< Pin 5 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN5_Secure        ( 1UL )                                 /*!< Pin 5 has its secure attribute set */

/* Bit 4 : Select secure attribute attribute for PIN 4. */
#define SPU_GPIOPORT_PERM_PIN4_Pos           ( 4UL )                                 /*!< Position of PIN4 field. */
#define SPU_GPIOPORT_PERM_PIN4_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define SPU_GPIOPORT_PERM_PIN4_NonSecure     ( 0UL )                                 /*!< Pin 4 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN4_Secure        ( 1UL )                                 /*!< Pin 4 has its secure attribute set */

