FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 3 : Select secure attribute attribute for PIN 3. */
#define SPU_GPIOPORT_PERM_PIN3_Pos           ( 3UL )                                 /*!< Position of PIN3 field. */
#define SPU_GPIOPORT_PERM_PIN3_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define SPU_GPIOPORT_PERM_PIN3_NonSecure     ( 0UL )                                 /*!< Pin 3 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN3_Secure        ( 1UL )                                 /*!< Pin 3 has its secure attribute set */

/* Bit 2 : Select secure attribute attribute for PIN 2. */
#define SPU_GPIOPORT_PERM_PIN2_Pos           ( 2UL )                                 /*!< Position of PIN2 field. */
#define SPU_GPIOPORT_PERM_PIN2_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define SPU_GPIOPORT_PERM_PIN2_NonSecure     ( 0UL )                                 /*!< Pin 2 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN2_Secure        ( 1UL )                                 /*!< Pin 2 has its secure attribute set */

/* Bit 1 : Select secure attribute attribute for PIN 1. */
#define SPU_GPIOPORT_PERM_PIN1_Pos           ( 1UL )                                 /*!< Position of PIN1 field. */
#define SPU_GPIOPORT_PERM_PIN1_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define SPU_GPIOPORT_PERM_PIN1_NonSecure     ( 0UL )                                 /*!< Pin 1 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN1_Secure        ( 1UL )                                 /*!< Pin 1 has its secure attribute set */

/* Bit 0 : Select secure attribute attribute for PIN 0. */
#define SPU_GPIOPORT_PERM_PIN0_Pos           ( 0UL )                                 /*!< Position of PIN0 field. */
#define SPU_GPIOPORT_PERM_PIN0_Msk           ( 0x1UL << SPU_GPIOPORT_PERM_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define SPU_GPIOPORT_PERM_PIN0_NonSecure     ( 0UL )                                 /*!< Pin 0 has its non-secure attribute set */
#define SPU_GPIOPORT_PERM_PIN0_Secure        ( 1UL )                                 /*!< Pin 0 has its secure attribute set */

/* Register: SPU_GPIOPORT_LOCK */
/* Description: Description cluster: Prevent further modification of the corresponding PERM register */

/* Bit 0 :   */
#define SPU_GPIOPORT_LOCK_LOCK_Pos         ( 0UL )                                 /*!< Position of LOCK field. */
#define SPU_GPIOPORT_LOCK_LOCK_Msk         ( 0x1UL << SPU_GPIOPORT_LOCK_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_GPIOPORT_LOCK_LOCK_Unlocked    ( 0UL )                                 /*!< GPIOPORT[n].PERM register content can be changed */
#define SPU_GPIOPORT_LOCK_LOCK_Locked      ( 1UL )                                 /*!< GPIOPORT[n].PERM register can't be changed until next reset */

/* Register: SPU_FLASHNSC_REGION */
/* Description: Description cluster: Define which flash region can contain the non-secure callable (NSC) region n */

/* Bit 8 :   */
#define SPU_FLASHNSC_REGION_LOCK_Pos         ( 8UL )                                   /*!< Position of LOCK field. */
#define SPU_FLASHNSC_REGION_LOCK_Msk         ( 0x1UL << SPU_FLASHNSC_REGION_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_FLASHNSC_REGION_LOCK_Unlocked    ( 0UL )                                   /*!< This register can be updated */
#define SPU_FLASHNSC_REGION_LOCK_Locked      ( 1UL )                                   /*!< The content of this register can't be changed until the next reset */

/* Bits 5..0 : Region number */
#define SPU_FLASHNSC_REGION_REGION_Pos       ( 0UL )                                      /*!< Position of REGION field. */
#define SPU_FLASHNSC_REGION_REGION_Msk       ( 0x3FUL << SPU_FLASHNSC_REGION_REGION_Pos ) /*!< Bit mask of REGION field. */

/* Register: SPU_FLASHNSC_SIZE */
/* Description: Description cluster: Define the size of the non-secure callable (NSC) region n */

/* Bit 8 :   */
#define SPU_FLASHNSC_SIZE_LOCK_Pos         ( 8UL )                                 /*!< Position of LOCK field. */
#define SPU_FLASHNSC_SIZE_LOCK_Msk         ( 0x1UL << SPU_FLASHNSC_SIZE_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_FLASHNSC_SIZE_LOCK_Unlocked    ( 0UL )                                 /*!< This register can be updated */
#define SPU_FLASHNSC_SIZE_LOCK_Locked      ( 1UL )                                 /*!< The content of this register can't be changed until the next reset */

/* Bits 3..0 : Size of the non-secure callable (NSC) region n */
#define SPU_FLASHNSC_SIZE_SIZE_Pos         ( 0UL )                                 /*!< Position of SIZE field. */
#define SPU_FLASHNSC_SIZE_SIZE_Msk         ( 0xFUL << SPU_FLASHNSC_SIZE_SIZE_Pos ) /*!< Bit mask of SIZE field. */
#define SPU_FLASHNSC_SIZE_SIZE_Disabled    ( 0UL )                                 /*!< The region n is not defined as a non-secure callable region. Normal security attributes (secure or non-secure) are enforced. */
#define SPU_FLASHNSC_SIZE_SIZE_32          ( 1UL )                                 /*!< The region n is defined as non-secure callable with size 32 bytes */
#define SPU_FLASHNSC_SIZE_SIZE_64          ( 2UL )                                 /*!< The region n is defined as non-secure callable with size 64 bytes */
#define SPU_FLASHNSC_SIZE_SIZE_128         ( 3UL )                                 /*!< The region n is defined as non-secure callable with size 128 bytes */
#define SPU_FLASHNSC_SIZE_SIZE_256         ( 4UL )                                 /*!< The region n is defined as non-secure callable with size 256 bytes */
#define SPU_FLASHNSC_SIZE_SIZE_512         ( 5UL )                                 /*!< The region n is defined as non-secure callable with size 512 bytes */
#define SPU_FLASHNSC_SIZE_SIZE_1024        ( 6UL )                                 /*!< The region n is defined as non-secure callable with size 1024 bytes */
#define SPU_FLASHNSC_SIZE_SIZE_2048        ( 7UL )                                 /*!< The region n is defined as non-secure callable with size 2048 bytes */
#define SPU_FLASHNSC_SIZE_SIZE_4096        ( 8UL )                                 /*!< The region n is defined as non-secure callable with size 4096 bytes */

