FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: SPU_RAMNSC_REGION */
/* Description: Description cluster: Define which RAM region can contain the non-secure callable (NSC) region n */

/* Bit 8 :   */
#define SPU_RAMNSC_REGION_LOCK_Pos         ( 8UL )                                 /*!< Position of LOCK field. */
#define SPU_RAMNSC_REGION_LOCK_Msk         ( 0x1UL << SPU_RAMNSC_REGION_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_RAMNSC_REGION_LOCK_Unlocked    ( 0UL )                                 /*!< This register can be updated */
#define SPU_RAMNSC_REGION_LOCK_Locked      ( 1UL )                                 /*!< The content of this register can't be changed until the next reset */

/* Bits 5..0 : Region number */
#define SPU_RAMNSC_REGION_REGION_Pos       ( 0UL )                                    /*!< Position of REGION field. */
#define SPU_RAMNSC_REGION_REGION_Msk       ( 0x3FUL << SPU_RAMNSC_REGION_REGION_Pos ) /*!< Bit mask of REGION field. */

/* Register: SPU_RAMNSC_SIZE */
/* Description: Description cluster: Define the size of the non-secure callable (NSC) region n */

/* Bit 8 :   */
#define SPU_RAMNSC_SIZE_LOCK_Pos         ( 8UL )                               /*!< Position of LOCK field. */
#define SPU_RAMNSC_SIZE_LOCK_Msk         ( 0x1UL << SPU_RAMNSC_SIZE_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_RAMNSC_SIZE_LOCK_Unlocked    ( 0UL )                               /*!< This register can be updated */
#define SPU_RAMNSC_SIZE_LOCK_Locked      ( 1UL )                               /*!< The content of this register can't be changed until the next reset */

/* Bits 3..0 : Size of the non-secure callable (NSC) region n */
#define SPU_RAMNSC_SIZE_SIZE_Pos         ( 0UL )                               /*!< Position of SIZE field. */
#define SPU_RAMNSC_SIZE_SIZE_Msk         ( 0xFUL << SPU_RAMNSC_SIZE_SIZE_Pos ) /*!< Bit mask of SIZE field. */
#define SPU_RAMNSC_SIZE_SIZE_Disabled    ( 0UL )                               /*!< The region n is not defined as a non-secure callable region. Normal security attributes (secure or non-secure) are enforced. */
#define SPU_RAMNSC_SIZE_SIZE_32          ( 1UL )                               /*!< The region n is defined as non-secure callable with size 32 bytes */
#define SPU_RAMNSC_SIZE_SIZE_64          ( 2UL )                               /*!< The region n is defined as non-secure callable with size 64 bytes */
#define SPU_RAMNSC_SIZE_SIZE_128         ( 3UL )                               /*!< The region n is defined as non-secure callable with size 128 bytes */
#define SPU_RAMNSC_SIZE_SIZE_256         ( 4UL )                               /*!< The region n is defined as non-secure callable with size 256 bytes */
#define SPU_RAMNSC_SIZE_SIZE_512         ( 5UL )                               /*!< The region n is defined as non-secure callable with size 512 bytes */
#define SPU_RAMNSC_SIZE_SIZE_1024        ( 6UL )                               /*!< The region n is defined as non-secure callable with size 1024 bytes */
#define SPU_RAMNSC_SIZE_SIZE_2048        ( 7UL )                               /*!< The region n is defined as non-secure callable with size 2048 bytes */
#define SPU_RAMNSC_SIZE_SIZE_4096        ( 8UL )                               /*!< The region n is defined as non-secure callable with size 4096 bytes */

/* Register: SPU_FLASHREGION_PERM */
/* Description: Description cluster: Access permissions for flash region n */

/* Bit 8 :   */
#define SPU_FLASHREGION_PERM_LOCK_Pos              ( 8UL )                                    /*!< Position of LOCK field. */
#define SPU_FLASHREGION_PERM_LOCK_Msk              ( 0x1UL << SPU_FLASHREGION_PERM_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_FLASHREGION_PERM_LOCK_Unlocked         ( 0UL )                                    /*!< This register can be updated */
#define SPU_FLASHREGION_PERM_LOCK_Locked           ( 1UL )                                    /*!< The content of this register can't be changed until the next reset */

/* Bit 4 : Security attribute for flash region n */
#define SPU_FLASHREGION_PERM_SECATTR_Pos           ( 4UL )                                       /*!< Position of SECATTR field. */
#define SPU_FLASHREGION_PERM_SECATTR_Msk           ( 0x1UL << SPU_FLASHREGION_PERM_SECATTR_Pos ) /*!< Bit mask of SECATTR field. */
#define SPU_FLASHREGION_PERM_SECATTR_Non_Secure    ( 0UL )                                       /*!< Flash region n security attribute is non-secure */
#define SPU_FLASHREGION_PERM_SECATTR_Secure        ( 1UL )                                       /*!< Flash region n security attribute is secure */

/* Bit 2 : Configure read permissions for flash region n */
#define SPU_FLASHREGION_PERM_READ_Pos              ( 2UL )                                    /*!< Position of READ field. */
#define SPU_FLASHREGION_PERM_READ_Msk              ( 0x1UL << SPU_FLASHREGION_PERM_READ_Pos ) /*!< Bit mask of READ field. */
#define SPU_FLASHREGION_PERM_READ_Disable          ( 0UL )                                    /*!< Block read operation from flash region n */
#define SPU_FLASHREGION_PERM_READ_Enable           ( 1UL )                                    /*!< Allow read operation from flash region n */

/* Bit 1 : Configure write permission for flash region n */
#define SPU_FLASHREGION_PERM_WRITE_Pos             ( 1UL )                                     /*!< Position of WRITE field. */
#define SPU_FLASHREGION_PERM_WRITE_Msk             ( 0x1UL << SPU_FLASHREGION_PERM_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define SPU_FLASHREGION_PERM_WRITE_Disable         ( 0UL )                                     /*!< Block write operation to region n */
#define SPU_FLASHREGION_PERM_WRITE_Enable          ( 1UL )                                     /*!< Allow write operation to region n */

/* Bit 0 : Configure instruction fetch permissions from flash region n */
#define SPU_FLASHREGION_PERM_EXECUTE_Pos           ( 0UL )                                       /*!< Position of EXECUTE field. */
#define SPU_FLASHREGION_PERM_EXECUTE_Msk           ( 0x1UL << SPU_FLASHREGION_PERM_EXECUTE_Pos ) /*!< Bit mask of EXECUTE field. */
#define SPU_FLASHREGION_PERM_EXECUTE_Disable       ( 0UL )                                       /*!< Block instruction fetches from flash region n */
#define SPU_FLASHREGION_PERM_EXECUTE_Enable        ( 1UL )                                       /*!< Allow instruction fetches from flash region n */

/* Register: SPU_RAMREGION_PERM */
/* Description: Description cluster: Access permissions for RAM region n */

/* Bit 8 :   */
#define SPU_RAMREGION_PERM_LOCK_Pos              ( 8UL )                                  /*!< Position of LOCK field. */
#define SPU_RAMREGION_PERM_LOCK_Msk              ( 0x1UL << SPU_RAMREGION_PERM_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_RAMREGION_PERM_LOCK_Unlocked         ( 0UL )                                  /*!< This register can be updated */
#define SPU_RAMREGION_PERM_LOCK_Locked           ( 1UL )                                  /*!< The content of this register can't be changed until the next reset */

/* Bit 4 : Security attribute for RAM region n */
#define SPU_RAMREGION_PERM_SECATTR_Pos           ( 4UL )                                     /*!< Position of SECATTR field. */
#define SPU_RAMREGION_PERM_SECATTR_Msk           ( 0x1UL << SPU_RAMREGION_PERM_SECATTR_Pos ) /*!< Bit mask of SECATTR field. */
#define SPU_RAMREGION_PERM_SECATTR_Non_Secure    ( 0UL )                                     /*!< RAM region n security attribute is non-secure */
#define SPU_RAMREGION_PERM_SECATTR_Secure        ( 1UL )                                     /*!< RAM region n security attribute is secure */

/* Bit 2 : Configure read permissions for RAM region n */
#define SPU_RAMREGION_PERM_READ_Pos              ( 2UL )                                  /*!< Position of READ field. */
#define SPU_RAMREGION_PERM_READ_Msk              ( 0x1UL << SPU_RAMREGION_PERM_READ_Pos ) /*!< Bit mask of READ field. */
#define SPU_RAMREGION_PERM_READ_Disable          ( 0UL )                                  /*!< Block read operation from RAM region n */
#define SPU_RAMREGION_PERM_READ_Enable           ( 1UL )                                  /*!< Allow read operation from RAM region n */

