FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 1 : Configure write permission for RAM region n */
#define SPU_RAMREGION_PERM_WRITE_Pos             ( 1UL )                                   /*!< Position of WRITE field. */
#define SPU_RAMREGION_PERM_WRITE_Msk             ( 0x1UL << SPU_RAMREGION_PERM_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define SPU_RAMREGION_PERM_WRITE_Disable         ( 0UL )                                   /*!< Block write operation to RAM region n */
#define SPU_RAMREGION_PERM_WRITE_Enable          ( 1UL )                                   /*!< Allow write operation to RAM region n */

/* Bit 0 : Configure instruction fetch permissions from RAM region n */
#define SPU_RAMREGION_PERM_EXECUTE_Pos           ( 0UL )                                     /*!< Position of EXECUTE field. */
#define SPU_RAMREGION_PERM_EXECUTE_Msk           ( 0x1UL << SPU_RAMREGION_PERM_EXECUTE_Pos ) /*!< Bit mask of EXECUTE field. */
#define SPU_RAMREGION_PERM_EXECUTE_Disable       ( 0UL )                                     /*!< Block instruction fetches from RAM region n */
#define SPU_RAMREGION_PERM_EXECUTE_Enable        ( 1UL )                                     /*!< Allow instruction fetches from RAM region n */

/* Register: SPU_PERIPHID_PERM */
/* Description: Description cluster: List capabilities and access permissions for the peripheral with ID n */

/* Bit 31 : Indicate if a peripheral is present with ID n */
#define SPU_PERIPHID_PERM_PRESENT_Pos                     ( 31UL )                                   /*!< Position of PRESENT field. */
#define SPU_PERIPHID_PERM_PRESENT_Msk                     ( 0x1UL << SPU_PERIPHID_PERM_PRESENT_Pos ) /*!< Bit mask of PRESENT field. */
#define SPU_PERIPHID_PERM_PRESENT_NotPresent              ( 0UL )                                    /*!< Peripheral is not present */
#define SPU_PERIPHID_PERM_PRESENT_IsPresent               ( 1UL )                                    /*!< Peripheral is present */

/* Bit 8 :   */
#define SPU_PERIPHID_PERM_LOCK_Pos                        ( 8UL )                                 /*!< Position of LOCK field. */
#define SPU_PERIPHID_PERM_LOCK_Msk                        ( 0x1UL << SPU_PERIPHID_PERM_LOCK_Pos ) /*!< Bit mask of LOCK field. */
#define SPU_PERIPHID_PERM_LOCK_Unlocked                   ( 0UL )                                 /*!< This register can be updated */
#define SPU_PERIPHID_PERM_LOCK_Locked                     ( 1UL )                                 /*!< The content of this register can't be changed until the next reset */

/* Bit 5 : Security attribution for the DMA transfer */
#define SPU_PERIPHID_PERM_DMASEC_Pos                      ( 5UL )                                   /*!< Position of DMASEC field. */
#define SPU_PERIPHID_PERM_DMASEC_Msk                      ( 0x1UL << SPU_PERIPHID_PERM_DMASEC_Pos ) /*!< Bit mask of DMASEC field. */
#define SPU_PERIPHID_PERM_DMASEC_NonSecure                ( 0UL )                                   /*!< DMA transfers initiated by this peripheral have the non-secure attribute set */
#define SPU_PERIPHID_PERM_DMASEC_Secure                   ( 1UL )                                   /*!< DMA transfers initiated by this peripheral have the secure attribute set */

/* Bit 4 : Peripheral security mapping */
#define SPU_PERIPHID_PERM_SECATTR_Pos                     ( 4UL )                                    /*!< Position of SECATTR field. */
#define SPU_PERIPHID_PERM_SECATTR_Msk                     ( 0x1UL << SPU_PERIPHID_PERM_SECATTR_Pos ) /*!< Bit mask of SECATTR field. */
#define SPU_PERIPHID_PERM_SECATTR_NonSecure               ( 0UL )                                    /*!< If SECUREMAPPING == UserSelectable: Peripheral is mapped in non-secure peripheral address space. If SECUREMAPPING == Split: Peripheral is mapped in non-secure and secure peripheral address space. */
#define SPU_PERIPHID_PERM_SECATTR_Secure                  ( 1UL )                                    /*!< Peripheral is mapped in secure peripheral address space */

/* Bits 3..2 : Indicates if the peripheral has DMA capabilities and if DMA transfer can be assigned to a different security attribute than the peripheral itself */
#define SPU_PERIPHID_PERM_DMA_Pos                         ( 2UL )                                /*!< Position of DMA field. */
#define SPU_PERIPHID_PERM_DMA_Msk                         ( 0x3UL << SPU_PERIPHID_PERM_DMA_Pos ) /*!< Bit mask of DMA field. */
#define SPU_PERIPHID_PERM_DMA_NoDMA                       ( 0UL )                                /*!< Peripheral has no DMA capability */
#define SPU_PERIPHID_PERM_DMA_NoSeparateAttribute         ( 1UL )                                /*!< Peripheral has DMA and DMA transfers always have the same security attribute as assigned to the peripheral */
#define SPU_PERIPHID_PERM_DMA_SeparateAttribute           ( 2UL )                                /*!< Peripheral has DMA and DMA transfers can have a different security attribute than the one assigned to the peripheral */

/* Bits 1..0 : Define configuration capabilities for Arm TrustZone Cortex-M secure attribute */
#define SPU_PERIPHID_PERM_SECUREMAPPING_Pos               ( 0UL )                                          /*!< Position of SECUREMAPPING field. */
#define SPU_PERIPHID_PERM_SECUREMAPPING_Msk               ( 0x3UL << SPU_PERIPHID_PERM_SECUREMAPPING_Pos ) /*!< Bit mask of SECUREMAPPING field. */
#define SPU_PERIPHID_PERM_SECUREMAPPING_NonSecure         ( 0UL )                                          /*!< This peripheral is always accessible as a non-secure peripheral */
#define SPU_PERIPHID_PERM_SECUREMAPPING_Secure            ( 1UL )                                          /*!< This peripheral is always accessible as a secure peripheral */
#define SPU_PERIPHID_PERM_SECUREMAPPING_UserSelectable    ( 2UL )                                          /*!< Non-secure or secure attribute for this peripheral is defined by the PERIPHID[n].PERM register */
#define SPU_PERIPHID_PERM_SECUREMAPPING_Split             ( 3UL )                                          /*!< This peripheral implements the split security mechanism. Non-secure or secure attribute for this peripheral is defined by the PERIPHID[n].PERM register. */


