FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Peripheral: TAD */
/* Description: Trace and debug control */

/* Register: TAD_CLOCKSTART */
/* Description: Start all trace and debug clocks. */

/* Bit 0 :   */
#define TAD_CLOCKSTART_START_Pos      ( 0UL )                               /*!< Position of START field. */
#define TAD_CLOCKSTART_START_Msk      ( 0x1UL << TAD_CLOCKSTART_START_Pos ) /*!< Bit mask of START field. */
#define TAD_CLOCKSTART_START_Start    ( 1UL )                               /*!< Start all trace and debug clocks. */

/* Register: TAD_CLOCKSTOP */
/* Description: Stop all trace and debug clocks. */

/* Bit 0 :   */
#define TAD_CLOCKSTOP_STOP_Pos     ( 0UL )                             /*!< Position of STOP field. */
#define TAD_CLOCKSTOP_STOP_Msk     ( 0x1UL << TAD_CLOCKSTOP_STOP_Pos ) /*!< Bit mask of STOP field. */
#define TAD_CLOCKSTOP_STOP_Stop    ( 1UL )                             /*!< Stop all trace and debug clocks. */

/* Register: TAD_ENABLE */
/* Description: Enable debug domain and aquire selected GPIOs */

/* Bit 0 :   */
#define TAD_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define TAD_ENABLE_ENABLE_Msk         ( 0x1UL << TAD_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define TAD_ENABLE_ENABLE_DISABLED    ( 0UL )                            /*!< Disable debug domain and release selected GPIOs */
#define TAD_ENABLE_ENABLE_ENABLED     ( 1UL )                            /*!< Enable debug domain and aquire selected GPIOs */

/* Register: TAD_PSEL_TRACECLK */
/* Description: Pin configuration for TRACECLK */

/* Bit 31 : Connection */
#define TAD_PSEL_TRACECLK_CONNECT_Pos             ( 31UL )                                   /*!< Position of CONNECT field. */
#define TAD_PSEL_TRACECLK_CONNECT_Msk             ( 0x1UL << TAD_PSEL_TRACECLK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TAD_PSEL_TRACECLK_CONNECT_Connected       ( 0UL )                                    /*!< Connect */
#define TAD_PSEL_TRACECLK_CONNECT_Disconnected    ( 1UL )                                    /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TAD_PSEL_TRACECLK_PIN_Pos                 ( 0UL )                                 /*!< Position of PIN field. */
#define TAD_PSEL_TRACECLK_PIN_Msk                 ( 0x1FUL << TAD_PSEL_TRACECLK_PIN_Pos ) /*!< Bit mask of PIN field. */
#define TAD_PSEL_TRACECLK_PIN_Traceclk            ( 12UL )                                /*!< TRACECLK pin */

/* Register: TAD_PSEL_TRACEDATA0 */
/* Description: Pin configuration for TRACEDATA[0] */

/* Bit 31 : Connection */
#define TAD_PSEL_TRACEDATA0_CONNECT_Pos             ( 31UL )                                     /*!< Position of CONNECT field. */
#define TAD_PSEL_TRACEDATA0_CONNECT_Msk             ( 0x1UL << TAD_PSEL_TRACEDATA0_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TAD_PSEL_TRACEDATA0_CONNECT_Connected       ( 0UL )                                      /*!< Connect */
#define TAD_PSEL_TRACEDATA0_CONNECT_Disconnected    ( 1UL )                                      /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TAD_PSEL_TRACEDATA0_PIN_Pos                 ( 0UL )                                   /*!< Position of PIN field. */
#define TAD_PSEL_TRACEDATA0_PIN_Msk                 ( 0x1FUL << TAD_PSEL_TRACEDATA0_PIN_Pos ) /*!< Bit mask of PIN field. */
#define TAD_PSEL_TRACEDATA0_PIN_Tracedata0          ( 11UL )                                  /*!< TRACEDATA0 pin */

/* Register: TAD_PSEL_TRACEDATA1 */
/* Description: Pin configuration for TRACEDATA[1] */

/* Bit 31 : Connection */
#define TAD_PSEL_TRACEDATA1_CONNECT_Pos             ( 31UL )                                     /*!< Position of CONNECT field. */
#define TAD_PSEL_TRACEDATA1_CONNECT_Msk             ( 0x1UL << TAD_PSEL_TRACEDATA1_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TAD_PSEL_TRACEDATA1_CONNECT_Connected       ( 0UL )                                      /*!< Connect */
#define TAD_PSEL_TRACEDATA1_CONNECT_Disconnected    ( 1UL )                                      /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TAD_PSEL_TRACEDATA1_PIN_Pos                 ( 0UL )                                   /*!< Position of PIN field. */
#define TAD_PSEL_TRACEDATA1_PIN_Msk                 ( 0x1FUL << TAD_PSEL_TRACEDATA1_PIN_Pos ) /*!< Bit mask of PIN field. */
#define TAD_PSEL_TRACEDATA1_PIN_Tracedata1          ( 10UL )                                  /*!< TRACEDATA1 pin */

/* Register: TAD_PSEL_TRACEDATA2 */
/* Description: Pin configuration for TRACEDATA[2] */

/* Bit 31 : Connection */
#define TAD_PSEL_TRACEDATA2_CONNECT_Pos             ( 31UL )                                     /*!< Position of CONNECT field. */
#define TAD_PSEL_TRACEDATA2_CONNECT_Msk             ( 0x1UL << TAD_PSEL_TRACEDATA2_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TAD_PSEL_TRACEDATA2_CONNECT_Connected       ( 0UL )                                      /*!< Connect */
#define TAD_PSEL_TRACEDATA2_CONNECT_Disconnected    ( 1UL )                                      /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TAD_PSEL_TRACEDATA2_PIN_Pos                 ( 0UL )                                   /*!< Position of PIN field. */
#define TAD_PSEL_TRACEDATA2_PIN_Msk                 ( 0x1FUL << TAD_PSEL_TRACEDATA2_PIN_Pos ) /*!< Bit mask of PIN field. */
#define TAD_PSEL_TRACEDATA2_PIN_Tracedata2          ( 9UL )                                   /*!< TRACEDATA2 pin */

/* Register: TAD_PSEL_TRACEDATA3 */
/* Description: Pin configuration for TRACEDATA[3] */

/* Bit 31 : Connection */
#define TAD_PSEL_TRACEDATA3_CONNECT_Pos             ( 31UL )                                     /*!< Position of CONNECT field. */
#define TAD_PSEL_TRACEDATA3_CONNECT_Msk             ( 0x1UL << TAD_PSEL_TRACEDATA3_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TAD_PSEL_TRACEDATA3_CONNECT_Connected       ( 0UL )                                      /*!< Connect */
#define TAD_PSEL_TRACEDATA3_CONNECT_Disconnected    ( 1UL )                                      /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TAD_PSEL_TRACEDATA3_PIN_Pos                 ( 0UL )                                   /*!< Position of PIN field. */
#define TAD_PSEL_TRACEDATA3_PIN_Msk                 ( 0x1FUL << TAD_PSEL_TRACEDATA3_PIN_Pos ) /*!< Bit mask of PIN field. */
#define TAD_PSEL_TRACEDATA3_PIN_Tracedata3          ( 8UL )                                   /*!< TRACEDATA3 pin */

/* Register: TAD_TRACEPORTSPEED */
/* Description: Clocking options for the Trace Port debug interface Reset behavior is the same as debug components */

