FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 1..0 : Speed of Trace Port clock. Note that the TRACECLK pin output will be divided again by two from the Trace Port clock. */
#define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Pos      ( 0UL )                                            /*!< Position of TRACEPORTSPEED field. */
#define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Msk      ( 0x3UL << TAD_TRACEPORTSPEED_TRACEPORTSPEED_Pos ) /*!< Bit mask of TRACEPORTSPEED field. */
#define TAD_TRACEPORTSPEED_TRACEPORTSPEED_64MHz    ( 0UL )                                            /*!< Trace Port clock is: 64MHz */
#define TAD_TRACEPORTSPEED_TRACEPORTSPEED_32MHz    ( 1UL )                                            /*!< Trace Port clock is: 32MHz */
#define TAD_TRACEPORTSPEED_TRACEPORTSPEED_16MHz    ( 2UL )                                            /*!< Trace Port clock is: 16MHz */
#define TAD_TRACEPORTSPEED_TRACEPORTSPEED_8MHz     ( 3UL )                                            /*!< Trace Port clock is: 8MHz */


/* Peripheral: TIMER */
/* Description: Timer/Counter 0 */

/* Register: TIMER_TASKS_START */
/* Description: Start Timer */

/* Bit 0 : Start Timer */
#define TIMER_TASKS_START_TASKS_START_Pos        ( 0UL )                                        /*!< Position of TASKS_START field. */
#define TIMER_TASKS_START_TASKS_START_Msk        ( 0x1UL << TIMER_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define TIMER_TASKS_START_TASKS_START_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_STOP */
/* Description: Stop Timer */

/* Bit 0 : Stop Timer */
#define TIMER_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                      /*!< Position of TASKS_STOP field. */
#define TIMER_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << TIMER_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define TIMER_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: TIMER_TASKS_COUNT */
/* Description: Increment Timer (Counter mode only) */

/* Bit 0 : Increment Timer (Counter mode only) */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Pos        ( 0UL )                                        /*!< Position of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Msk        ( 0x1UL << TIMER_TASKS_COUNT_TASKS_COUNT_Pos ) /*!< Bit mask of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_CLEAR */
/* Description: Clear time */

/* Bit 0 : Clear time */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos        ( 0UL )                                        /*!< Position of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Msk        ( 0x1UL << TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos ) /*!< Bit mask of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_SHUTDOWN */
/* Description: Deprecated register - Shut down timer */

/* Bit 0 : Deprecated field -  Shut down timer */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos        ( 0UL )                                              /*!< Position of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk        ( 0x1UL << TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos ) /*!< Bit mask of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: TIMER_TASKS_CAPTURE */
/* Description: Description collection: Capture Timer value to CC[n] register */

/* Bit 0 : Capture Timer value to CC[n] register */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos        ( 0UL )                                            /*!< Position of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk        ( 0x1UL << TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos ) /*!< Bit mask of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: TIMER_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_START_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_START_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TIMER_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define TIMER_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define TIMER_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define TIMER_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_COUNT */
/* Description: Subscribe configuration for task COUNT */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_COUNT_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_COUNT_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_COUNT_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_COUNT_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TIMER_SUBSCRIBE_COUNT_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task COUNT will subscribe to */
#define TIMER_SUBSCRIBE_COUNT_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_COUNT_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_COUNT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_CLEAR */
/* Description: Subscribe configuration for task CLEAR */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_CLEAR_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_CLEAR_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_CLEAR_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_CLEAR_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TIMER_SUBSCRIBE_CLEAR_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CLEAR will subscribe to */
#define TIMER_SUBSCRIBE_CLEAR_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_CLEAR_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_CLEAR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_SHUTDOWN */
/* Description: Deprecated register - Subscribe configuration for task SHUTDOWN */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_SHUTDOWN_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

