FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 7..0 : DPPI channel that task SHUTDOWN will subscribe to */
#define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_CAPTURE */
/* Description: Description collection: Subscribe configuration for task CAPTURE[n] */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_CAPTURE_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CAPTURE[n] will subscribe to */
#define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_CAPTURE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match */

/* Bit 0 : Compare event on CC[n] match */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos             ( 0UL )                                              /*!< Position of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk             ( 0x1UL << TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos ) /*!< Bit mask of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: TIMER_PUBLISH_COMPARE */
/* Description: Description collection: Publish configuration for event COMPARE[n] */

/* Bit 31 :   */
#define TIMER_PUBLISH_COMPARE_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_PUBLISH_COMPARE_EN_Msk         ( 0x1UL << TIMER_PUBLISH_COMPARE_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_PUBLISH_COMPARE_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define TIMER_PUBLISH_COMPARE_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event COMPARE[n] will publish to. */
#define TIMER_PUBLISH_COMPARE_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_PUBLISH_COMPARE_CHIDX_Msk      ( 0xFFUL << TIMER_PUBLISH_COMPARE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 21 : Shortcut between event COMPARE[5] and task STOP */
#define TIMER_SHORTS_COMPARE5_STOP_Pos          ( 21UL )                                    /*!< Position of COMPARE5_STOP field. */
#define TIMER_SHORTS_COMPARE5_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE5_STOP_Pos ) /*!< Bit mask of COMPARE5_STOP field. */
#define TIMER_SHORTS_COMPARE5_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE5_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 20 : Shortcut between event COMPARE[4] and task STOP */
#define TIMER_SHORTS_COMPARE4_STOP_Pos          ( 20UL )                                    /*!< Position of COMPARE4_STOP field. */
#define TIMER_SHORTS_COMPARE4_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE4_STOP_Pos ) /*!< Bit mask of COMPARE4_STOP field. */
#define TIMER_SHORTS_COMPARE4_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE4_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 19 : Shortcut between event COMPARE[3] and task STOP */
#define TIMER_SHORTS_COMPARE3_STOP_Pos          ( 19UL )                                    /*!< Position of COMPARE3_STOP field. */
#define TIMER_SHORTS_COMPARE3_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE3_STOP_Pos ) /*!< Bit mask of COMPARE3_STOP field. */
#define TIMER_SHORTS_COMPARE3_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE3_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 18 : Shortcut between event COMPARE[2] and task STOP */
#define TIMER_SHORTS_COMPARE2_STOP_Pos          ( 18UL )                                    /*!< Position of COMPARE2_STOP field. */
#define TIMER_SHORTS_COMPARE2_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE2_STOP_Pos ) /*!< Bit mask of COMPARE2_STOP field. */
#define TIMER_SHORTS_COMPARE2_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE2_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 17 : Shortcut between event COMPARE[1] and task STOP */
#define TIMER_SHORTS_COMPARE1_STOP_Pos          ( 17UL )                                    /*!< Position of COMPARE1_STOP field. */
#define TIMER_SHORTS_COMPARE1_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE1_STOP_Pos ) /*!< Bit mask of COMPARE1_STOP field. */
#define TIMER_SHORTS_COMPARE1_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE1_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 16 : Shortcut between event COMPARE[0] and task STOP */
#define TIMER_SHORTS_COMPARE0_STOP_Pos          ( 16UL )                                    /*!< Position of COMPARE0_STOP field. */
#define TIMER_SHORTS_COMPARE0_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE0_STOP_Pos ) /*!< Bit mask of COMPARE0_STOP field. */
#define TIMER_SHORTS_COMPARE0_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE0_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
#define TIMER_SHORTS_COMPARE5_CLEAR_Pos         ( 5UL )                                      /*!< Position of COMPARE5_CLEAR field. */
#define TIMER_SHORTS_COMPARE5_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE5_CLEAR_Pos ) /*!< Bit mask of COMPARE5_CLEAR field. */
#define TIMER_SHORTS_COMPARE5_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE5_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
#define TIMER_SHORTS_COMPARE4_CLEAR_Pos         ( 4UL )                                      /*!< Position of COMPARE4_CLEAR field. */
#define TIMER_SHORTS_COMPARE4_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE4_CLEAR_Pos ) /*!< Bit mask of COMPARE4_CLEAR field. */
#define TIMER_SHORTS_COMPARE4_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE4_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
#define TIMER_SHORTS_COMPARE3_CLEAR_Pos         ( 3UL )                                      /*!< Position of COMPARE3_CLEAR field. */
#define TIMER_SHORTS_COMPARE3_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE3_CLEAR_Pos ) /*!< Bit mask of COMPARE3_CLEAR field. */
#define TIMER_SHORTS_COMPARE3_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE3_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

