FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 20 : Write '1' to disable interrupt for event COMPARE[4] */
#define TIMER_INTENCLR_COMPARE4_Pos         ( 20UL )                                 /*!< Position of COMPARE4 field. */
#define TIMER_INTENCLR_COMPARE4_Msk         ( 0x1UL << TIMER_INTENCLR_COMPARE4_Pos ) /*!< Bit mask of COMPARE4 field. */
#define TIMER_INTENCLR_COMPARE4_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENCLR_COMPARE4_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENCLR_COMPARE4_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event COMPARE[3] */
#define TIMER_INTENCLR_COMPARE3_Pos         ( 19UL )                                 /*!< Position of COMPARE3 field. */
#define TIMER_INTENCLR_COMPARE3_Msk         ( 0x1UL << TIMER_INTENCLR_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define TIMER_INTENCLR_COMPARE3_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENCLR_COMPARE3_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENCLR_COMPARE3_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event COMPARE[2] */
#define TIMER_INTENCLR_COMPARE2_Pos         ( 18UL )                                 /*!< Position of COMPARE2 field. */
#define TIMER_INTENCLR_COMPARE2_Msk         ( 0x1UL << TIMER_INTENCLR_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define TIMER_INTENCLR_COMPARE2_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENCLR_COMPARE2_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENCLR_COMPARE2_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event COMPARE[1] */
#define TIMER_INTENCLR_COMPARE1_Pos         ( 17UL )                                 /*!< Position of COMPARE1 field. */
#define TIMER_INTENCLR_COMPARE1_Msk         ( 0x1UL << TIMER_INTENCLR_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define TIMER_INTENCLR_COMPARE1_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENCLR_COMPARE1_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENCLR_COMPARE1_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 16 : Write '1' to disable interrupt for event COMPARE[0] */
#define TIMER_INTENCLR_COMPARE0_Pos         ( 16UL )                                 /*!< Position of COMPARE0 field. */
#define TIMER_INTENCLR_COMPARE0_Msk         ( 0x1UL << TIMER_INTENCLR_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define TIMER_INTENCLR_COMPARE0_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENCLR_COMPARE0_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENCLR_COMPARE0_Clear       ( 1UL )                                  /*!< Disable */

/* Register: TIMER_MODE */
/* Description: Timer mode selection */

/* Bits 1..0 : Timer mode */
#define TIMER_MODE_MODE_Pos                ( 0UL )                          /*!< Position of MODE field. */
#define TIMER_MODE_MODE_Msk                ( 0x3UL << TIMER_MODE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define TIMER_MODE_MODE_Timer              ( 0UL )                          /*!< Select Timer mode */
#define TIMER_MODE_MODE_Counter            ( 1UL )                          /*!< Deprecated enumerator -  Select Counter mode */
#define TIMER_MODE_MODE_LowPowerCounter    ( 2UL )                          /*!< Select Low Power Counter mode */

/* Register: TIMER_BITMODE */
/* Description: Configure the number of bits used by the TIMER */

/* Bits 1..0 : Timer bit width */
#define TIMER_BITMODE_BITMODE_Pos      ( 0UL )                                /*!< Position of BITMODE field. */
#define TIMER_BITMODE_BITMODE_Msk      ( 0x3UL << TIMER_BITMODE_BITMODE_Pos ) /*!< Bit mask of BITMODE field. */
#define TIMER_BITMODE_BITMODE_16Bit    ( 0UL )                                /*!< 16 bit timer bit width */
#define TIMER_BITMODE_BITMODE_08Bit    ( 1UL )                                /*!< 8 bit timer bit width */
#define TIMER_BITMODE_BITMODE_24Bit    ( 2UL )                                /*!< 24 bit timer bit width */
#define TIMER_BITMODE_BITMODE_32Bit    ( 3UL )                                /*!< 32 bit timer bit width */

/* Register: TIMER_PRESCALER */
/* Description: Timer prescaler register */

/* Bits 3..0 : Prescaler value */
#define TIMER_PRESCALER_PRESCALER_Pos    ( 0UL )                                    /*!< Position of PRESCALER field. */
#define TIMER_PRESCALER_PRESCALER_Msk    ( 0xFUL << TIMER_PRESCALER_PRESCALER_Pos ) /*!< Bit mask of PRESCALER field. */

/* Register: TIMER_CC */
/* Description: Description collection: Capture/Compare register n */

/* Bits 31..0 : Capture/Compare value */
#define TIMER_CC_CC_Pos    ( 0UL )                             /*!< Position of CC field. */
#define TIMER_CC_CC_Msk    ( 0xFFFFFFFFUL << TIMER_CC_CC_Pos ) /*!< Bit mask of CC field. */

/* Register: TIMER_ONESHOTEN */
/* Description: Description collection: Enable one-shot operation for Capture/Compare channel n */

/* Bit 0 : Enable one-shot operation */
#define TIMER_ONESHOTEN_ONESHOTEN_Pos        ( 0UL )                                    /*!< Position of ONESHOTEN field. */
#define TIMER_ONESHOTEN_ONESHOTEN_Msk        ( 0x1UL << TIMER_ONESHOTEN_ONESHOTEN_Pos ) /*!< Bit mask of ONESHOTEN field. */
#define TIMER_ONESHOTEN_ONESHOTEN_Disable    ( 0UL )                                    /*!< Disable one-shot operation */
#define TIMER_ONESHOTEN_ONESHOTEN_Enable     ( 1UL )                                    /*!< Enable one-shot operation */


/* Peripheral: TWIM */
/* Description: I2C compatible Two-Wire Master Interface with EasyDMA 0 */

/* Register: TWIM_TASKS_STARTRX */
/* Description: Start TWI receive sequence */

/* Bit 0 : Start TWI receive sequence */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Pos        ( 0UL )                                           /*!< Position of TASKS_STARTRX field. */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Msk        ( 0x1UL << TWIM_TASKS_STARTRX_TASKS_STARTRX_Pos ) /*!< Bit mask of TASKS_STARTRX field. */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: TWIM_TASKS_STARTTX */
/* Description: Start TWI transmit sequence */

/* Bit 0 : Start TWI transmit sequence */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Pos        ( 0UL )                                           /*!< Position of TASKS_STARTTX field. */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Msk        ( 0x1UL << TWIM_TASKS_STARTTX_TASKS_STARTTX_Pos ) /*!< Bit mask of TASKS_STARTTX field. */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: TWIM_TASKS_STOP */
/* Description: Stop TWI transaction. Must be issued while the TWI master is not suspended. */

/* Bit 0 : Stop TWI transaction. Must be issued while the TWI master is not suspended. */
#define TWIM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define TWIM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << TWIM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define TWIM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

