FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: TWIM_TASKS_SUSPEND */
/* Description: Suspend TWI transaction */

/* Bit 0 : Suspend TWI transaction */
#define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos        ( 0UL )                                           /*!< Position of TASKS_SUSPEND field. */
#define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk        ( 0x1UL << TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos ) /*!< Bit mask of TASKS_SUSPEND field. */
#define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: TWIM_TASKS_RESUME */
/* Description: Resume TWI transaction */

/* Bit 0 : Resume TWI transaction */
#define TWIM_TASKS_RESUME_TASKS_RESUME_Pos        ( 0UL )                                         /*!< Position of TASKS_RESUME field. */
#define TWIM_TASKS_RESUME_TASKS_RESUME_Msk        ( 0x1UL << TWIM_TASKS_RESUME_TASKS_RESUME_Pos ) /*!< Bit mask of TASKS_RESUME field. */
#define TWIM_TASKS_RESUME_TASKS_RESUME_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: TWIM_SUBSCRIBE_STARTRX */
/* Description: Subscribe configuration for task STARTRX */

/* Bit 31 :   */
#define TWIM_SUBSCRIBE_STARTRX_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIM_SUBSCRIBE_STARTRX_EN_Msk         ( 0x1UL << TWIM_SUBSCRIBE_STARTRX_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_SUBSCRIBE_STARTRX_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define TWIM_SUBSCRIBE_STARTRX_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTRX will subscribe to */
#define TWIM_SUBSCRIBE_STARTRX_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define TWIM_SUBSCRIBE_STARTRX_CHIDX_Msk      ( 0xFFUL << TWIM_SUBSCRIBE_STARTRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_SUBSCRIBE_STARTTX */
/* Description: Subscribe configuration for task STARTTX */

/* Bit 31 :   */
#define TWIM_SUBSCRIBE_STARTTX_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIM_SUBSCRIBE_STARTTX_EN_Msk         ( 0x1UL << TWIM_SUBSCRIBE_STARTTX_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_SUBSCRIBE_STARTTX_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define TWIM_SUBSCRIBE_STARTTX_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTTX will subscribe to */
#define TWIM_SUBSCRIBE_STARTTX_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define TWIM_SUBSCRIBE_STARTTX_CHIDX_Msk      ( 0xFFUL << TWIM_SUBSCRIBE_STARTTX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define TWIM_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define TWIM_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << TWIM_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define TWIM_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define TWIM_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define TWIM_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << TWIM_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_SUBSCRIBE_SUSPEND */
/* Description: Subscribe configuration for task SUSPEND */

/* Bit 31 :   */
#define TWIM_SUBSCRIBE_SUSPEND_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIM_SUBSCRIBE_SUSPEND_EN_Msk         ( 0x1UL << TWIM_SUBSCRIBE_SUSPEND_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_SUBSCRIBE_SUSPEND_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define TWIM_SUBSCRIBE_SUSPEND_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SUSPEND will subscribe to */
#define TWIM_SUBSCRIBE_SUSPEND_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define TWIM_SUBSCRIBE_SUSPEND_CHIDX_Msk      ( 0xFFUL << TWIM_SUBSCRIBE_SUSPEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_SUBSCRIBE_RESUME */
/* Description: Subscribe configuration for task RESUME */

/* Bit 31 :   */
#define TWIM_SUBSCRIBE_RESUME_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TWIM_SUBSCRIBE_RESUME_EN_Msk         ( 0x1UL << TWIM_SUBSCRIBE_RESUME_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_SUBSCRIBE_RESUME_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TWIM_SUBSCRIBE_RESUME_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RESUME will subscribe to */
#define TWIM_SUBSCRIBE_RESUME_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TWIM_SUBSCRIBE_RESUME_CHIDX_Msk      ( 0xFFUL << TWIM_SUBSCRIBE_RESUME_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_EVENTS_STOPPED */
/* Description: TWI stopped */

/* Bit 0 : TWI stopped */
#define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STOPPED field. */
#define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: TWIM_EVENTS_ERROR */
/* Description: TWI error */

/* Bit 0 : TWI error */
#define TWIM_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                         /*!< Position of EVENTS_ERROR field. */
#define TWIM_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << TWIM_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define TWIM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define TWIM_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: TWIM_EVENTS_SUSPENDED */
/* Description: SUSPEND task has been issued, TWI traffic is now suspended. */

/* Bit 0 : SUSPEND task has been issued, TWI traffic is now suspended. */
#define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Pos             ( 0UL )                                                 /*!< Position of EVENTS_SUSPENDED field. */
#define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Msk             ( 0x1UL << TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Pos ) /*!< Bit mask of EVENTS_SUSPENDED field. */
#define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: TWIM_EVENTS_RXSTARTED */
/* Description: Receive sequence started */

