FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 18 : Enable or disable interrupt for event SUSPENDED */
#define TWIM_INTEN_SUSPENDED_Pos         ( 18UL )                              /*!< Position of SUSPENDED field. */
#define TWIM_INTEN_SUSPENDED_Msk         ( 0x1UL << TWIM_INTEN_SUSPENDED_Pos ) /*!< Bit mask of SUSPENDED field. */
#define TWIM_INTEN_SUSPENDED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIM_INTEN_SUSPENDED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event ERROR */
#define TWIM_INTEN_ERROR_Pos             ( 9UL )                           /*!< Position of ERROR field. */
#define TWIM_INTEN_ERROR_Msk             ( 0x1UL << TWIM_INTEN_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIM_INTEN_ERROR_Disabled        ( 0UL )                           /*!< Disable */
#define TWIM_INTEN_ERROR_Enabled         ( 1UL )                           /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event STOPPED */
#define TWIM_INTEN_STOPPED_Pos           ( 1UL )                             /*!< Position of STOPPED field. */
#define TWIM_INTEN_STOPPED_Msk           ( 0x1UL << TWIM_INTEN_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWIM_INTEN_STOPPED_Disabled      ( 0UL )                             /*!< Disable */
#define TWIM_INTEN_STOPPED_Enabled       ( 1UL )                             /*!< Enable */

/* Register: TWIM_INTENSET */
/* Description: Enable interrupt */

/* Bit 24 : Write '1' to enable interrupt for event LASTTX */
#define TWIM_INTENSET_LASTTX_Pos            ( 24UL )                              /*!< Position of LASTTX field. */
#define TWIM_INTENSET_LASTTX_Msk            ( 0x1UL << TWIM_INTENSET_LASTTX_Pos ) /*!< Bit mask of LASTTX field. */
#define TWIM_INTENSET_LASTTX_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define TWIM_INTENSET_LASTTX_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define TWIM_INTENSET_LASTTX_Set            ( 1UL )                               /*!< Enable */

/* Bit 23 : Write '1' to enable interrupt for event LASTRX */
#define TWIM_INTENSET_LASTRX_Pos            ( 23UL )                              /*!< Position of LASTRX field. */
#define TWIM_INTENSET_LASTRX_Msk            ( 0x1UL << TWIM_INTENSET_LASTRX_Pos ) /*!< Bit mask of LASTRX field. */
#define TWIM_INTENSET_LASTRX_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define TWIM_INTENSET_LASTRX_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define TWIM_INTENSET_LASTRX_Set            ( 1UL )                               /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event TXSTARTED */
#define TWIM_INTENSET_TXSTARTED_Pos         ( 20UL )                                 /*!< Position of TXSTARTED field. */
#define TWIM_INTENSET_TXSTARTED_Msk         ( 0x1UL << TWIM_INTENSET_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define TWIM_INTENSET_TXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIM_INTENSET_TXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIM_INTENSET_TXSTARTED_Set         ( 1UL )                                  /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event RXSTARTED */
#define TWIM_INTENSET_RXSTARTED_Pos         ( 19UL )                                 /*!< Position of RXSTARTED field. */
#define TWIM_INTENSET_RXSTARTED_Msk         ( 0x1UL << TWIM_INTENSET_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define TWIM_INTENSET_RXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIM_INTENSET_RXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIM_INTENSET_RXSTARTED_Set         ( 1UL )                                  /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event SUSPENDED */
#define TWIM_INTENSET_SUSPENDED_Pos         ( 18UL )                                 /*!< Position of SUSPENDED field. */
#define TWIM_INTENSET_SUSPENDED_Msk         ( 0x1UL << TWIM_INTENSET_SUSPENDED_Pos ) /*!< Bit mask of SUSPENDED field. */
#define TWIM_INTENSET_SUSPENDED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIM_INTENSET_SUSPENDED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIM_INTENSET_SUSPENDED_Set         ( 1UL )                                  /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event ERROR */
#define TWIM_INTENSET_ERROR_Pos             ( 9UL )                              /*!< Position of ERROR field. */
#define TWIM_INTENSET_ERROR_Msk             ( 0x1UL << TWIM_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIM_INTENSET_ERROR_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define TWIM_INTENSET_ERROR_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define TWIM_INTENSET_ERROR_Set             ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define TWIM_INTENSET_STOPPED_Pos           ( 1UL )                                /*!< Position of STOPPED field. */
#define TWIM_INTENSET_STOPPED_Msk           ( 0x1UL << TWIM_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWIM_INTENSET_STOPPED_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define TWIM_INTENSET_STOPPED_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define TWIM_INTENSET_STOPPED_Set           ( 1UL )                                /*!< Enable */

/* Register: TWIM_INTENCLR */
/* Description: Disable interrupt */

/* Bit 24 : Write '1' to disable interrupt for event LASTTX */
#define TWIM_INTENCLR_LASTTX_Pos            ( 24UL )                              /*!< Position of LASTTX field. */
#define TWIM_INTENCLR_LASTTX_Msk            ( 0x1UL << TWIM_INTENCLR_LASTTX_Pos ) /*!< Bit mask of LASTTX field. */
#define TWIM_INTENCLR_LASTTX_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define TWIM_INTENCLR_LASTTX_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define TWIM_INTENCLR_LASTTX_Clear          ( 1UL )                               /*!< Disable */

