FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: TWIS_EVENTS_READ */
/* Description: Read command received */

/* Bit 0 : Read command received */
#define TWIS_EVENTS_READ_EVENTS_READ_Pos             ( 0UL )                                       /*!< Position of EVENTS_READ field. */
#define TWIS_EVENTS_READ_EVENTS_READ_Msk             ( 0x1UL << TWIS_EVENTS_READ_EVENTS_READ_Pos ) /*!< Bit mask of EVENTS_READ field. */
#define TWIS_EVENTS_READ_EVENTS_READ_NotGenerated    ( 0UL )                                       /*!< Event not generated */
#define TWIS_EVENTS_READ_EVENTS_READ_Generated       ( 1UL )                                       /*!< Event generated */

/* Register: TWIS_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define TWIS_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define TWIS_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << TWIS_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define TWIS_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define TWIS_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define TWIS_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << TWIS_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_PUBLISH_ERROR */
/* Description: Publish configuration for event ERROR */

/* Bit 31 :   */
#define TWIS_PUBLISH_ERROR_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define TWIS_PUBLISH_ERROR_EN_Msk         ( 0x1UL << TWIS_PUBLISH_ERROR_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_PUBLISH_ERROR_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define TWIS_PUBLISH_ERROR_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ERROR will publish to. */
#define TWIS_PUBLISH_ERROR_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define TWIS_PUBLISH_ERROR_CHIDX_Msk      ( 0xFFUL << TWIS_PUBLISH_ERROR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_PUBLISH_RXSTARTED */
/* Description: Publish configuration for event RXSTARTED */

/* Bit 31 :   */
#define TWIS_PUBLISH_RXSTARTED_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIS_PUBLISH_RXSTARTED_EN_Msk         ( 0x1UL << TWIS_PUBLISH_RXSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_PUBLISH_RXSTARTED_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define TWIS_PUBLISH_RXSTARTED_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RXSTARTED will publish to. */
#define TWIS_PUBLISH_RXSTARTED_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define TWIS_PUBLISH_RXSTARTED_CHIDX_Msk      ( 0xFFUL << TWIS_PUBLISH_RXSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_PUBLISH_TXSTARTED */
/* Description: Publish configuration for event TXSTARTED */

/* Bit 31 :   */
#define TWIS_PUBLISH_TXSTARTED_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIS_PUBLISH_TXSTARTED_EN_Msk         ( 0x1UL << TWIS_PUBLISH_TXSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_PUBLISH_TXSTARTED_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define TWIS_PUBLISH_TXSTARTED_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXSTARTED will publish to. */
#define TWIS_PUBLISH_TXSTARTED_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define TWIS_PUBLISH_TXSTARTED_CHIDX_Msk      ( 0xFFUL << TWIS_PUBLISH_TXSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_PUBLISH_WRITE */
/* Description: Publish configuration for event WRITE */

/* Bit 31 :   */
#define TWIS_PUBLISH_WRITE_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define TWIS_PUBLISH_WRITE_EN_Msk         ( 0x1UL << TWIS_PUBLISH_WRITE_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_PUBLISH_WRITE_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define TWIS_PUBLISH_WRITE_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event WRITE will publish to. */
#define TWIS_PUBLISH_WRITE_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define TWIS_PUBLISH_WRITE_CHIDX_Msk      ( 0xFFUL << TWIS_PUBLISH_WRITE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_PUBLISH_READ */
/* Description: Publish configuration for event READ */

/* Bit 31 :   */
#define TWIS_PUBLISH_READ_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define TWIS_PUBLISH_READ_EN_Msk         ( 0x1UL << TWIS_PUBLISH_READ_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_PUBLISH_READ_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define TWIS_PUBLISH_READ_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event READ will publish to. */
#define TWIS_PUBLISH_READ_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define TWIS_PUBLISH_READ_CHIDX_Msk      ( 0xFFUL << TWIS_PUBLISH_READ_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 14 : Shortcut between event READ and task SUSPEND */
#define TWIS_SHORTS_READ_SUSPEND_Pos          ( 14UL )                                  /*!< Position of READ_SUSPEND field. */
#define TWIS_SHORTS_READ_SUSPEND_Msk          ( 0x1UL << TWIS_SHORTS_READ_SUSPEND_Pos ) /*!< Bit mask of READ_SUSPEND field. */
#define TWIS_SHORTS_READ_SUSPEND_Disabled     ( 0UL )                                   /*!< Disable shortcut */
#define TWIS_SHORTS_READ_SUSPEND_Enabled      ( 1UL )                                   /*!< Enable shortcut */

/* Bit 13 : Shortcut between event WRITE and task SUSPEND */
#define TWIS_SHORTS_WRITE_SUSPEND_Pos         ( 13UL )                                   /*!< Position of WRITE_SUSPEND field. */
#define TWIS_SHORTS_WRITE_SUSPEND_Msk         ( 0x1UL << TWIS_SHORTS_WRITE_SUSPEND_Pos ) /*!< Bit mask of WRITE_SUSPEND field. */
#define TWIS_SHORTS_WRITE_SUSPEND_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define TWIS_SHORTS_WRITE_SUSPEND_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Register: TWIS_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 26 : Enable or disable interrupt for event READ */
#define TWIS_INTEN_READ_Pos              ( 26UL )                         /*!< Position of READ field. */
#define TWIS_INTEN_READ_Msk              ( 0x1UL << TWIS_INTEN_READ_Pos ) /*!< Bit mask of READ field. */
#define TWIS_INTEN_READ_Disabled         ( 0UL )                          /*!< Disable */
#define TWIS_INTEN_READ_Enabled          ( 1UL )                          /*!< Enable */

/* Bit 25 : Enable or disable interrupt for event WRITE */
#define TWIS_INTEN_WRITE_Pos             ( 25UL )                          /*!< Position of WRITE field. */
#define TWIS_INTEN_WRITE_Msk             ( 0x1UL << TWIS_INTEN_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define TWIS_INTEN_WRITE_Disabled        ( 0UL )                           /*!< Disable */
#define TWIS_INTEN_WRITE_Enabled         ( 1UL )                           /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event TXSTARTED */
#define TWIS_INTEN_TXSTARTED_Pos         ( 20UL )                              /*!< Position of TXSTARTED field. */
#define TWIS_INTEN_TXSTARTED_Msk         ( 0x1UL << TWIS_INTEN_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define TWIS_INTEN_TXSTARTED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIS_INTEN_TXSTARTED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event RXSTARTED */
#define TWIS_INTEN_RXSTARTED_Pos         ( 19UL )                              /*!< Position of RXSTARTED field. */
#define TWIS_INTEN_RXSTARTED_Msk         ( 0x1UL << TWIS_INTEN_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define TWIS_INTEN_RXSTARTED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIS_INTEN_RXSTARTED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event ERROR */
#define TWIS_INTEN_ERROR_Pos             ( 9UL )                           /*!< Position of ERROR field. */
#define TWIS_INTEN_ERROR_Msk             ( 0x1UL << TWIS_INTEN_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIS_INTEN_ERROR_Disabled        ( 0UL )                           /*!< Disable */
#define TWIS_INTEN_ERROR_Enabled         ( 1UL )                           /*!< Enable */

