FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: UARTE_EVENTS_ENDRX */
/* Description: Receive buffer is filled up */

/* Bit 0 : Receive buffer is filled up */
#define UARTE_EVENTS_ENDRX_EVENTS_ENDRX_Pos             ( 0UL )                                          /*!< Position of EVENTS_ENDRX field. */
#define UARTE_EVENTS_ENDRX_EVENTS_ENDRX_Msk             ( 0x1UL << UARTE_EVENTS_ENDRX_EVENTS_ENDRX_Pos ) /*!< Bit mask of EVENTS_ENDRX field. */
#define UARTE_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define UARTE_EVENTS_ENDRX_EVENTS_ENDRX_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: UARTE_EVENTS_TXDRDY */
/* Description: Data sent from TXD */

/* Bit 0 : Data sent from TXD */
#define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos             ( 0UL )                                            /*!< Position of EVENTS_TXDRDY field. */
#define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Msk             ( 0x1UL << UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos ) /*!< Bit mask of EVENTS_TXDRDY field. */
#define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: UARTE_EVENTS_ENDTX */
/* Description: Last TX byte transmitted */

/* Bit 0 : Last TX byte transmitted */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Pos             ( 0UL )                                          /*!< Position of EVENTS_ENDTX field. */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Msk             ( 0x1UL << UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Pos ) /*!< Bit mask of EVENTS_ENDTX field. */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: UARTE_EVENTS_ERROR */
/* Description: Error detected */

/* Bit 0 : Error detected */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                          /*!< Position of EVENTS_ERROR field. */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: UARTE_EVENTS_RXTO */
/* Description: Receiver timeout */

/* Bit 0 : Receiver timeout */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos             ( 0UL )                                        /*!< Position of EVENTS_RXTO field. */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_Msk             ( 0x1UL << UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos ) /*!< Bit mask of EVENTS_RXTO field. */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: UARTE_EVENTS_RXSTARTED */
/* Description: UART receiver has started */

/* Bit 0 : UART receiver has started */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos             ( 0UL )                                                  /*!< Position of EVENTS_RXSTARTED field. */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Msk             ( 0x1UL << UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos ) /*!< Bit mask of EVENTS_RXSTARTED field. */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: UARTE_EVENTS_TXSTARTED */
/* Description: UART transmitter has started */

/* Bit 0 : UART transmitter has started */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos             ( 0UL )                                                  /*!< Position of EVENTS_TXSTARTED field. */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Msk             ( 0x1UL << UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos ) /*!< Bit mask of EVENTS_TXSTARTED field. */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: UARTE_EVENTS_TXSTOPPED */
/* Description: Transmitter stopped */

/* Bit 0 : Transmitter stopped */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos             ( 0UL )                                                  /*!< Position of EVENTS_TXSTOPPED field. */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Msk             ( 0x1UL << UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos ) /*!< Bit mask of EVENTS_TXSTOPPED field. */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: UARTE_PUBLISH_CTS */
/* Description: Publish configuration for event CTS */

/* Bit 31 :   */
#define UARTE_PUBLISH_CTS_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define UARTE_PUBLISH_CTS_EN_Msk         ( 0x1UL << UARTE_PUBLISH_CTS_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_CTS_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define UARTE_PUBLISH_CTS_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CTS will publish to. */
#define UARTE_PUBLISH_CTS_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_CTS_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_CTS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_NCTS */
/* Description: Publish configuration for event NCTS */

/* Bit 31 :   */
#define UARTE_PUBLISH_NCTS_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define UARTE_PUBLISH_NCTS_EN_Msk         ( 0x1UL << UARTE_PUBLISH_NCTS_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_NCTS_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define UARTE_PUBLISH_NCTS_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event NCTS will publish to. */
#define UARTE_PUBLISH_NCTS_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_NCTS_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_NCTS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

