FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 31..0 : Data pointer */
#define UARTE_RXD_PTR_PTR_Pos    ( 0UL )                                   /*!< Position of PTR field. */
#define UARTE_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << UARTE_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: UARTE_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 15..0 : Maximum number of bytes in receive buffer */
#define UARTE_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                     /*!< Position of MAXCNT field. */
#define UARTE_RXD_MAXCNT_MAXCNT_Msk    ( 0xFFFFUL << UARTE_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 15..0 : Number of bytes transferred in the last transaction */
#define UARTE_RXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                     /*!< Position of AMOUNT field. */
#define UARTE_RXD_AMOUNT_AMOUNT_Msk    ( 0xFFFFUL << UARTE_RXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_TXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define UARTE_TXD_PTR_PTR_Pos    ( 0UL )                                   /*!< Position of PTR field. */
#define UARTE_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << UARTE_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: UARTE_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 15..0 : Maximum number of bytes in transmit buffer */
#define UARTE_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                     /*!< Position of MAXCNT field. */
#define UARTE_TXD_MAXCNT_MAXCNT_Msk    ( 0xFFFFUL << UARTE_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 15..0 : Number of bytes transferred in the last transaction */
#define UARTE_TXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                     /*!< Position of AMOUNT field. */
#define UARTE_TXD_AMOUNT_AMOUNT_Msk    ( 0xFFFFUL << UARTE_TXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_CONFIG */
/* Description: Configuration of parity and hardware flow control */

/* Bit 8 : Even or odd parity type */
#define UARTE_CONFIG_PARITYTYPE_Pos     ( 8UL )                                  /*!< Position of PARITYTYPE field. */
#define UARTE_CONFIG_PARITYTYPE_Msk     ( 0x1UL << UARTE_CONFIG_PARITYTYPE_Pos ) /*!< Bit mask of PARITYTYPE field. */
#define UARTE_CONFIG_PARITYTYPE_Even    ( 0UL )                                  /*!< Even parity */
#define UARTE_CONFIG_PARITYTYPE_Odd     ( 1UL )                                  /*!< Odd parity */

/* Bit 4 : Stop bits */
#define UARTE_CONFIG_STOP_Pos           ( 4UL )                            /*!< Position of STOP field. */
#define UARTE_CONFIG_STOP_Msk           ( 0x1UL << UARTE_CONFIG_STOP_Pos ) /*!< Bit mask of STOP field. */
#define UARTE_CONFIG_STOP_One           ( 0UL )                            /*!< One stop bit */
#define UARTE_CONFIG_STOP_Two           ( 1UL )                            /*!< Two stop bits */

/* Bits 3..1 : Parity */
#define UARTE_CONFIG_PARITY_Pos         ( 1UL )                              /*!< Position of PARITY field. */
#define UARTE_CONFIG_PARITY_Msk         ( 0x7UL << UARTE_CONFIG_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define UARTE_CONFIG_PARITY_Excluded    ( 0x0UL )                            /*!< Exclude parity bit */
#define UARTE_CONFIG_PARITY_Included    ( 0x7UL )                            /*!< Include even parity bit */

/* Bit 0 : Hardware flow control */
#define UARTE_CONFIG_HWFC_Pos           ( 0UL )                            /*!< Position of HWFC field. */
#define UARTE_CONFIG_HWFC_Msk           ( 0x1UL << UARTE_CONFIG_HWFC_Pos ) /*!< Bit mask of HWFC field. */
#define UARTE_CONFIG_HWFC_Disabled      ( 0UL )                            /*!< Disabled */
#define UARTE_CONFIG_HWFC_Enabled       ( 1UL )                            /*!< Enabled */


/* Peripheral: UICR */
/* Description: User Information Configuration Registers User information configuration registers */

/* Register: UICR_APPROTECT */
/* Description: Access port protection */

/* Bits 31..0 : Blocks debugger read/write access to all CPU registers and
 *        memory mapped addresses. */
#define UICR_APPROTECT_PALL_Pos            ( 0UL )                                     /*!< Position of PALL field. */
#define UICR_APPROTECT_PALL_Msk            ( 0xFFFFFFFFUL << UICR_APPROTECT_PALL_Pos ) /*!< Bit mask of PALL field. */
#define UICR_APPROTECT_PALL_Protected      ( 0x00000000UL )                            /*!< Protected */
#define UICR_APPROTECT_PALL_Unprotected    ( 0x50FA50FAUL )                            /*!< Unprotected */

/* Register: UICR_VREGHVOUT */
/* Description: Output voltage from the high voltage (VREGH) regulator stage. The maximum output voltage from this stage is given as VDDH - VREGHDROP. */

/* Bits 2..0 : VREGH regulator output voltage. */
#define UICR_VREGHVOUT_VREGHVOUT_Pos        ( 0UL )                                   /*!< Position of VREGHVOUT field. */
#define UICR_VREGHVOUT_VREGHVOUT_Msk        ( 0x7UL << UICR_VREGHVOUT_VREGHVOUT_Pos ) /*!< Bit mask of VREGHVOUT field. */
#define UICR_VREGHVOUT_VREGHVOUT_1V8        ( 0UL )                                   /*!< 1.8 V */
#define UICR_VREGHVOUT_VREGHVOUT_2V1        ( 1UL )                                   /*!< 2.1 V */
#define UICR_VREGHVOUT_VREGHVOUT_2V4        ( 2UL )                                   /*!< 2.4 V */
#define UICR_VREGHVOUT_VREGHVOUT_2V7        ( 3UL )                                   /*!< 2.7 V */
#define UICR_VREGHVOUT_VREGHVOUT_3V0        ( 4UL )                                   /*!< 3.0 V */
#define UICR_VREGHVOUT_VREGHVOUT_3V3        ( 5UL )                                   /*!< 3.3 V */
#define UICR_VREGHVOUT_VREGHVOUT_DEFAULT    ( 7UL )                                   /*!< Default voltage: 1.8 V */

/* Register: UICR_HFXOCNT */
/* Description: HFXO startup counter */

/* Bits 7..0 : HFXO startup counter. Total debounce time = HFXOCNT*64 us + 0.5 us */
#define UICR_HFXOCNT_HFXOCNT_Pos                    ( 0UL )                                /*!< Position of HFXOCNT field. */
#define UICR_HFXOCNT_HFXOCNT_Msk                    ( 0xFFUL << UICR_HFXOCNT_HFXOCNT_Pos ) /*!< Bit mask of HFXOCNT field. */
#define UICR_HFXOCNT_HFXOCNT_MinDebounceTime        ( 0UL )                                /*!< Min debounce time = (0*64 us + 0.5 us) */
#define UICR_HFXOCNT_HFXOCNT_MaxDebounceTime        ( 254UL )                              /*!< Max debounce time = (254*64 us + 0.5 us) */
#define UICR_HFXOCNT_HFXOCNT_DefaultDebounceTime    ( 255UL )                              /*!< Default debounce time for erased UICR = 4*64 us + 0.5 us */

