FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: UICR_SECUREAPPROTECT */
/* Description: Secure access port protection */

/* Bits 31..0 : Blocks debugger read/write access to all secure CPU registers and secure memory
 *      mapped addresses. */
#define UICR_SECUREAPPROTECT_PALL_Pos            ( 0UL )                                           /*!< Position of PALL field. */
#define UICR_SECUREAPPROTECT_PALL_Msk            ( 0xFFFFFFFFUL << UICR_SECUREAPPROTECT_PALL_Pos ) /*!< Bit mask of PALL field. */
#define UICR_SECUREAPPROTECT_PALL_Protected      ( 0x00000000UL )                                  /*!< Protected */
#define UICR_SECUREAPPROTECT_PALL_Unprotected    ( 0x50FA50FAUL )                                  /*!< Unprotected */

/* Register: UICR_ERASEPROTECT */
/* Description: Erase protection */

/* Bits 31..0 : Blocks NVMC ERASEALL and CTRLAP ERASEALL functionality. Using any value except Unprotected will lead to the protection being enabled. */
#define UICR_ERASEPROTECT_PALL_Pos            ( 0UL )                                        /*!< Position of PALL field. */
#define UICR_ERASEPROTECT_PALL_Msk            ( 0xFFFFFFFFUL << UICR_ERASEPROTECT_PALL_Pos ) /*!< Bit mask of PALL field. */
#define UICR_ERASEPROTECT_PALL_Protected      ( 0x00000000UL )                               /*!< Protected */
#define UICR_ERASEPROTECT_PALL_Unprotected    ( 0xFFFFFFFFUL )                               /*!< Unprotected */

/* Register: UICR_TINSTANCE */
/* Description: SW-DP Target instance */

/* Bits 31..28 : TINSTANCE bits are negated and used in the SW-DP DLPIDR.TINSTANCE field. E.g. 0xF in this field is translated to 0x0 in DLPIDR.TINSTANCE field. */
#define UICR_TINSTANCE_TINSTANCE_Pos    ( 28UL )                                  /*!< Position of TINSTANCE field. */
#define UICR_TINSTANCE_TINSTANCE_Msk    ( 0xFUL << UICR_TINSTANCE_TINSTANCE_Pos ) /*!< Bit mask of TINSTANCE field. */

/* Register: UICR_NFCPINS */
/* Description: Setting of pins dedicated to NFC functionality: NFC antenna or GPIO */

/* Bit 0 : Setting of pins dedicated to NFC functionality */
#define UICR_NFCPINS_PROTECT_Pos         ( 0UL )                               /*!< Position of PROTECT field. */
#define UICR_NFCPINS_PROTECT_Msk         ( 0x1UL << UICR_NFCPINS_PROTECT_Pos ) /*!< Bit mask of PROTECT field. */
#define UICR_NFCPINS_PROTECT_Disabled    ( 0UL )                               /*!< Operation as GPIO pins. Same protection as normal GPIO pins */
#define UICR_NFCPINS_PROTECT_NFC         ( 1UL )                               /*!< Operation as NFC antenna pins. Configures the protection for NFC operation */

/* Register: UICR_OTP */
/* Description: Description collection: One time programmable memory */

/* Bits 31..16 : Upper half word */
#define UICR_OTP_UPPER_Pos    ( 16UL )                           /*!< Position of UPPER field. */
#define UICR_OTP_UPPER_Msk    ( 0xFFFFUL << UICR_OTP_UPPER_Pos ) /*!< Bit mask of UPPER field. */

/* Bits 15..0 : Lower half word */
#define UICR_OTP_LOWER_Pos    ( 0UL )                            /*!< Position of LOWER field. */
#define UICR_OTP_LOWER_Msk    ( 0xFFFFUL << UICR_OTP_LOWER_Pos ) /*!< Bit mask of LOWER field. */

/* Register: UICR_KEYSLOT_CONFIG_DEST */

/* Description: Description cluster: Destination address where content of the key value registers (KEYSLOT.KEYn.VALUE[0-3])
 *        will be pushed by KMU. Note that this address must match that of a peripherals
 *        APB mapped write-only key registers, else the KMU can push this key value into
 *        an address range which the CPU can potentially read. */

/* Bits 31..0 : Secure APB destination address */
#define UICR_KEYSLOT_CONFIG_DEST_DEST_Pos    ( 0UL )                                               /*!< Position of DEST field. */
#define UICR_KEYSLOT_CONFIG_DEST_DEST_Msk    ( 0xFFFFFFFFUL << UICR_KEYSLOT_CONFIG_DEST_DEST_Pos ) /*!< Bit mask of DEST field. */

/* Register: UICR_KEYSLOT_CONFIG_PERM */
/* Description: Description cluster: Define permissions for the key slot. Bits 0-15 and 16-31 can only be written when equal to 0xFFFF. */

/* Bit 16 : Revocation state for the key slot */
#define UICR_KEYSLOT_CONFIG_PERM_STATE_Pos         ( 16UL )                                        /*!< Position of STATE field. */
#define UICR_KEYSLOT_CONFIG_PERM_STATE_Msk         ( 0x1UL << UICR_KEYSLOT_CONFIG_PERM_STATE_Pos ) /*!< Bit mask of STATE field. */
#define UICR_KEYSLOT_CONFIG_PERM_STATE_Revoked     ( 0UL )                                         /*!< Key value registers can no longer be read or pushed */
#define UICR_KEYSLOT_CONFIG_PERM_STATE_Active      ( 1UL )                                         /*!< Key value registers are readable (if enabled) and can be pushed (if enabled) */

/* Bit 2 : Push permission for key slot */
#define UICR_KEYSLOT_CONFIG_PERM_PUSH_Pos          ( 2UL )                                        /*!< Position of PUSH field. */
#define UICR_KEYSLOT_CONFIG_PERM_PUSH_Msk          ( 0x1UL << UICR_KEYSLOT_CONFIG_PERM_PUSH_Pos ) /*!< Bit mask of PUSH field. */
#define UICR_KEYSLOT_CONFIG_PERM_PUSH_Disabled     ( 0UL )                                        /*!< Disable pushing of key value registers over secure APB, but can be read if field READ is Enabled */
#define UICR_KEYSLOT_CONFIG_PERM_PUSH_Enabled      ( 1UL )                                        /*!< Enable pushing of key value registers over secure APB. Register KEYSLOT.CONFIGn.DEST must contain a valid destination address! */

/* Bit 1 : Read permission for key slot */
#define UICR_KEYSLOT_CONFIG_PERM_READ_Pos          ( 1UL )                                        /*!< Position of READ field. */
#define UICR_KEYSLOT_CONFIG_PERM_READ_Msk          ( 0x1UL << UICR_KEYSLOT_CONFIG_PERM_READ_Pos ) /*!< Bit mask of READ field. */
#define UICR_KEYSLOT_CONFIG_PERM_READ_Disabled     ( 0UL )                                        /*!< Disable read from key value registers */
#define UICR_KEYSLOT_CONFIG_PERM_READ_Enabled      ( 1UL )                                        /*!< Enable read from key value registers */

