FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: USBD_SUBSCRIBE_STARTISOIN */
/* Description: Subscribe configuration for task STARTISOIN */

/* Bit 31 :   */
#define USBD_SUBSCRIBE_STARTISOIN_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define USBD_SUBSCRIBE_STARTISOIN_EN_Msk         ( 0x1UL << USBD_SUBSCRIBE_STARTISOIN_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_SUBSCRIBE_STARTISOIN_EN_Disabled    ( 0UL )                                       /*!< Disable subscription */
#define USBD_SUBSCRIBE_STARTISOIN_EN_Enabled     ( 1UL )                                       /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTISOIN will subscribe to */
#define USBD_SUBSCRIBE_STARTISOIN_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define USBD_SUBSCRIBE_STARTISOIN_CHIDX_Msk      ( 0xFFUL << USBD_SUBSCRIBE_STARTISOIN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SUBSCRIBE_STARTEPOUT */
/* Description: Description collection: Subscribe configuration for task STARTEPOUT[n] */

/* Bit 31 :   */
#define USBD_SUBSCRIBE_STARTEPOUT_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define USBD_SUBSCRIBE_STARTEPOUT_EN_Msk         ( 0x1UL << USBD_SUBSCRIBE_STARTEPOUT_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_SUBSCRIBE_STARTEPOUT_EN_Disabled    ( 0UL )                                       /*!< Disable subscription */
#define USBD_SUBSCRIBE_STARTEPOUT_EN_Enabled     ( 1UL )                                       /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTEPOUT[n] will subscribe to */
#define USBD_SUBSCRIBE_STARTEPOUT_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define USBD_SUBSCRIBE_STARTEPOUT_CHIDX_Msk      ( 0xFFUL << USBD_SUBSCRIBE_STARTEPOUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SUBSCRIBE_STARTISOOUT */
/* Description: Subscribe configuration for task STARTISOOUT */

/* Bit 31 :   */
#define USBD_SUBSCRIBE_STARTISOOUT_EN_Pos         ( 31UL )                                       /*!< Position of EN field. */
#define USBD_SUBSCRIBE_STARTISOOUT_EN_Msk         ( 0x1UL << USBD_SUBSCRIBE_STARTISOOUT_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_SUBSCRIBE_STARTISOOUT_EN_Disabled    ( 0UL )                                        /*!< Disable subscription */
#define USBD_SUBSCRIBE_STARTISOOUT_EN_Enabled     ( 1UL )                                        /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTISOOUT will subscribe to */
#define USBD_SUBSCRIBE_STARTISOOUT_CHIDX_Pos      ( 0UL )                                            /*!< Position of CHIDX field. */
#define USBD_SUBSCRIBE_STARTISOOUT_CHIDX_Msk      ( 0xFFUL << USBD_SUBSCRIBE_STARTISOOUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SUBSCRIBE_EP0RCVOUT */
/* Description: Subscribe configuration for task EP0RCVOUT */

/* Bit 31 :   */
#define USBD_SUBSCRIBE_EP0RCVOUT_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define USBD_SUBSCRIBE_EP0RCVOUT_EN_Msk         ( 0x1UL << USBD_SUBSCRIBE_EP0RCVOUT_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_SUBSCRIBE_EP0RCVOUT_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define USBD_SUBSCRIBE_EP0RCVOUT_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task EP0RCVOUT will subscribe to */
#define USBD_SUBSCRIBE_EP0RCVOUT_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define USBD_SUBSCRIBE_EP0RCVOUT_CHIDX_Msk      ( 0xFFUL << USBD_SUBSCRIBE_EP0RCVOUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SUBSCRIBE_EP0STATUS */
/* Description: Subscribe configuration for task EP0STATUS */

/* Bit 31 :   */
#define USBD_SUBSCRIBE_EP0STATUS_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define USBD_SUBSCRIBE_EP0STATUS_EN_Msk         ( 0x1UL << USBD_SUBSCRIBE_EP0STATUS_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_SUBSCRIBE_EP0STATUS_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define USBD_SUBSCRIBE_EP0STATUS_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task EP0STATUS will subscribe to */
#define USBD_SUBSCRIBE_EP0STATUS_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define USBD_SUBSCRIBE_EP0STATUS_CHIDX_Msk      ( 0xFFUL << USBD_SUBSCRIBE_EP0STATUS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SUBSCRIBE_EP0STALL */
/* Description: Subscribe configuration for task EP0STALL */

/* Bit 31 :   */
#define USBD_SUBSCRIBE_EP0STALL_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define USBD_SUBSCRIBE_EP0STALL_EN_Msk         ( 0x1UL << USBD_SUBSCRIBE_EP0STALL_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_SUBSCRIBE_EP0STALL_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define USBD_SUBSCRIBE_EP0STALL_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task EP0STALL will subscribe to */
#define USBD_SUBSCRIBE_EP0STALL_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define USBD_SUBSCRIBE_EP0STALL_CHIDX_Msk      ( 0xFFUL << USBD_SUBSCRIBE_EP0STALL_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SUBSCRIBE_DPDMDRIVE */
/* Description: Subscribe configuration for task DPDMDRIVE */

/* Bit 31 :   */
#define USBD_SUBSCRIBE_DPDMDRIVE_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define USBD_SUBSCRIBE_DPDMDRIVE_EN_Msk         ( 0x1UL << USBD_SUBSCRIBE_DPDMDRIVE_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_SUBSCRIBE_DPDMDRIVE_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define USBD_SUBSCRIBE_DPDMDRIVE_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

