FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: USBD_EVENTS_ENDISOOUT */
/* Description: The whole ISOOUT buffer has been consumed. The buffer can be accessed safely by software. */

/* Bit 0 : The whole ISOOUT buffer has been consumed. The buffer can be accessed safely by software. */
#define USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT_Pos             ( 0UL )                                                 /*!< Position of EVENTS_ENDISOOUT field. */
#define USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT_Msk             ( 0x1UL << USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT_Pos ) /*!< Bit mask of EVENTS_ENDISOOUT field. */
#define USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: USBD_EVENTS_SOF */
/* Description: Signals that a SOF (start of frame) condition has been detected on USB lines */

/* Bit 0 : Signals that a SOF (start of frame) condition has been detected on USB lines */
#define USBD_EVENTS_SOF_EVENTS_SOF_Pos             ( 0UL )                                     /*!< Position of EVENTS_SOF field. */
#define USBD_EVENTS_SOF_EVENTS_SOF_Msk             ( 0x1UL << USBD_EVENTS_SOF_EVENTS_SOF_Pos ) /*!< Bit mask of EVENTS_SOF field. */
#define USBD_EVENTS_SOF_EVENTS_SOF_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define USBD_EVENTS_SOF_EVENTS_SOF_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: USBD_EVENTS_USBEVENT */
/* Description: An event or an error not covered by specific events has occurred. Check EVENTCAUSE register to find the cause. */

/* Bit 0 : An event or an error not covered by specific events has occurred. Check EVENTCAUSE register to find the cause. */
#define USBD_EVENTS_USBEVENT_EVENTS_USBEVENT_Pos             ( 0UL )                                               /*!< Position of EVENTS_USBEVENT field. */
#define USBD_EVENTS_USBEVENT_EVENTS_USBEVENT_Msk             ( 0x1UL << USBD_EVENTS_USBEVENT_EVENTS_USBEVENT_Pos ) /*!< Bit mask of EVENTS_USBEVENT field. */
#define USBD_EVENTS_USBEVENT_EVENTS_USBEVENT_NotGenerated    ( 0UL )                                               /*!< Event not generated */
#define USBD_EVENTS_USBEVENT_EVENTS_USBEVENT_Generated       ( 1UL )                                               /*!< Event generated */

/* Register: USBD_EVENTS_EP0SETUP */
/* Description: A valid SETUP token has been received (and acknowledged) on the control endpoint */

/* Bit 0 : A valid SETUP token has been received (and acknowledged) on the control endpoint */
#define USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP_Pos             ( 0UL )                                               /*!< Position of EVENTS_EP0SETUP field. */
#define USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP_Msk             ( 0x1UL << USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP_Pos ) /*!< Bit mask of EVENTS_EP0SETUP field. */
#define USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP_NotGenerated    ( 0UL )                                               /*!< Event not generated */
#define USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP_Generated       ( 1UL )                                               /*!< Event generated */

/* Register: USBD_EVENTS_EPDATA */
/* Description: A data transfer has occurred on a data endpoint, indicated by the EPDATASTATUS register */

/* Bit 0 : A data transfer has occurred on a data endpoint, indicated by the EPDATASTATUS register */
#define USBD_EVENTS_EPDATA_EVENTS_EPDATA_Pos             ( 0UL )                                           /*!< Position of EVENTS_EPDATA field. */
#define USBD_EVENTS_EPDATA_EVENTS_EPDATA_Msk             ( 0x1UL << USBD_EVENTS_EPDATA_EVENTS_EPDATA_Pos ) /*!< Bit mask of EVENTS_EPDATA field. */
#define USBD_EVENTS_EPDATA_EVENTS_EPDATA_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define USBD_EVENTS_EPDATA_EVENTS_EPDATA_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: USBD_PUBLISH_USBRESET */
/* Description: Publish configuration for event USBRESET */

/* Bit 31 :   */
#define USBD_PUBLISH_USBRESET_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define USBD_PUBLISH_USBRESET_EN_Msk         ( 0x1UL << USBD_PUBLISH_USBRESET_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_USBRESET_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define USBD_PUBLISH_USBRESET_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event USBRESET will publish to. */
#define USBD_PUBLISH_USBRESET_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define USBD_PUBLISH_USBRESET_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_USBRESET_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_STARTED */
/* Description: Publish configuration for event STARTED */

/* Bit 31 :   */
#define USBD_PUBLISH_STARTED_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define USBD_PUBLISH_STARTED_EN_Msk         ( 0x1UL << USBD_PUBLISH_STARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_STARTED_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define USBD_PUBLISH_STARTED_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STARTED will publish to. */
#define USBD_PUBLISH_STARTED_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define USBD_PUBLISH_STARTED_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_STARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_ENDEPIN */
/* Description: Description collection: Publish configuration for event ENDEPIN[n] */

/* Bit 31 :   */
#define USBD_PUBLISH_ENDEPIN_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define USBD_PUBLISH_ENDEPIN_EN_Msk         ( 0x1UL << USBD_PUBLISH_ENDEPIN_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_ENDEPIN_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define USBD_PUBLISH_ENDEPIN_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

