FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 7..0 : DPPI channel that event ENDEPIN[n] will publish to. */
#define USBD_PUBLISH_ENDEPIN_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ENDEPIN_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_ENDEPIN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_EP0DATADONE */
/* Description: Publish configuration for event EP0DATADONE */

/* Bit 31 :   */
#define USBD_PUBLISH_EP0DATADONE_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define USBD_PUBLISH_EP0DATADONE_EN_Msk         ( 0x1UL << USBD_PUBLISH_EP0DATADONE_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_EP0DATADONE_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define USBD_PUBLISH_EP0DATADONE_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event EP0DATADONE will publish to. */
#define USBD_PUBLISH_EP0DATADONE_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define USBD_PUBLISH_EP0DATADONE_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_EP0DATADONE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_ENDISOIN */
/* Description: Publish configuration for event ENDISOIN */

/* Bit 31 :   */
#define USBD_PUBLISH_ENDISOIN_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define USBD_PUBLISH_ENDISOIN_EN_Msk         ( 0x1UL << USBD_PUBLISH_ENDISOIN_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_ENDISOIN_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define USBD_PUBLISH_ENDISOIN_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDISOIN will publish to. */
#define USBD_PUBLISH_ENDISOIN_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ENDISOIN_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_ENDISOIN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_ENDEPOUT */
/* Description: Description collection: Publish configuration for event ENDEPOUT[n] */

/* Bit 31 :   */
#define USBD_PUBLISH_ENDEPOUT_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define USBD_PUBLISH_ENDEPOUT_EN_Msk         ( 0x1UL << USBD_PUBLISH_ENDEPOUT_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_ENDEPOUT_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define USBD_PUBLISH_ENDEPOUT_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDEPOUT[n] will publish to. */
#define USBD_PUBLISH_ENDEPOUT_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ENDEPOUT_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_ENDEPOUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_ENDISOOUT */
/* Description: Publish configuration for event ENDISOOUT */

/* Bit 31 :   */
#define USBD_PUBLISH_ENDISOOUT_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define USBD_PUBLISH_ENDISOOUT_EN_Msk         ( 0x1UL << USBD_PUBLISH_ENDISOOUT_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_ENDISOOUT_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define USBD_PUBLISH_ENDISOOUT_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDISOOUT will publish to. */
#define USBD_PUBLISH_ENDISOOUT_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ENDISOOUT_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_ENDISOOUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_SOF */
/* Description: Publish configuration for event SOF */

/* Bit 31 :   */
#define USBD_PUBLISH_SOF_EN_Pos         ( 31UL )                             /*!< Position of EN field. */
#define USBD_PUBLISH_SOF_EN_Msk         ( 0x1UL << USBD_PUBLISH_SOF_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_SOF_EN_Disabled    ( 0UL )                              /*!< Disable publishing */
#define USBD_PUBLISH_SOF_EN_Enabled     ( 1UL )                              /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SOF will publish to. */
#define USBD_PUBLISH_SOF_CHIDX_Pos      ( 0UL )                                  /*!< Position of CHIDX field. */
#define USBD_PUBLISH_SOF_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_SOF_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_USBEVENT */
/* Description: Publish configuration for event USBEVENT */

/* Bit 31 :   */
#define USBD_PUBLISH_USBEVENT_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define USBD_PUBLISH_USBEVENT_EN_Msk         ( 0x1UL << USBD_PUBLISH_USBEVENT_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_USBEVENT_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define USBD_PUBLISH_USBEVENT_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event USBEVENT will publish to. */
#define USBD_PUBLISH_USBEVENT_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define USBD_PUBLISH_USBEVENT_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_USBEVENT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_EP0SETUP */
/* Description: Publish configuration for event EP0SETUP */

/* Bit 31 :   */
#define USBD_PUBLISH_EP0SETUP_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define USBD_PUBLISH_EP0SETUP_EN_Msk         ( 0x1UL << USBD_PUBLISH_EP0SETUP_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_EP0SETUP_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define USBD_PUBLISH_EP0SETUP_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

