FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 7..0 : DPPI channel that event EP0SETUP will publish to. */
#define USBD_PUBLISH_EP0SETUP_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define USBD_PUBLISH_EP0SETUP_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_EP0SETUP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_EPDATA */
/* Description: Publish configuration for event EPDATA */

/* Bit 31 :   */
#define USBD_PUBLISH_EPDATA_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define USBD_PUBLISH_EPDATA_EN_Msk         ( 0x1UL << USBD_PUBLISH_EPDATA_EN_Pos ) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_EPDATA_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define USBD_PUBLISH_EPDATA_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event EPDATA will publish to. */
#define USBD_PUBLISH_EPDATA_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define USBD_PUBLISH_EPDATA_CHIDX_Msk      ( 0xFFUL << USBD_PUBLISH_EPDATA_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 4 : Shortcut between event ENDEPOUT[0] and task EP0RCVOUT */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Pos             ( 4UL )                                          /*!< Position of ENDEPOUT0_EP0RCVOUT field. */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Msk             ( 0x1UL << USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Pos ) /*!< Bit mask of ENDEPOUT0_EP0RCVOUT field. */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Disabled        ( 0UL )                                          /*!< Disable shortcut */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Enabled         ( 1UL )                                          /*!< Enable shortcut */

/* Bit 3 : Shortcut between event ENDEPOUT[0] and task EP0STATUS */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Pos             ( 3UL )                                          /*!< Position of ENDEPOUT0_EP0STATUS field. */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Msk             ( 0x1UL << USBD_SHORTS_ENDEPOUT0_EP0STATUS_Pos ) /*!< Bit mask of ENDEPOUT0_EP0STATUS field. */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Disabled        ( 0UL )                                          /*!< Disable shortcut */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Enabled         ( 1UL )                                          /*!< Enable shortcut */

/* Bit 2 : Shortcut between event EP0DATADONE and task EP0STATUS */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Pos           ( 2UL )                                            /*!< Position of EP0DATADONE_EP0STATUS field. */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Msk           ( 0x1UL << USBD_SHORTS_EP0DATADONE_EP0STATUS_Pos ) /*!< Bit mask of EP0DATADONE_EP0STATUS field. */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Disabled      ( 0UL )                                            /*!< Disable shortcut */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Enabled       ( 1UL )                                            /*!< Enable shortcut */

/* Bit 1 : Shortcut between event EP0DATADONE and task STARTEPOUT[0] */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Pos         ( 1UL )                                              /*!< Position of EP0DATADONE_STARTEPOUT0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Msk         ( 0x1UL << USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Pos ) /*!< Bit mask of EP0DATADONE_STARTEPOUT0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Disabled    ( 0UL )                                              /*!< Disable shortcut */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Enabled     ( 1UL )                                              /*!< Enable shortcut */

/* Bit 0 : Shortcut between event EP0DATADONE and task STARTEPIN[0] */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Pos          ( 0UL )                                             /*!< Position of EP0DATADONE_STARTEPIN0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Msk          ( 0x1UL << USBD_SHORTS_EP0DATADONE_STARTEPIN0_Pos ) /*!< Bit mask of EP0DATADONE_STARTEPIN0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Disabled     ( 0UL )                                             /*!< Disable shortcut */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Enabled      ( 1UL )                                             /*!< Enable shortcut */

/* Register: USBD_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 24 : Enable or disable interrupt for event EPDATA */
#define USBD_INTEN_EPDATA_Pos              ( 24UL )                           /*!< Position of EPDATA field. */
#define USBD_INTEN_EPDATA_Msk              ( 0x1UL << USBD_INTEN_EPDATA_Pos ) /*!< Bit mask of EPDATA field. */
#define USBD_INTEN_EPDATA_Disabled         ( 0UL )                            /*!< Disable */
#define USBD_INTEN_EPDATA_Enabled          ( 1UL )                            /*!< Enable */

/* Bit 23 : Enable or disable interrupt for event EP0SETUP */
#define USBD_INTEN_EP0SETUP_Pos            ( 23UL )                             /*!< Position of EP0SETUP field. */
#define USBD_INTEN_EP0SETUP_Msk            ( 0x1UL << USBD_INTEN_EP0SETUP_Pos ) /*!< Bit mask of EP0SETUP field. */
#define USBD_INTEN_EP0SETUP_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_EP0SETUP_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 22 : Enable or disable interrupt for event USBEVENT */
#define USBD_INTEN_USBEVENT_Pos            ( 22UL )                             /*!< Position of USBEVENT field. */
#define USBD_INTEN_USBEVENT_Msk            ( 0x1UL << USBD_INTEN_USBEVENT_Pos ) /*!< Bit mask of USBEVENT field. */
#define USBD_INTEN_USBEVENT_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_USBEVENT_Enabled        ( 1UL )                              /*!< Enable */

