FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 21 : Enable or disable interrupt for event SOF */
#define USBD_INTEN_SOF_Pos                 ( 21UL )                        /*!< Position of SOF field. */
#define USBD_INTEN_SOF_Msk                 ( 0x1UL << USBD_INTEN_SOF_Pos ) /*!< Bit mask of SOF field. */
#define USBD_INTEN_SOF_Disabled            ( 0UL )                         /*!< Disable */
#define USBD_INTEN_SOF_Enabled             ( 1UL )                         /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event ENDISOOUT */
#define USBD_INTEN_ENDISOOUT_Pos           ( 20UL )                              /*!< Position of ENDISOOUT field. */
#define USBD_INTEN_ENDISOOUT_Msk           ( 0x1UL << USBD_INTEN_ENDISOOUT_Pos ) /*!< Bit mask of ENDISOOUT field. */
#define USBD_INTEN_ENDISOOUT_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDISOOUT_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event ENDEPOUT[7] */
#define USBD_INTEN_ENDEPOUT7_Pos           ( 19UL )                              /*!< Position of ENDEPOUT7 field. */
#define USBD_INTEN_ENDEPOUT7_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT7_Pos ) /*!< Bit mask of ENDEPOUT7 field. */
#define USBD_INTEN_ENDEPOUT7_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT7_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 18 : Enable or disable interrupt for event ENDEPOUT[6] */
#define USBD_INTEN_ENDEPOUT6_Pos           ( 18UL )                              /*!< Position of ENDEPOUT6 field. */
#define USBD_INTEN_ENDEPOUT6_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT6_Pos ) /*!< Bit mask of ENDEPOUT6 field. */
#define USBD_INTEN_ENDEPOUT6_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT6_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 17 : Enable or disable interrupt for event ENDEPOUT[5] */
#define USBD_INTEN_ENDEPOUT5_Pos           ( 17UL )                              /*!< Position of ENDEPOUT5 field. */
#define USBD_INTEN_ENDEPOUT5_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT5_Pos ) /*!< Bit mask of ENDEPOUT5 field. */
#define USBD_INTEN_ENDEPOUT5_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT5_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 16 : Enable or disable interrupt for event ENDEPOUT[4] */
#define USBD_INTEN_ENDEPOUT4_Pos           ( 16UL )                              /*!< Position of ENDEPOUT4 field. */
#define USBD_INTEN_ENDEPOUT4_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT4_Pos ) /*!< Bit mask of ENDEPOUT4 field. */
#define USBD_INTEN_ENDEPOUT4_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT4_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 15 : Enable or disable interrupt for event ENDEPOUT[3] */
#define USBD_INTEN_ENDEPOUT3_Pos           ( 15UL )                              /*!< Position of ENDEPOUT3 field. */
#define USBD_INTEN_ENDEPOUT3_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT3_Pos ) /*!< Bit mask of ENDEPOUT3 field. */
#define USBD_INTEN_ENDEPOUT3_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT3_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event ENDEPOUT[2] */
#define USBD_INTEN_ENDEPOUT2_Pos           ( 14UL )                              /*!< Position of ENDEPOUT2 field. */
#define USBD_INTEN_ENDEPOUT2_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT2_Pos ) /*!< Bit mask of ENDEPOUT2 field. */
#define USBD_INTEN_ENDEPOUT2_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT2_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event ENDEPOUT[1] */
#define USBD_INTEN_ENDEPOUT1_Pos           ( 13UL )                              /*!< Position of ENDEPOUT1 field. */
#define USBD_INTEN_ENDEPOUT1_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT1_Pos ) /*!< Bit mask of ENDEPOUT1 field. */
#define USBD_INTEN_ENDEPOUT1_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT1_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event ENDEPOUT[0] */
#define USBD_INTEN_ENDEPOUT0_Pos           ( 12UL )                              /*!< Position of ENDEPOUT0 field. */
#define USBD_INTEN_ENDEPOUT0_Msk           ( 0x1UL << USBD_INTEN_ENDEPOUT0_Pos ) /*!< Bit mask of ENDEPOUT0 field. */
#define USBD_INTEN_ENDEPOUT0_Disabled      ( 0UL )                               /*!< Disable */
#define USBD_INTEN_ENDEPOUT0_Enabled       ( 1UL )                               /*!< Enable */

/* Bit 11 : Enable or disable interrupt for event ENDISOIN */
#define USBD_INTEN_ENDISOIN_Pos            ( 11UL )                             /*!< Position of ENDISOIN field. */
#define USBD_INTEN_ENDISOIN_Msk            ( 0x1UL << USBD_INTEN_ENDISOIN_Pos ) /*!< Bit mask of ENDISOIN field. */
#define USBD_INTEN_ENDISOIN_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDISOIN_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event EP0DATADONE */
#define USBD_INTEN_EP0DATADONE_Pos         ( 10UL )                                /*!< Position of EP0DATADONE field. */
#define USBD_INTEN_EP0DATADONE_Msk         ( 0x1UL << USBD_INTEN_EP0DATADONE_Pos ) /*!< Bit mask of EP0DATADONE field. */
#define USBD_INTEN_EP0DATADONE_Disabled    ( 0UL )                                 /*!< Disable */
#define USBD_INTEN_EP0DATADONE_Enabled     ( 1UL )                                 /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event ENDEPIN[7] */
#define USBD_INTEN_ENDEPIN7_Pos            ( 9UL )                              /*!< Position of ENDEPIN7 field. */
#define USBD_INTEN_ENDEPIN7_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN7_Pos ) /*!< Bit mask of ENDEPIN7 field. */
#define USBD_INTEN_ENDEPIN7_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN7_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event ENDEPIN[6] */
#define USBD_INTEN_ENDEPIN6_Pos            ( 8UL )                              /*!< Position of ENDEPIN6 field. */
#define USBD_INTEN_ENDEPIN6_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN6_Pos ) /*!< Bit mask of ENDEPIN6 field. */
#define USBD_INTEN_ENDEPIN6_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN6_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event ENDEPIN[5] */
#define USBD_INTEN_ENDEPIN5_Pos            ( 7UL )                              /*!< Position of ENDEPIN5 field. */
#define USBD_INTEN_ENDEPIN5_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN5_Pos ) /*!< Bit mask of ENDEPIN5 field. */
#define USBD_INTEN_ENDEPIN5_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN5_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event ENDEPIN[4] */
#define USBD_INTEN_ENDEPIN4_Pos            ( 6UL )                              /*!< Position of ENDEPIN4 field. */
#define USBD_INTEN_ENDEPIN4_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN4_Pos ) /*!< Bit mask of ENDEPIN4 field. */
#define USBD_INTEN_ENDEPIN4_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN4_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event ENDEPIN[3] */
#define USBD_INTEN_ENDEPIN3_Pos            ( 5UL )                              /*!< Position of ENDEPIN3 field. */
#define USBD_INTEN_ENDEPIN3_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN3_Pos ) /*!< Bit mask of ENDEPIN3 field. */
#define USBD_INTEN_ENDEPIN3_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN3_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event ENDEPIN[2] */
#define USBD_INTEN_ENDEPIN2_Pos            ( 4UL )                              /*!< Position of ENDEPIN2 field. */
#define USBD_INTEN_ENDEPIN2_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN2_Pos ) /*!< Bit mask of ENDEPIN2 field. */
#define USBD_INTEN_ENDEPIN2_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN2_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event ENDEPIN[1] */
#define USBD_INTEN_ENDEPIN1_Pos            ( 3UL )                              /*!< Position of ENDEPIN1 field. */
#define USBD_INTEN_ENDEPIN1_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN1_Pos ) /*!< Bit mask of ENDEPIN1 field. */
#define USBD_INTEN_ENDEPIN1_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN1_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event ENDEPIN[0] */
#define USBD_INTEN_ENDEPIN0_Pos            ( 2UL )                              /*!< Position of ENDEPIN0 field. */
#define USBD_INTEN_ENDEPIN0_Msk            ( 0x1UL << USBD_INTEN_ENDEPIN0_Pos ) /*!< Bit mask of ENDEPIN0 field. */
#define USBD_INTEN_ENDEPIN0_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_ENDEPIN0_Enabled        ( 1UL )                              /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event STARTED */
#define USBD_INTEN_STARTED_Pos             ( 1UL )                             /*!< Position of STARTED field. */
#define USBD_INTEN_STARTED_Msk             ( 0x1UL << USBD_INTEN_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define USBD_INTEN_STARTED_Disabled        ( 0UL )                             /*!< Disable */
#define USBD_INTEN_STARTED_Enabled         ( 1UL )                             /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event USBRESET */
#define USBD_INTEN_USBRESET_Pos            ( 0UL )                              /*!< Position of USBRESET field. */
#define USBD_INTEN_USBRESET_Msk            ( 0x1UL << USBD_INTEN_USBRESET_Pos ) /*!< Bit mask of USBRESET field. */
#define USBD_INTEN_USBRESET_Disabled       ( 0UL )                              /*!< Disable */
#define USBD_INTEN_USBRESET_Enabled        ( 1UL )                              /*!< Enable */

