FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: USBD_INTENSET */
/* Description: Enable interrupt */

/* Bit 24 : Write '1' to enable interrupt for event EPDATA */
#define USBD_INTENSET_EPDATA_Pos              ( 24UL )                              /*!< Position of EPDATA field. */
#define USBD_INTENSET_EPDATA_Msk              ( 0x1UL << USBD_INTENSET_EPDATA_Pos ) /*!< Bit mask of EPDATA field. */
#define USBD_INTENSET_EPDATA_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define USBD_INTENSET_EPDATA_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define USBD_INTENSET_EPDATA_Set              ( 1UL )                               /*!< Enable */

/* Bit 23 : Write '1' to enable interrupt for event EP0SETUP */
#define USBD_INTENSET_EP0SETUP_Pos            ( 23UL )                                /*!< Position of EP0SETUP field. */
#define USBD_INTENSET_EP0SETUP_Msk            ( 0x1UL << USBD_INTENSET_EP0SETUP_Pos ) /*!< Bit mask of EP0SETUP field. */
#define USBD_INTENSET_EP0SETUP_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_EP0SETUP_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_EP0SETUP_Set            ( 1UL )                                 /*!< Enable */

/* Bit 22 : Write '1' to enable interrupt for event USBEVENT */
#define USBD_INTENSET_USBEVENT_Pos            ( 22UL )                                /*!< Position of USBEVENT field. */
#define USBD_INTENSET_USBEVENT_Msk            ( 0x1UL << USBD_INTENSET_USBEVENT_Pos ) /*!< Bit mask of USBEVENT field. */
#define USBD_INTENSET_USBEVENT_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_USBEVENT_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_USBEVENT_Set            ( 1UL )                                 /*!< Enable */

/* Bit 21 : Write '1' to enable interrupt for event SOF */
#define USBD_INTENSET_SOF_Pos                 ( 21UL )                           /*!< Position of SOF field. */
#define USBD_INTENSET_SOF_Msk                 ( 0x1UL << USBD_INTENSET_SOF_Pos ) /*!< Bit mask of SOF field. */
#define USBD_INTENSET_SOF_Disabled            ( 0UL )                            /*!< Read: Disabled */
#define USBD_INTENSET_SOF_Enabled             ( 1UL )                            /*!< Read: Enabled */
#define USBD_INTENSET_SOF_Set                 ( 1UL )                            /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event ENDISOOUT */
#define USBD_INTENSET_ENDISOOUT_Pos           ( 20UL )                                 /*!< Position of ENDISOOUT field. */
#define USBD_INTENSET_ENDISOOUT_Msk           ( 0x1UL << USBD_INTENSET_ENDISOOUT_Pos ) /*!< Bit mask of ENDISOOUT field. */
#define USBD_INTENSET_ENDISOOUT_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDISOOUT_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDISOOUT_Set           ( 1UL )                                  /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event ENDEPOUT[7] */
#define USBD_INTENSET_ENDEPOUT7_Pos           ( 19UL )                                 /*!< Position of ENDEPOUT7 field. */
#define USBD_INTENSET_ENDEPOUT7_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT7_Pos ) /*!< Bit mask of ENDEPOUT7 field. */
#define USBD_INTENSET_ENDEPOUT7_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT7_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT7_Set           ( 1UL )                                  /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event ENDEPOUT[6] */
#define USBD_INTENSET_ENDEPOUT6_Pos           ( 18UL )                                 /*!< Position of ENDEPOUT6 field. */
#define USBD_INTENSET_ENDEPOUT6_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT6_Pos ) /*!< Bit mask of ENDEPOUT6 field. */
#define USBD_INTENSET_ENDEPOUT6_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT6_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT6_Set           ( 1UL )                                  /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event ENDEPOUT[5] */
#define USBD_INTENSET_ENDEPOUT5_Pos           ( 17UL )                                 /*!< Position of ENDEPOUT5 field. */
#define USBD_INTENSET_ENDEPOUT5_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT5_Pos ) /*!< Bit mask of ENDEPOUT5 field. */
#define USBD_INTENSET_ENDEPOUT5_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT5_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT5_Set           ( 1UL )                                  /*!< Enable */

/* Bit 16 : Write '1' to enable interrupt for event ENDEPOUT[4] */
#define USBD_INTENSET_ENDEPOUT4_Pos           ( 16UL )                                 /*!< Position of ENDEPOUT4 field. */
#define USBD_INTENSET_ENDEPOUT4_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT4_Pos ) /*!< Bit mask of ENDEPOUT4 field. */
#define USBD_INTENSET_ENDEPOUT4_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT4_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT4_Set           ( 1UL )                                  /*!< Enable */

/* Bit 15 : Write '1' to enable interrupt for event ENDEPOUT[3] */
#define USBD_INTENSET_ENDEPOUT3_Pos           ( 15UL )                                 /*!< Position of ENDEPOUT3 field. */
#define USBD_INTENSET_ENDEPOUT3_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT3_Pos ) /*!< Bit mask of ENDEPOUT3 field. */
#define USBD_INTENSET_ENDEPOUT3_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT3_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT3_Set           ( 1UL )                                  /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event ENDEPOUT[2] */
#define USBD_INTENSET_ENDEPOUT2_Pos           ( 14UL )                                 /*!< Position of ENDEPOUT2 field. */
#define USBD_INTENSET_ENDEPOUT2_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT2_Pos ) /*!< Bit mask of ENDEPOUT2 field. */
#define USBD_INTENSET_ENDEPOUT2_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT2_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT2_Set           ( 1UL )                                  /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event ENDEPOUT[1] */
#define USBD_INTENSET_ENDEPOUT1_Pos           ( 13UL )                                 /*!< Position of ENDEPOUT1 field. */
#define USBD_INTENSET_ENDEPOUT1_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT1_Pos ) /*!< Bit mask of ENDEPOUT1 field. */
#define USBD_INTENSET_ENDEPOUT1_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT1_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT1_Set           ( 1UL )                                  /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event ENDEPOUT[0] */
#define USBD_INTENSET_ENDEPOUT0_Pos           ( 12UL )                                 /*!< Position of ENDEPOUT0 field. */
#define USBD_INTENSET_ENDEPOUT0_Msk           ( 0x1UL << USBD_INTENSET_ENDEPOUT0_Pos ) /*!< Bit mask of ENDEPOUT0 field. */
#define USBD_INTENSET_ENDEPOUT0_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPOUT0_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPOUT0_Set           ( 1UL )                                  /*!< Enable */

/* Bit 11 : Write '1' to enable interrupt for event ENDISOIN */
#define USBD_INTENSET_ENDISOIN_Pos            ( 11UL )                                /*!< Position of ENDISOIN field. */
#define USBD_INTENSET_ENDISOIN_Msk            ( 0x1UL << USBD_INTENSET_ENDISOIN_Pos ) /*!< Bit mask of ENDISOIN field. */
#define USBD_INTENSET_ENDISOIN_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDISOIN_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDISOIN_Set            ( 1UL )                                 /*!< Enable */

