FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 21 : Write '1' to disable interrupt for event SOF */
#define USBD_INTENCLR_SOF_Pos                 ( 21UL )                           /*!< Position of SOF field. */
#define USBD_INTENCLR_SOF_Msk                 ( 0x1UL << USBD_INTENCLR_SOF_Pos ) /*!< Bit mask of SOF field. */
#define USBD_INTENCLR_SOF_Disabled            ( 0UL )                            /*!< Read: Disabled */
#define USBD_INTENCLR_SOF_Enabled             ( 1UL )                            /*!< Read: Enabled */
#define USBD_INTENCLR_SOF_Clear               ( 1UL )                            /*!< Disable */

/* Bit 20 : Write '1' to disable interrupt for event ENDISOOUT */
#define USBD_INTENCLR_ENDISOOUT_Pos           ( 20UL )                                 /*!< Position of ENDISOOUT field. */
#define USBD_INTENCLR_ENDISOOUT_Msk           ( 0x1UL << USBD_INTENCLR_ENDISOOUT_Pos ) /*!< Bit mask of ENDISOOUT field. */
#define USBD_INTENCLR_ENDISOOUT_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDISOOUT_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDISOOUT_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event ENDEPOUT[7] */
#define USBD_INTENCLR_ENDEPOUT7_Pos           ( 19UL )                                 /*!< Position of ENDEPOUT7 field. */
#define USBD_INTENCLR_ENDEPOUT7_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT7_Pos ) /*!< Bit mask of ENDEPOUT7 field. */
#define USBD_INTENCLR_ENDEPOUT7_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT7_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT7_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event ENDEPOUT[6] */
#define USBD_INTENCLR_ENDEPOUT6_Pos           ( 18UL )                                 /*!< Position of ENDEPOUT6 field. */
#define USBD_INTENCLR_ENDEPOUT6_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT6_Pos ) /*!< Bit mask of ENDEPOUT6 field. */
#define USBD_INTENCLR_ENDEPOUT6_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT6_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT6_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event ENDEPOUT[5] */
#define USBD_INTENCLR_ENDEPOUT5_Pos           ( 17UL )                                 /*!< Position of ENDEPOUT5 field. */
#define USBD_INTENCLR_ENDEPOUT5_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT5_Pos ) /*!< Bit mask of ENDEPOUT5 field. */
#define USBD_INTENCLR_ENDEPOUT5_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT5_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT5_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 16 : Write '1' to disable interrupt for event ENDEPOUT[4] */
#define USBD_INTENCLR_ENDEPOUT4_Pos           ( 16UL )                                 /*!< Position of ENDEPOUT4 field. */
#define USBD_INTENCLR_ENDEPOUT4_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT4_Pos ) /*!< Bit mask of ENDEPOUT4 field. */
#define USBD_INTENCLR_ENDEPOUT4_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT4_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT4_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 15 : Write '1' to disable interrupt for event ENDEPOUT[3] */
#define USBD_INTENCLR_ENDEPOUT3_Pos           ( 15UL )                                 /*!< Position of ENDEPOUT3 field. */
#define USBD_INTENCLR_ENDEPOUT3_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT3_Pos ) /*!< Bit mask of ENDEPOUT3 field. */
#define USBD_INTENCLR_ENDEPOUT3_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT3_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT3_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 14 : Write '1' to disable interrupt for event ENDEPOUT[2] */
#define USBD_INTENCLR_ENDEPOUT2_Pos           ( 14UL )                                 /*!< Position of ENDEPOUT2 field. */
#define USBD_INTENCLR_ENDEPOUT2_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT2_Pos ) /*!< Bit mask of ENDEPOUT2 field. */
#define USBD_INTENCLR_ENDEPOUT2_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT2_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT2_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 13 : Write '1' to disable interrupt for event ENDEPOUT[1] */
#define USBD_INTENCLR_ENDEPOUT1_Pos           ( 13UL )                                 /*!< Position of ENDEPOUT1 field. */
#define USBD_INTENCLR_ENDEPOUT1_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT1_Pos ) /*!< Bit mask of ENDEPOUT1 field. */
#define USBD_INTENCLR_ENDEPOUT1_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT1_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT1_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event ENDEPOUT[0] */
#define USBD_INTENCLR_ENDEPOUT0_Pos           ( 12UL )                                 /*!< Position of ENDEPOUT0 field. */
#define USBD_INTENCLR_ENDEPOUT0_Msk           ( 0x1UL << USBD_INTENCLR_ENDEPOUT0_Pos ) /*!< Bit mask of ENDEPOUT0 field. */
#define USBD_INTENCLR_ENDEPOUT0_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPOUT0_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPOUT0_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 11 : Write '1' to disable interrupt for event ENDISOIN */
#define USBD_INTENCLR_ENDISOIN_Pos            ( 11UL )                                /*!< Position of ENDISOIN field. */
#define USBD_INTENCLR_ENDISOIN_Msk            ( 0x1UL << USBD_INTENCLR_ENDISOIN_Pos ) /*!< Bit mask of ENDISOIN field. */
#define USBD_INTENCLR_ENDISOIN_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDISOIN_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDISOIN_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event EP0DATADONE */
#define USBD_INTENCLR_EP0DATADONE_Pos         ( 10UL )                                   /*!< Position of EP0DATADONE field. */
#define USBD_INTENCLR_EP0DATADONE_Msk         ( 0x1UL << USBD_INTENCLR_EP0DATADONE_Pos ) /*!< Bit mask of EP0DATADONE field. */
#define USBD_INTENCLR_EP0DATADONE_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define USBD_INTENCLR_EP0DATADONE_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define USBD_INTENCLR_EP0DATADONE_Clear       ( 1UL )                                    /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event ENDEPIN[7] */
#define USBD_INTENCLR_ENDEPIN7_Pos            ( 9UL )                                 /*!< Position of ENDEPIN7 field. */
#define USBD_INTENCLR_ENDEPIN7_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN7_Pos ) /*!< Bit mask of ENDEPIN7 field. */
#define USBD_INTENCLR_ENDEPIN7_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN7_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN7_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event ENDEPIN[6] */
#define USBD_INTENCLR_ENDEPIN6_Pos            ( 8UL )                                 /*!< Position of ENDEPIN6 field. */
#define USBD_INTENCLR_ENDEPIN6_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN6_Pos ) /*!< Bit mask of ENDEPIN6 field. */
#define USBD_INTENCLR_ENDEPIN6_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN6_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN6_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event ENDEPIN[5] */
#define USBD_INTENCLR_ENDEPIN5_Pos            ( 7UL )                                 /*!< Position of ENDEPIN5 field. */
#define USBD_INTENCLR_ENDEPIN5_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN5_Pos ) /*!< Bit mask of ENDEPIN5 field. */
#define USBD_INTENCLR_ENDEPIN5_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN5_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN5_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event ENDEPIN[4] */
#define USBD_INTENCLR_ENDEPIN4_Pos            ( 6UL )                                 /*!< Position of ENDEPIN4 field. */
#define USBD_INTENCLR_ENDEPIN4_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN4_Pos ) /*!< Bit mask of ENDEPIN4 field. */
#define USBD_INTENCLR_ENDEPIN4_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN4_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN4_Clear          ( 1UL )                                 /*!< Disable */

