FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 5 : Write '1' to disable interrupt for event ENDEPIN[3] */
#define USBD_INTENCLR_ENDEPIN3_Pos            ( 5UL )                                 /*!< Position of ENDEPIN3 field. */
#define USBD_INTENCLR_ENDEPIN3_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN3_Pos ) /*!< Bit mask of ENDEPIN3 field. */
#define USBD_INTENCLR_ENDEPIN3_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN3_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN3_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event ENDEPIN[2] */
#define USBD_INTENCLR_ENDEPIN2_Pos            ( 4UL )                                 /*!< Position of ENDEPIN2 field. */
#define USBD_INTENCLR_ENDEPIN2_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN2_Pos ) /*!< Bit mask of ENDEPIN2 field. */
#define USBD_INTENCLR_ENDEPIN2_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN2_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN2_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event ENDEPIN[1] */
#define USBD_INTENCLR_ENDEPIN1_Pos            ( 3UL )                                 /*!< Position of ENDEPIN1 field. */
#define USBD_INTENCLR_ENDEPIN1_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN1_Pos ) /*!< Bit mask of ENDEPIN1 field. */
#define USBD_INTENCLR_ENDEPIN1_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN1_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN1_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event ENDEPIN[0] */
#define USBD_INTENCLR_ENDEPIN0_Pos            ( 2UL )                                 /*!< Position of ENDEPIN0 field. */
#define USBD_INTENCLR_ENDEPIN0_Msk            ( 0x1UL << USBD_INTENCLR_ENDEPIN0_Pos ) /*!< Bit mask of ENDEPIN0 field. */
#define USBD_INTENCLR_ENDEPIN0_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_ENDEPIN0_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_ENDEPIN0_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event STARTED */
#define USBD_INTENCLR_STARTED_Pos             ( 1UL )                                /*!< Position of STARTED field. */
#define USBD_INTENCLR_STARTED_Msk             ( 0x1UL << USBD_INTENCLR_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define USBD_INTENCLR_STARTED_Disabled        ( 0UL )                                /*!< Read: Disabled */
#define USBD_INTENCLR_STARTED_Enabled         ( 1UL )                                /*!< Read: Enabled */
#define USBD_INTENCLR_STARTED_Clear           ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event USBRESET */
#define USBD_INTENCLR_USBRESET_Pos            ( 0UL )                                 /*!< Position of USBRESET field. */
#define USBD_INTENCLR_USBRESET_Msk            ( 0x1UL << USBD_INTENCLR_USBRESET_Pos ) /*!< Bit mask of USBRESET field. */
#define USBD_INTENCLR_USBRESET_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_USBRESET_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_USBRESET_Clear          ( 1UL )                                 /*!< Disable */

/* Register: USBD_EVENTCAUSE */
/* Description: Details on what caused the USBEVENT event */

/* Bit 11 : USB device is ready for normal operation. Write '1' to clear. */
#define USBD_EVENTCAUSE_READY_Pos                  ( 11UL )                               /*!< Position of READY field. */
#define USBD_EVENTCAUSE_READY_Msk                  ( 0x1UL << USBD_EVENTCAUSE_READY_Pos ) /*!< Bit mask of READY field. */
#define USBD_EVENTCAUSE_READY_NotDetected          ( 0UL )                                /*!< USBEVENT was not issued due to USBD peripheral ready */
#define USBD_EVENTCAUSE_READY_Ready                ( 1UL )                                /*!< USBD peripheral is ready */

/* Bit 10 : USB MAC has been woken up and operational. Write '1' to clear. */
#define USBD_EVENTCAUSE_USBWUALLOWED_Pos           ( 10UL )                                      /*!< Position of USBWUALLOWED field. */
#define USBD_EVENTCAUSE_USBWUALLOWED_Msk           ( 0x1UL << USBD_EVENTCAUSE_USBWUALLOWED_Pos ) /*!< Bit mask of USBWUALLOWED field. */
#define USBD_EVENTCAUSE_USBWUALLOWED_NotAllowed    ( 0UL )                                       /*!< Wake up not allowed */
#define USBD_EVENTCAUSE_USBWUALLOWED_Allowed       ( 1UL )                                       /*!< Wake up allowed */

/* Bit 9 : Signals that a RESUME condition (K state or activity restart) has been detected on USB lines. Write '1' to clear. */
#define USBD_EVENTCAUSE_RESUME_Pos                 ( 9UL )                                 /*!< Position of RESUME field. */
#define USBD_EVENTCAUSE_RESUME_Msk                 ( 0x1UL << USBD_EVENTCAUSE_RESUME_Pos ) /*!< Bit mask of RESUME field. */
#define USBD_EVENTCAUSE_RESUME_NotDetected         ( 0UL )                                 /*!< Resume not detected */
#define USBD_EVENTCAUSE_RESUME_Detected            ( 1UL )                                 /*!< Resume detected */

/* Bit 8 : Signals that USB lines have been idle long enough for the device to enter suspend. Write '1' to clear. */
#define USBD_EVENTCAUSE_SUSPEND_Pos                ( 8UL )                                  /*!< Position of SUSPEND field. */
#define USBD_EVENTCAUSE_SUSPEND_Msk                ( 0x1UL << USBD_EVENTCAUSE_SUSPEND_Pos ) /*!< Bit mask of SUSPEND field. */
#define USBD_EVENTCAUSE_SUSPEND_NotDetected        ( 0UL )                                  /*!< Suspend not detected */
#define USBD_EVENTCAUSE_SUSPEND_Detected           ( 1UL )                                  /*!< Suspend detected */

/* Bit 0 : CRC error was detected on isochronous OUT endpoint 8. Write '1' to clear. */
#define USBD_EVENTCAUSE_ISOOUTCRC_Pos              ( 0UL )                                    /*!< Position of ISOOUTCRC field. */
#define USBD_EVENTCAUSE_ISOOUTCRC_Msk              ( 0x1UL << USBD_EVENTCAUSE_ISOOUTCRC_Pos ) /*!< Bit mask of ISOOUTCRC field. */
#define USBD_EVENTCAUSE_ISOOUTCRC_NotDetected      ( 0UL )                                    /*!< No error detected */
#define USBD_EVENTCAUSE_ISOOUTCRC_Detected         ( 1UL )                                    /*!< Error detected */

/* Register: USBD_HALTED_EPIN */
/* Description: Description collection: IN endpoint halted status. Can be used as is as response to a GetStatus() request to endpoint. */

