FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bits 6..0 : Number of bytes received last in the data stage of this OUT endpoint */
#define USBD_SIZE_EPOUT_SIZE_Pos    ( 0UL )                                /*!< Position of SIZE field. */
#define USBD_SIZE_EPOUT_SIZE_Msk    ( 0x7FUL << USBD_SIZE_EPOUT_SIZE_Pos ) /*!< Bit mask of SIZE field. */

/* Register: USBD_SIZE_ISOOUT */
/* Description: Number of bytes received last on this ISO OUT data endpoint */

/* Bit 16 : Zero-length data packet received */
#define USBD_SIZE_ISOOUT_ZERO_Pos         ( 16UL )                               /*!< Position of ZERO field. */
#define USBD_SIZE_ISOOUT_ZERO_Msk         ( 0x1UL << USBD_SIZE_ISOOUT_ZERO_Pos ) /*!< Bit mask of ZERO field. */
#define USBD_SIZE_ISOOUT_ZERO_Normal      ( 0UL )                                /*!< No zero-length data received, use value in SIZE */
#define USBD_SIZE_ISOOUT_ZERO_ZeroData    ( 1UL )                                /*!< Zero-length data received, ignore value in SIZE */

/* Bits 9..0 : Number of bytes received last on this ISO OUT data endpoint */
#define USBD_SIZE_ISOOUT_SIZE_Pos         ( 0UL )                                  /*!< Position of SIZE field. */
#define USBD_SIZE_ISOOUT_SIZE_Msk         ( 0x3FFUL << USBD_SIZE_ISOOUT_SIZE_Pos ) /*!< Bit mask of SIZE field. */

/* Register: USBD_ENABLE */
/* Description: Enable USB */

/* Bit 0 : Enable USB */
#define USBD_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define USBD_ENABLE_ENABLE_Msk         ( 0x1UL << USBD_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define USBD_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< USB peripheral is disabled */
#define USBD_ENABLE_ENABLE_Enabled     ( 1UL )                             /*!< USB peripheral is enabled */

/* Register: USBD_USBPULLUP */
/* Description: Control of the USB pull-up */

/* Bit 0 : Control of the USB pull-up on the D+ line */
#define USBD_USBPULLUP_CONNECT_Pos         ( 0UL )                                 /*!< Position of CONNECT field. */
#define USBD_USBPULLUP_CONNECT_Msk         ( 0x1UL << USBD_USBPULLUP_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define USBD_USBPULLUP_CONNECT_Disabled    ( 0UL )                                 /*!< Pull-up is disconnected */
#define USBD_USBPULLUP_CONNECT_Enabled     ( 1UL )                                 /*!< Pull-up is connected to D+ */

/* Register: USBD_DPDMVALUE */
/* Description: State D+ and D- lines will be forced into by the DPDMDRIVE task. The DPDMNODRIVE task reverts the control of the lines to MAC IP (no forcing). */

/* Bits 4..0 : State D+ and D- lines will be forced into by the DPDMDRIVE task */
#define USBD_DPDMVALUE_STATE_Pos       ( 0UL )                                /*!< Position of STATE field. */
#define USBD_DPDMVALUE_STATE_Msk       ( 0x1FUL << USBD_DPDMVALUE_STATE_Pos ) /*!< Bit mask of STATE field. */
#define USBD_DPDMVALUE_STATE_Resume    ( 1UL )                                /*!< D+ forced low, D- forced high (K state) for a timing preset in hardware (50 us or 5 ms, depending on bus state) */
#define USBD_DPDMVALUE_STATE_J         ( 2UL )                                /*!< D+ forced high, D- forced low (J state) */
#define USBD_DPDMVALUE_STATE_K         ( 4UL )                                /*!< D+ forced low, D- forced high (K state) */

/* Register: USBD_DTOGGLE */
/* Description: Data toggle control and status */

/* Bits 9..8 : Data toggle value */
#define USBD_DTOGGLE_VALUE_Pos      ( 8UL )                             /*!< Position of VALUE field. */
#define USBD_DTOGGLE_VALUE_Msk      ( 0x3UL << USBD_DTOGGLE_VALUE_Pos ) /*!< Bit mask of VALUE field. */
#define USBD_DTOGGLE_VALUE_Nop      ( 0UL )                             /*!< No action on data toggle when writing the register with this value */
#define USBD_DTOGGLE_VALUE_Data0    ( 1UL )                             /*!< Data toggle is DATA0 on endpoint set by EP and IO */
#define USBD_DTOGGLE_VALUE_Data1    ( 2UL )                             /*!< Data toggle is DATA1 on endpoint set by EP and IO */

/* Bit 7 : Selects IN or OUT endpoint */
#define USBD_DTOGGLE_IO_Pos         ( 7UL )                          /*!< Position of IO field. */
#define USBD_DTOGGLE_IO_Msk         ( 0x1UL << USBD_DTOGGLE_IO_Pos ) /*!< Bit mask of IO field. */
#define USBD_DTOGGLE_IO_Out         ( 0UL )                          /*!< Selects OUT endpoint */
#define USBD_DTOGGLE_IO_In          ( 1UL )                          /*!< Selects IN endpoint */

/* Bits 2..0 : Select bulk endpoint number */
#define USBD_DTOGGLE_EP_Pos         ( 0UL )                          /*!< Position of EP field. */
#define USBD_DTOGGLE_EP_Msk         ( 0x7UL << USBD_DTOGGLE_EP_Pos ) /*!< Bit mask of EP field. */

/* Register: USBD_EPINEN */
/* Description: Endpoint IN enable */

/* Bit 8 : Enable ISO IN endpoint */
#define USBD_EPINEN_ISOIN_Pos        ( 8UL )                            /*!< Position of ISOIN field. */
#define USBD_EPINEN_ISOIN_Msk        ( 0x1UL << USBD_EPINEN_ISOIN_Pos ) /*!< Bit mask of ISOIN field. */
#define USBD_EPINEN_ISOIN_Disable    ( 0UL )                            /*!< Disable ISO IN endpoint 8 */
#define USBD_EPINEN_ISOIN_Enable     ( 1UL )                            /*!< Enable ISO IN endpoint 8 */

/* Bit 7 : Enable IN endpoint 7 */
#define USBD_EPINEN_IN7_Pos          ( 7UL )                          /*!< Position of IN7 field. */
#define USBD_EPINEN_IN7_Msk          ( 0x1UL << USBD_EPINEN_IN7_Pos ) /*!< Bit mask of IN7 field. */
#define USBD_EPINEN_IN7_Disable      ( 0UL )                          /*!< Disable endpoint IN 7 (no response to IN tokens) */
#define USBD_EPINEN_IN7_Enable       ( 1UL )                          /*!< Enable endpoint IN 7 (response to IN tokens) */

/* Bit 6 : Enable IN endpoint 6 */
#define USBD_EPINEN_IN6_Pos          ( 6UL )                          /*!< Position of IN6 field. */
#define USBD_EPINEN_IN6_Msk          ( 0x1UL << USBD_EPINEN_IN6_Pos ) /*!< Bit mask of IN6 field. */
#define USBD_EPINEN_IN6_Disable      ( 0UL )                          /*!< Disable endpoint IN 6 (no response to IN tokens) */
#define USBD_EPINEN_IN6_Enable       ( 1UL )                          /*!< Enable endpoint IN 6 (response to IN tokens) */

/* Bit 5 : Enable IN endpoint 5 */
#define USBD_EPINEN_IN5_Pos          ( 5UL )                          /*!< Position of IN5 field. */
#define USBD_EPINEN_IN5_Msk          ( 0x1UL << USBD_EPINEN_IN5_Pos ) /*!< Bit mask of IN5 field. */
#define USBD_EPINEN_IN5_Disable      ( 0UL )                          /*!< Disable endpoint IN 5 (no response to IN tokens) */
#define USBD_EPINEN_IN5_Enable       ( 1UL )                          /*!< Enable endpoint IN 5 (response to IN tokens) */

/* Bit 4 : Enable IN endpoint 4 */
#define USBD_EPINEN_IN4_Pos          ( 4UL )                          /*!< Position of IN4 field. */
#define USBD_EPINEN_IN4_Msk          ( 0x1UL << USBD_EPINEN_IN4_Pos ) /*!< Bit mask of IN4 field. */
#define USBD_EPINEN_IN4_Disable      ( 0UL )                          /*!< Disable endpoint IN 4 (no response to IN tokens) */
#define USBD_EPINEN_IN4_Enable       ( 1UL )                          /*!< Enable endpoint IN 4 (response to IN tokens) */

/* Bit 3 : Enable IN endpoint 3 */
#define USBD_EPINEN_IN3_Pos          ( 3UL )                          /*!< Position of IN3 field. */
#define USBD_EPINEN_IN3_Msk          ( 0x1UL << USBD_EPINEN_IN3_Pos ) /*!< Bit mask of IN3 field. */
#define USBD_EPINEN_IN3_Disable      ( 0UL )                          /*!< Disable endpoint IN 3 (no response to IN tokens) */
#define USBD_EPINEN_IN3_Enable       ( 1UL )                          /*!< Enable endpoint IN 3 (response to IN tokens) */

/* Bit 2 : Enable IN endpoint 2 */
#define USBD_EPINEN_IN2_Pos          ( 2UL )                          /*!< Position of IN2 field. */
#define USBD_EPINEN_IN2_Msk          ( 0x1UL << USBD_EPINEN_IN2_Pos ) /*!< Bit mask of IN2 field. */
#define USBD_EPINEN_IN2_Disable      ( 0UL )                          /*!< Disable endpoint IN 2 (no response to IN tokens) */
#define USBD_EPINEN_IN2_Enable       ( 1UL )                          /*!< Enable endpoint IN 2 (response to IN tokens) */

/* Bit 1 : Enable IN endpoint 1 */
#define USBD_EPINEN_IN1_Pos          ( 1UL )                          /*!< Position of IN1 field. */
#define USBD_EPINEN_IN1_Msk          ( 0x1UL << USBD_EPINEN_IN1_Pos ) /*!< Bit mask of IN1 field. */
#define USBD_EPINEN_IN1_Disable      ( 0UL )                          /*!< Disable endpoint IN 1 (no response to IN tokens) */
#define USBD_EPINEN_IN1_Enable       ( 1UL )                          /*!< Enable endpoint IN 1 (response to IN tokens) */

/* Bit 0 : Enable IN endpoint 0 */
#define USBD_EPINEN_IN0_Pos          ( 0UL )                          /*!< Position of IN0 field. */
#define USBD_EPINEN_IN0_Msk          ( 0x1UL << USBD_EPINEN_IN0_Pos ) /*!< Bit mask of IN0 field. */
#define USBD_EPINEN_IN0_Disable      ( 0UL )                          /*!< Disable endpoint IN 0 (no response to IN tokens) */
#define USBD_EPINEN_IN0_Enable       ( 1UL )                          /*!< Enable endpoint IN 0 (response to IN tokens) */

/* Register: USBD_EPOUTEN */
/* Description: Endpoint OUT enable */

/* Bit 8 : Enable ISO OUT endpoint 8 */
#define USBD_EPOUTEN_ISOOUT_Pos        ( 8UL )                              /*!< Position of ISOOUT field. */
#define USBD_EPOUTEN_ISOOUT_Msk        ( 0x1UL << USBD_EPOUTEN_ISOOUT_Pos ) /*!< Bit mask of ISOOUT field. */
#define USBD_EPOUTEN_ISOOUT_Disable    ( 0UL )                              /*!< Disable ISO OUT endpoint 8 */
#define USBD_EPOUTEN_ISOOUT_Enable     ( 1UL )                              /*!< Enable ISO OUT endpoint 8 */

