FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: USBREG_EVENTS_USBDETECTED */
/* Description: Voltage supply detected on VBUS */

/* Bit 0 : Voltage supply detected on VBUS */
#define USBREG_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Pos             ( 0UL )                                                       /*!< Position of EVENTS_USBDETECTED field. */
#define USBREG_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Msk             ( 0x1UL << USBREG_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Pos ) /*!< Bit mask of EVENTS_USBDETECTED field. */
#define USBREG_EVENTS_USBDETECTED_EVENTS_USBDETECTED_NotGenerated    ( 0UL )                                                       /*!< Event not generated */
#define USBREG_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Generated       ( 1UL )                                                       /*!< Event generated */

/* Register: USBREG_EVENTS_USBREMOVED */
/* Description: Voltage supply removed from VBUS */

/* Bit 0 : Voltage supply removed from VBUS */
#define USBREG_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Pos             ( 0UL )                                                     /*!< Position of EVENTS_USBREMOVED field. */
#define USBREG_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Msk             ( 0x1UL << USBREG_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Pos ) /*!< Bit mask of EVENTS_USBREMOVED field. */
#define USBREG_EVENTS_USBREMOVED_EVENTS_USBREMOVED_NotGenerated    ( 0UL )                                                     /*!< Event not generated */
#define USBREG_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Generated       ( 1UL )                                                     /*!< Event generated */

/* Register: USBREG_EVENTS_USBPWRRDY */
/* Description: USB 3.3 V supply ready */

/* Bit 0 : USB 3.3 V supply ready */
#define USBREG_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Pos             ( 0UL )                                                   /*!< Position of EVENTS_USBPWRRDY field. */
#define USBREG_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Msk             ( 0x1UL << USBREG_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Pos ) /*!< Bit mask of EVENTS_USBPWRRDY field. */
#define USBREG_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_NotGenerated    ( 0UL )                                                   /*!< Event not generated */
#define USBREG_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Generated       ( 1UL )                                                   /*!< Event generated */

/* Register: USBREG_PUBLISH_USBDETECTED */
/* Description: Publish configuration for event USBDETECTED */

/* Bit 31 :   */
#define USBREG_PUBLISH_USBDETECTED_EN_Pos         ( 31UL )                                       /*!< Position of EN field. */
#define USBREG_PUBLISH_USBDETECTED_EN_Msk         ( 0x1UL << USBREG_PUBLISH_USBDETECTED_EN_Pos ) /*!< Bit mask of EN field. */
#define USBREG_PUBLISH_USBDETECTED_EN_Disabled    ( 0UL )                                        /*!< Disable publishing */
#define USBREG_PUBLISH_USBDETECTED_EN_Enabled     ( 1UL )                                        /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event USBDETECTED will publish to. */
#define USBREG_PUBLISH_USBDETECTED_CHIDX_Pos      ( 0UL )                                            /*!< Position of CHIDX field. */
#define USBREG_PUBLISH_USBDETECTED_CHIDX_Msk      ( 0xFFUL << USBREG_PUBLISH_USBDETECTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBREG_PUBLISH_USBREMOVED */
/* Description: Publish configuration for event USBREMOVED */

/* Bit 31 :   */
#define USBREG_PUBLISH_USBREMOVED_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define USBREG_PUBLISH_USBREMOVED_EN_Msk         ( 0x1UL << USBREG_PUBLISH_USBREMOVED_EN_Pos ) /*!< Bit mask of EN field. */
#define USBREG_PUBLISH_USBREMOVED_EN_Disabled    ( 0UL )                                       /*!< Disable publishing */
#define USBREG_PUBLISH_USBREMOVED_EN_Enabled     ( 1UL )                                       /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event USBREMOVED will publish to. */
#define USBREG_PUBLISH_USBREMOVED_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define USBREG_PUBLISH_USBREMOVED_CHIDX_Msk      ( 0xFFUL << USBREG_PUBLISH_USBREMOVED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBREG_PUBLISH_USBPWRRDY */
/* Description: Publish configuration for event USBPWRRDY */

/* Bit 31 :   */
#define USBREG_PUBLISH_USBPWRRDY_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define USBREG_PUBLISH_USBPWRRDY_EN_Msk         ( 0x1UL << USBREG_PUBLISH_USBPWRRDY_EN_Pos ) /*!< Bit mask of EN field. */
#define USBREG_PUBLISH_USBPWRRDY_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define USBREG_PUBLISH_USBPWRRDY_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event USBPWRRDY will publish to. */
#define USBREG_PUBLISH_USBPWRRDY_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define USBREG_PUBLISH_USBPWRRDY_CHIDX_Msk      ( 0xFFUL << USBREG_PUBLISH_USBPWRRDY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: USBREG_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 2 : Enable or disable interrupt for event USBPWRRDY */
#define USBREG_INTEN_USBPWRRDY_Pos           ( 2UL )                                 /*!< Position of USBPWRRDY field. */
#define USBREG_INTEN_USBPWRRDY_Msk           ( 0x1UL << USBREG_INTEN_USBPWRRDY_Pos ) /*!< Bit mask of USBPWRRDY field. */
#define USBREG_INTEN_USBPWRRDY_Disabled      ( 0UL )                                 /*!< Disable */
#define USBREG_INTEN_USBPWRRDY_Enabled       ( 1UL )                                 /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event USBREMOVED */
#define USBREG_INTEN_USBREMOVED_Pos          ( 1UL )                                  /*!< Position of USBREMOVED field. */
#define USBREG_INTEN_USBREMOVED_Msk          ( 0x1UL << USBREG_INTEN_USBREMOVED_Pos ) /*!< Bit mask of USBREMOVED field. */
#define USBREG_INTEN_USBREMOVED_Disabled     ( 0UL )                                  /*!< Disable */
#define USBREG_INTEN_USBREMOVED_Enabled      ( 1UL )                                  /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event USBDETECTED */
#define USBREG_INTEN_USBDETECTED_Pos         ( 0UL )                                   /*!< Position of USBDETECTED field. */
#define USBREG_INTEN_USBDETECTED_Msk         ( 0x1UL << USBREG_INTEN_USBDETECTED_Pos ) /*!< Bit mask of USBDETECTED field. */
#define USBREG_INTEN_USBDETECTED_Disabled    ( 0UL )                                   /*!< Disable */
#define USBREG_INTEN_USBDETECTED_Enabled     ( 1UL )                                   /*!< Enable */

