FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Register: USBREG_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event USBPWRRDY */
#define USBREG_INTENSET_USBPWRRDY_Pos           ( 2UL )                                    /*!< Position of USBPWRRDY field. */
#define USBREG_INTENSET_USBPWRRDY_Msk           ( 0x1UL << USBREG_INTENSET_USBPWRRDY_Pos ) /*!< Bit mask of USBPWRRDY field. */
#define USBREG_INTENSET_USBPWRRDY_Disabled      ( 0UL )                                    /*!< Read: Disabled */
#define USBREG_INTENSET_USBPWRRDY_Enabled       ( 1UL )                                    /*!< Read: Enabled */
#define USBREG_INTENSET_USBPWRRDY_Set           ( 1UL )                                    /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event USBREMOVED */
#define USBREG_INTENSET_USBREMOVED_Pos          ( 1UL )                                     /*!< Position of USBREMOVED field. */
#define USBREG_INTENSET_USBREMOVED_Msk          ( 0x1UL << USBREG_INTENSET_USBREMOVED_Pos ) /*!< Bit mask of USBREMOVED field. */
#define USBREG_INTENSET_USBREMOVED_Disabled     ( 0UL )                                     /*!< Read: Disabled */
#define USBREG_INTENSET_USBREMOVED_Enabled      ( 1UL )                                     /*!< Read: Enabled */
#define USBREG_INTENSET_USBREMOVED_Set          ( 1UL )                                     /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event USBDETECTED */
#define USBREG_INTENSET_USBDETECTED_Pos         ( 0UL )                                      /*!< Position of USBDETECTED field. */
#define USBREG_INTENSET_USBDETECTED_Msk         ( 0x1UL << USBREG_INTENSET_USBDETECTED_Pos ) /*!< Bit mask of USBDETECTED field. */
#define USBREG_INTENSET_USBDETECTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define USBREG_INTENSET_USBDETECTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define USBREG_INTENSET_USBDETECTED_Set         ( 1UL )                                      /*!< Enable */

/* Register: USBREG_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event USBPWRRDY */
#define USBREG_INTENCLR_USBPWRRDY_Pos           ( 2UL )                                    /*!< Position of USBPWRRDY field. */
#define USBREG_INTENCLR_USBPWRRDY_Msk           ( 0x1UL << USBREG_INTENCLR_USBPWRRDY_Pos ) /*!< Bit mask of USBPWRRDY field. */
#define USBREG_INTENCLR_USBPWRRDY_Disabled      ( 0UL )                                    /*!< Read: Disabled */
#define USBREG_INTENCLR_USBPWRRDY_Enabled       ( 1UL )                                    /*!< Read: Enabled */
#define USBREG_INTENCLR_USBPWRRDY_Clear         ( 1UL )                                    /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event USBREMOVED */
#define USBREG_INTENCLR_USBREMOVED_Pos          ( 1UL )                                     /*!< Position of USBREMOVED field. */
#define USBREG_INTENCLR_USBREMOVED_Msk          ( 0x1UL << USBREG_INTENCLR_USBREMOVED_Pos ) /*!< Bit mask of USBREMOVED field. */
#define USBREG_INTENCLR_USBREMOVED_Disabled     ( 0UL )                                     /*!< Read: Disabled */
#define USBREG_INTENCLR_USBREMOVED_Enabled      ( 1UL )                                     /*!< Read: Enabled */
#define USBREG_INTENCLR_USBREMOVED_Clear        ( 1UL )                                     /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event USBDETECTED */
#define USBREG_INTENCLR_USBDETECTED_Pos         ( 0UL )                                      /*!< Position of USBDETECTED field. */
#define USBREG_INTENCLR_USBDETECTED_Msk         ( 0x1UL << USBREG_INTENCLR_USBDETECTED_Pos ) /*!< Bit mask of USBDETECTED field. */
#define USBREG_INTENCLR_USBDETECTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define USBREG_INTENCLR_USBDETECTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define USBREG_INTENCLR_USBDETECTED_Clear       ( 1UL )                                      /*!< Disable */

/* Register: USBREG_USBREGSTATUS */
/* Description: USB supply status */

/* Bit 1 : USB supply output settling time elapsed */
#define USBREG_USBREGSTATUS_OUTPUTRDY_Pos             ( 1UL )                                        /*!< Position of OUTPUTRDY field. */
#define USBREG_USBREGSTATUS_OUTPUTRDY_Msk             ( 0x1UL << USBREG_USBREGSTATUS_OUTPUTRDY_Pos ) /*!< Bit mask of OUTPUTRDY field. */
#define USBREG_USBREGSTATUS_OUTPUTRDY_NotReady        ( 0UL )                                        /*!< USBREG output settling time not elapsed */
#define USBREG_USBREGSTATUS_OUTPUTRDY_Ready           ( 1UL )                                        /*!< USBREG output settling time elapsed (same information as USBPWRRDY event) */

/* Bit 0 : VBUS input detection status (USBDETECTED and USBREMOVED events are derived from this information) */
#define USBREG_USBREGSTATUS_VBUSDETECT_Pos            ( 0UL )                                         /*!< Position of VBUSDETECT field. */
#define USBREG_USBREGSTATUS_VBUSDETECT_Msk            ( 0x1UL << USBREG_USBREGSTATUS_VBUSDETECT_Pos ) /*!< Bit mask of VBUSDETECT field. */
#define USBREG_USBREGSTATUS_VBUSDETECT_NoVbus         ( 0UL )                                         /*!< VBUS voltage below valid threshold */
#define USBREG_USBREGSTATUS_VBUSDETECT_VbusPresent    ( 1UL )                                         /*!< VBUS voltage above valid threshold */


/* Peripheral: VMC */
/* Description: Volatile Memory controller 0 */

/* Register: VMC_RAM_POWER */
/* Description: Description cluster: RAM[n] power control register */

/* Bit 31 : Keep retention on RAM section S15 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S15RETENTION_Pos    ( 31UL )                                    /*!< Position of S15RETENTION field. */
#define VMC_RAM_POWER_S15RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S15RETENTION_Pos ) /*!< Bit mask of S15RETENTION field. */
#define VMC_RAM_POWER_S15RETENTION_Off    ( 0UL )                                     /*!< Off */
#define VMC_RAM_POWER_S15RETENTION_On     ( 1UL )                                     /*!< On */

/* Bit 30 : Keep retention on RAM section S14 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S14RETENTION_Pos    ( 30UL )                                    /*!< Position of S14RETENTION field. */
#define VMC_RAM_POWER_S14RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S14RETENTION_Pos ) /*!< Bit mask of S14RETENTION field. */
#define VMC_RAM_POWER_S14RETENTION_Off    ( 0UL )                                     /*!< Off */
#define VMC_RAM_POWER_S14RETENTION_On     ( 1UL )                                     /*!< On */

/* Bit 29 : Keep retention on RAM section S13 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S13RETENTION_Pos    ( 29UL )                                    /*!< Position of S13RETENTION field. */
#define VMC_RAM_POWER_S13RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S13RETENTION_Pos ) /*!< Bit mask of S13RETENTION field. */
#define VMC_RAM_POWER_S13RETENTION_Off    ( 0UL )                                     /*!< Off */
#define VMC_RAM_POWER_S13RETENTION_On     ( 1UL )                                     /*!< On */

/* Bit 28 : Keep retention on RAM section S12 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S12RETENTION_Pos    ( 28UL )                                    /*!< Position of S12RETENTION field. */
#define VMC_RAM_POWER_S12RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S12RETENTION_Pos ) /*!< Bit mask of S12RETENTION field. */
#define VMC_RAM_POWER_S12RETENTION_Off    ( 0UL )                                     /*!< Off */
#define VMC_RAM_POWER_S12RETENTION_On     ( 1UL )                                     /*!< On */

/* Bit 27 : Keep retention on RAM section S11 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S11RETENTION_Pos    ( 27UL )                                    /*!< Position of S11RETENTION field. */
#define VMC_RAM_POWER_S11RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S11RETENTION_Pos ) /*!< Bit mask of S11RETENTION field. */
#define VMC_RAM_POWER_S11RETENTION_Off    ( 0UL )                                     /*!< Off */
#define VMC_RAM_POWER_S11RETENTION_On     ( 1UL )                                     /*!< On */

