FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 26 : Keep retention on RAM section S10 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S10RETENTION_Pos    ( 26UL )                                    /*!< Position of S10RETENTION field. */
#define VMC_RAM_POWER_S10RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S10RETENTION_Pos ) /*!< Bit mask of S10RETENTION field. */
#define VMC_RAM_POWER_S10RETENTION_Off    ( 0UL )                                     /*!< Off */
#define VMC_RAM_POWER_S10RETENTION_On     ( 1UL )                                     /*!< On */

/* Bit 25 : Keep retention on RAM section S9 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S9RETENTION_Pos     ( 25UL )                                   /*!< Position of S9RETENTION field. */
#define VMC_RAM_POWER_S9RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S9RETENTION_Pos ) /*!< Bit mask of S9RETENTION field. */
#define VMC_RAM_POWER_S9RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S9RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 24 : Keep retention on RAM section S8 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S8RETENTION_Pos     ( 24UL )                                   /*!< Position of S8RETENTION field. */
#define VMC_RAM_POWER_S8RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S8RETENTION_Pos ) /*!< Bit mask of S8RETENTION field. */
#define VMC_RAM_POWER_S8RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S8RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 23 : Keep retention on RAM section S7 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S7RETENTION_Pos     ( 23UL )                                   /*!< Position of S7RETENTION field. */
#define VMC_RAM_POWER_S7RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S7RETENTION_Pos ) /*!< Bit mask of S7RETENTION field. */
#define VMC_RAM_POWER_S7RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S7RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 22 : Keep retention on RAM section S6 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S6RETENTION_Pos     ( 22UL )                                   /*!< Position of S6RETENTION field. */
#define VMC_RAM_POWER_S6RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S6RETENTION_Pos ) /*!< Bit mask of S6RETENTION field. */
#define VMC_RAM_POWER_S6RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S6RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 21 : Keep retention on RAM section S5 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S5RETENTION_Pos     ( 21UL )                                   /*!< Position of S5RETENTION field. */
#define VMC_RAM_POWER_S5RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S5RETENTION_Pos ) /*!< Bit mask of S5RETENTION field. */
#define VMC_RAM_POWER_S5RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S5RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 20 : Keep retention on RAM section S4 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S4RETENTION_Pos     ( 20UL )                                   /*!< Position of S4RETENTION field. */
#define VMC_RAM_POWER_S4RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S4RETENTION_Pos ) /*!< Bit mask of S4RETENTION field. */
#define VMC_RAM_POWER_S4RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S4RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 19 : Keep retention on RAM section S3 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S3RETENTION_Pos     ( 19UL )                                   /*!< Position of S3RETENTION field. */
#define VMC_RAM_POWER_S3RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S3RETENTION_Pos ) /*!< Bit mask of S3RETENTION field. */
#define VMC_RAM_POWER_S3RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S3RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 18 : Keep retention on RAM section S2 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S2RETENTION_Pos     ( 18UL )                                   /*!< Position of S2RETENTION field. */
#define VMC_RAM_POWER_S2RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S2RETENTION_Pos ) /*!< Bit mask of S2RETENTION field. */
#define VMC_RAM_POWER_S2RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S2RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 17 : Keep retention on RAM section S1 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S1RETENTION_Pos     ( 17UL )                                   /*!< Position of S1RETENTION field. */
#define VMC_RAM_POWER_S1RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S1RETENTION_Pos ) /*!< Bit mask of S1RETENTION field. */
#define VMC_RAM_POWER_S1RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S1RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 16 : Keep retention on RAM section S0 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S0RETENTION_Pos     ( 16UL )                                   /*!< Position of S0RETENTION field. */
#define VMC_RAM_POWER_S0RETENTION_Msk     ( 0x1UL << VMC_RAM_POWER_S0RETENTION_Pos ) /*!< Bit mask of S0RETENTION field. */
#define VMC_RAM_POWER_S0RETENTION_Off     ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S0RETENTION_On      ( 1UL )                                    /*!< On */

/* Bit 15 : Keep RAM section S15 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S15POWER_Pos        ( 15UL )                                /*!< Position of S15POWER field. */
#define VMC_RAM_POWER_S15POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S15POWER_Pos ) /*!< Bit mask of S15POWER field. */
#define VMC_RAM_POWER_S15POWER_Off        ( 0UL )                                 /*!< Off */
#define VMC_RAM_POWER_S15POWER_On         ( 1UL )                                 /*!< On */

/* Bit 14 : Keep RAM section S14 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S14POWER_Pos        ( 14UL )                                /*!< Position of S14POWER field. */
#define VMC_RAM_POWER_S14POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S14POWER_Pos ) /*!< Bit mask of S14POWER field. */
#define VMC_RAM_POWER_S14POWER_Off        ( 0UL )                                 /*!< Off */
#define VMC_RAM_POWER_S14POWER_On         ( 1UL )                                 /*!< On */

/* Bit 13 : Keep RAM section S13 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S13POWER_Pos        ( 13UL )                                /*!< Position of S13POWER field. */
#define VMC_RAM_POWER_S13POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S13POWER_Pos ) /*!< Bit mask of S13POWER field. */
#define VMC_RAM_POWER_S13POWER_Off        ( 0UL )                                 /*!< Off */
#define VMC_RAM_POWER_S13POWER_On         ( 1UL )                                 /*!< On */

/* Bit 12 : Keep RAM section S12 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S12POWER_Pos        ( 12UL )                                /*!< Position of S12POWER field. */
#define VMC_RAM_POWER_S12POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S12POWER_Pos ) /*!< Bit mask of S12POWER field. */
#define VMC_RAM_POWER_S12POWER_Off        ( 0UL )                                 /*!< Off */
#define VMC_RAM_POWER_S12POWER_On         ( 1UL )                                 /*!< On */

/* Bit 11 : Keep RAM section S11 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S11POWER_Pos        ( 11UL )                                /*!< Position of S11POWER field. */
#define VMC_RAM_POWER_S11POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S11POWER_Pos ) /*!< Bit mask of S11POWER field. */
#define VMC_RAM_POWER_S11POWER_Off        ( 0UL )                                 /*!< Off */
#define VMC_RAM_POWER_S11POWER_On         ( 1UL )                                 /*!< On */

/* Bit 10 : Keep RAM section S10 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S10POWER_Pos        ( 10UL )                                /*!< Position of S10POWER field. */
#define VMC_RAM_POWER_S10POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S10POWER_Pos ) /*!< Bit mask of S10POWER field. */
#define VMC_RAM_POWER_S10POWER_Off        ( 0UL )                                 /*!< Off */
#define VMC_RAM_POWER_S10POWER_On         ( 1UL )                                 /*!< On */

