FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 9 : Keep RAM section S9 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S9POWER_Pos         ( 9UL )                                   /*!< Position of S9POWER field. */
#define VMC_RAM_POWERSET_S9POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S9POWER_Pos ) /*!< Bit mask of S9POWER field. */
#define VMC_RAM_POWERSET_S9POWER_On          ( 1UL )                                   /*!< On */

/* Bit 8 : Keep RAM section S8 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S8POWER_Pos         ( 8UL )                                   /*!< Position of S8POWER field. */
#define VMC_RAM_POWERSET_S8POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S8POWER_Pos ) /*!< Bit mask of S8POWER field. */
#define VMC_RAM_POWERSET_S8POWER_On          ( 1UL )                                   /*!< On */

/* Bit 7 : Keep RAM section S7 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S7POWER_Pos         ( 7UL )                                   /*!< Position of S7POWER field. */
#define VMC_RAM_POWERSET_S7POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S7POWER_Pos ) /*!< Bit mask of S7POWER field. */
#define VMC_RAM_POWERSET_S7POWER_On          ( 1UL )                                   /*!< On */

/* Bit 6 : Keep RAM section S6 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S6POWER_Pos         ( 6UL )                                   /*!< Position of S6POWER field. */
#define VMC_RAM_POWERSET_S6POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S6POWER_Pos ) /*!< Bit mask of S6POWER field. */
#define VMC_RAM_POWERSET_S6POWER_On          ( 1UL )                                   /*!< On */

/* Bit 5 : Keep RAM section S5 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S5POWER_Pos         ( 5UL )                                   /*!< Position of S5POWER field. */
#define VMC_RAM_POWERSET_S5POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S5POWER_Pos ) /*!< Bit mask of S5POWER field. */
#define VMC_RAM_POWERSET_S5POWER_On          ( 1UL )                                   /*!< On */

/* Bit 4 : Keep RAM section S4 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S4POWER_Pos         ( 4UL )                                   /*!< Position of S4POWER field. */
#define VMC_RAM_POWERSET_S4POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S4POWER_Pos ) /*!< Bit mask of S4POWER field. */
#define VMC_RAM_POWERSET_S4POWER_On          ( 1UL )                                   /*!< On */

/* Bit 3 : Keep RAM section S3 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S3POWER_Pos         ( 3UL )                                   /*!< Position of S3POWER field. */
#define VMC_RAM_POWERSET_S3POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S3POWER_Pos ) /*!< Bit mask of S3POWER field. */
#define VMC_RAM_POWERSET_S3POWER_On          ( 1UL )                                   /*!< On */

/* Bit 2 : Keep RAM section S2 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S2POWER_Pos         ( 2UL )                                   /*!< Position of S2POWER field. */
#define VMC_RAM_POWERSET_S2POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S2POWER_Pos ) /*!< Bit mask of S2POWER field. */
#define VMC_RAM_POWERSET_S2POWER_On          ( 1UL )                                   /*!< On */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S1POWER_Pos         ( 1UL )                                   /*!< Position of S1POWER field. */
#define VMC_RAM_POWERSET_S1POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWERSET_S1POWER_On          ( 1UL )                                   /*!< On */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S0POWER_Pos         ( 0UL )                                   /*!< Position of S0POWER field. */
#define VMC_RAM_POWERSET_S0POWER_Msk         ( 0x1UL << VMC_RAM_POWERSET_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWERSET_S0POWER_On          ( 1UL )                                   /*!< On */

/* Register: VMC_RAM_POWERCLR */
/* Description: Description cluster: RAM[n] power control clear register */

/* Bit 31 : Keep retention on RAM section S15 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S15RETENTION_Pos    ( 31UL )                                       /*!< Position of S15RETENTION field. */
#define VMC_RAM_POWERCLR_S15RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S15RETENTION_Pos ) /*!< Bit mask of S15RETENTION field. */
#define VMC_RAM_POWERCLR_S15RETENTION_Off    ( 1UL )                                        /*!< Off */

/* Bit 30 : Keep retention on RAM section S14 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S14RETENTION_Pos    ( 30UL )                                       /*!< Position of S14RETENTION field. */
#define VMC_RAM_POWERCLR_S14RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S14RETENTION_Pos ) /*!< Bit mask of S14RETENTION field. */
#define VMC_RAM_POWERCLR_S14RETENTION_Off    ( 1UL )                                        /*!< Off */

/* Bit 29 : Keep retention on RAM section S13 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S13RETENTION_Pos    ( 29UL )                                       /*!< Position of S13RETENTION field. */
#define VMC_RAM_POWERCLR_S13RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S13RETENTION_Pos ) /*!< Bit mask of S13RETENTION field. */
#define VMC_RAM_POWERCLR_S13RETENTION_Off    ( 1UL )                                        /*!< Off */

/* Bit 28 : Keep retention on RAM section S12 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S12RETENTION_Pos    ( 28UL )                                       /*!< Position of S12RETENTION field. */
#define VMC_RAM_POWERCLR_S12RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S12RETENTION_Pos ) /*!< Bit mask of S12RETENTION field. */
#define VMC_RAM_POWERCLR_S12RETENTION_Off    ( 1UL )                                        /*!< Off */

/* Bit 27 : Keep retention on RAM section S11 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S11RETENTION_Pos    ( 27UL )                                       /*!< Position of S11RETENTION field. */
#define VMC_RAM_POWERCLR_S11RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S11RETENTION_Pos ) /*!< Bit mask of S11RETENTION field. */
#define VMC_RAM_POWERCLR_S11RETENTION_Off    ( 1UL )                                        /*!< Off */

