FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_application_bitfields.h
/* Bit 9 : Keep RAM section S9 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S9POWER_Pos         ( 9UL )                                   /*!< Position of S9POWER field. */
#define VMC_RAM_POWERCLR_S9POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S9POWER_Pos ) /*!< Bit mask of S9POWER field. */
#define VMC_RAM_POWERCLR_S9POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 8 : Keep RAM section S8 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S8POWER_Pos         ( 8UL )                                   /*!< Position of S8POWER field. */
#define VMC_RAM_POWERCLR_S8POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S8POWER_Pos ) /*!< Bit mask of S8POWER field. */
#define VMC_RAM_POWERCLR_S8POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 7 : Keep RAM section S7 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S7POWER_Pos         ( 7UL )                                   /*!< Position of S7POWER field. */
#define VMC_RAM_POWERCLR_S7POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S7POWER_Pos ) /*!< Bit mask of S7POWER field. */
#define VMC_RAM_POWERCLR_S7POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 6 : Keep RAM section S6 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S6POWER_Pos         ( 6UL )                                   /*!< Position of S6POWER field. */
#define VMC_RAM_POWERCLR_S6POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S6POWER_Pos ) /*!< Bit mask of S6POWER field. */
#define VMC_RAM_POWERCLR_S6POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 5 : Keep RAM section S5 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S5POWER_Pos         ( 5UL )                                   /*!< Position of S5POWER field. */
#define VMC_RAM_POWERCLR_S5POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S5POWER_Pos ) /*!< Bit mask of S5POWER field. */
#define VMC_RAM_POWERCLR_S5POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 4 : Keep RAM section S4 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S4POWER_Pos         ( 4UL )                                   /*!< Position of S4POWER field. */
#define VMC_RAM_POWERCLR_S4POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S4POWER_Pos ) /*!< Bit mask of S4POWER field. */
#define VMC_RAM_POWERCLR_S4POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 3 : Keep RAM section S3 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S3POWER_Pos         ( 3UL )                                   /*!< Position of S3POWER field. */
#define VMC_RAM_POWERCLR_S3POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S3POWER_Pos ) /*!< Bit mask of S3POWER field. */
#define VMC_RAM_POWERCLR_S3POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 2 : Keep RAM section S2 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S2POWER_Pos         ( 2UL )                                   /*!< Position of S2POWER field. */
#define VMC_RAM_POWERCLR_S2POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S2POWER_Pos ) /*!< Bit mask of S2POWER field. */
#define VMC_RAM_POWERCLR_S2POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S1POWER_Pos         ( 1UL )                                   /*!< Position of S1POWER field. */
#define VMC_RAM_POWERCLR_S1POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWERCLR_S1POWER_Off         ( 1UL )                                   /*!< Off */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S0POWER_Pos         ( 0UL )                                   /*!< Position of S0POWER field. */
#define VMC_RAM_POWERCLR_S0POWER_Msk         ( 0x1UL << VMC_RAM_POWERCLR_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWERCLR_S0POWER_Off         ( 1UL )                                   /*!< Off */


/* Peripheral: WDT */
/* Description: Watchdog Timer 0 */

/* Register: WDT_TASKS_START */
/* Description: Start WDT */

/* Bit 0 : Start WDT */
#define WDT_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Msk        ( 0x1UL << WDT_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: WDT_TASKS_STOP */
/* Description: Stop WDT */

/* Bit 0 : Stop WDT */
#define WDT_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << WDT_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: WDT_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define WDT_SUBSCRIBE_START_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define WDT_SUBSCRIBE_START_EN_Msk         ( 0x1UL << WDT_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define WDT_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define WDT_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define WDT_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define WDT_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << WDT_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: WDT_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define WDT_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define WDT_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << WDT_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define WDT_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define WDT_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define WDT_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define WDT_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << WDT_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

